{
  "id": "201-1A",
  "title": "201.1A — Roles & responsibilities",
  "description": "Learn about Roles & responsibilities in Health & Safety Level 2",
  "layout": "linear-flow",
  "unit": "Unit 201",
  "topic": "Roles & responsibilities",
  "learningOutcomes": [
    "Define the terms 'dutyholder' and 'duty of care' as they apply to workplace health and safety.",
    "Identify the high-level responsibilities of employers, employees, organisations, and clients under H&S and environmental legislation.",
    "Attribute specific workplace safety tasks and scenarios to the correct responsible role."
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "201-1A-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Define the terms 'dutyholder' and 'duty of care' as they apply to workplace health and safety.",
            "bloomLevel": "remember"
          },
          {
            "text": "Identify the high-level responsibilities of employers, employees, organisations, and clients under H&S and environmental legislation.",
            "bloomLevel": "remember"
          },
          {
            "text": "Attribute specific workplace safety tasks and scenarios to the correct responsible role.",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "201-1A-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Duty of Care",
            "definition": "A legal obligation to take reasonable care to avoid acts or omissions that could foreseeably cause harm to others in the workplace."
          },
          {
            "term": "Dutyholder",
            "definition": "An individual or organisation with specific legal responsibilities under health and safety legislation to manage risks and ensure safety."
          },
          {
            "term": "Competent Person",
            "definition": "An individual who has sufficient training, knowledge, and experience to safely perform specific tasks and identify potential hazards."
          },
          {
            "term": "HASAWA",
            "definition": "The Health and Safety at Work etc. Act 1974 is the primary UK legislation defining the legal duties of employers and employees to ensure workplace safety."
          },
          {
            "term": "Client",
            "definition": "The person or organisation for whom a project is being carried out, responsible for providing site information and ensuring safety arrangements are in place."
          }
        ]
      }
    },
    {
      "id": "201-1A-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Duty of Care and the Individual",
        "content": "### In this lesson\nIn this lesson, you will learn how legal responsibilities for safety are assigned to individuals and employers in the workplace. You are exploring these roles within the context of a typical electrical installation project where multiple people must cooperate to stay safe. \n\n*   The legal definitions of a dutyholder and duty of care.\n*   The high-level responsibilities of employers to provide a safe environment.\n*   The legal duties of employees to work safely and follow procedures.\n\n**What this is**\nIn the UK, workplace safety is governed by the **HASAWA** (Health and Safety at Work etc. Act 1974). This act establishes that every person in a workplace has a **Duty of Care**, which is a legal obligation to take reasonable care to avoid acts or omissions that could foreseeably cause harm to others. Within this framework, a **Dutyholder** is an individual or organisation with specific legal responsibilities to manage risks. For example, a site manager is a dutyholder for the site's safety, while an apprentice has a duty of care to their workmates. These terms ensure that safety is not just a suggestion, but a requirement of the law.\n\n**Why it matters**\nUnderstanding these roles is vital because it ensures that everyone knows exactly what is expected of them. In the electrical industry, the risks are high; failing to meet your duty of care could lead to serious injury or prosecution. By identifying who is the relevant **Dutyholder** for a specific task, such as maintaining tools or providing safety briefings, the team can function without gaps in safety management. It also ensures that a **Competent Person** is always assigned to technical tasks, ensuring that those with the right training and experience are the ones making safety-critical decisions.\n\n**Key facts / rules**\n*   The **HASAWA** is the primary legislation that defines the duties of employers and employees.\n*   Employers must provide safe systems of work and a safe working environment.\n*   Employers are responsible for providing necessary training, information, and supervision.\n*   Employees must take reasonable care of their own health and safety and that of others.\n*   Employees are legally required to cooperate with their employer on safety matters.\n*   Employees must not intentionally or recklessly interfere with or misuse safety equipment.\n*   Specific workplace safety tasks, such as reporting a broken ladder, are the legal responsibility of the employee.\n*   Providing correct Personal Protective Equipment (PPE) is a high-level responsibility of the employer.\n\n**How to recognise it**\nYou can recognise these roles by looking at the actions being performed on a job site. If you see someone creating a safety policy or paying for new safety boots, you are looking at an employer fulfilling their role. If you see an electrician wearing their hard hat and checking their voltage indicator before work, you are seeing an employee fulfilling their duty of care. A common confusion is thinking that only the \"boss\" is responsible for safety; however, you can recognise an employee's responsibility whenever a worker stops to report a hazard or follows a written method statement. Another distinguishing feature is the level of authority: an employer has the authority to change the system of work, whereas the employee has the responsibility to follow that system accurately.\n\n**Common mistakes**\nA frequent error is believing that an employee is not responsible if they were \"just following orders\" to work unsafely. Under the **HASAWA**, every employee has an individual duty of care and must refuse to work in a way they know is dangerous. Another mistake is assuming that a **Competent Person** knows everything; even the most experienced electrician must still follow the specific site rules set by the employer.\n\n**Key Points**\n*   **Duty of Care** applies to everyone on site, regardless of their rank.\n*   The **HASAWA** is the \"umbrella\" law for all UK workplace safety.\n*   Employers provide the \"hardware\" (tools, PPE, safe site) and the \"software\" (training, systems).\n*   Employees provide the \"compliance\" (using PPE, following rules, reporting issues).\n\n**Quick recap**\nHealth and safety is a shared responsibility defined by the **HASAWA**. Employers must provide the training and equipment needed to work safely, while employees must use those resources correctly and look out for their colleagues. Everyone is a dutyholder in some capacity, and everyone owes a duty of care to those around them.\n\n### Coming Up Next\nNow that we have covered individuals, we will look at how the wider organisation and the client contribute to a safe working environment."
      }
    },
    {
      "id": "201-1A-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Duty of Care and the Individual",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "201-1A-C1-L1-A",
            "questionText": "State the name of the primary legislation that defines the duties of employers and employees in the UK.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "HASAWA",
              "Health and Safety at Work Act",
              "Health and Safety at Work etc Act 1974"
            ],
            "hint": "Think of the 1974 Act mentioned as the primary legislation in the text."
          },
          {
            "id": "201-1A-C1-L1-B",
            "questionText": "What term identifies the legal obligation to take reasonable care to avoid causing harm to others?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "duty of care",
              "a duty of care",
              "duty of care obligation"
            ],
            "hint": "This term refers to the responsibility everyone has to avoid acts or omissions that cause harm."
          },
          {
            "id": "201-1A-C1-L1-C",
            "questionText": "Identify the term for an individual or organisation with specific legal responsibilities to manage risks.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "dutyholder",
              "a dutyholder",
              "dutyholders"
            ],
            "hint": "This describes a person, such as a site manager, who has specific legal duties."
          },
          {
            "id": "201-1A-C1-L2",
            "questionText": "Using your answers to Q1 (primary legislation), Q2 (legal obligation), and Q3 (responsible person), explain how these three concepts work together to ensure workplace safety.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "the HASAWA defines how a dutyholder must exercise their duty of care to manage risks",
              "legislation ensures every dutyholder understands their duty of care on site",
              "the HASAWA makes a dutyholder legally responsible for their duty of care",
              "these ensure that everyone identified as a dutyholder follows the legal obligation of duty of care"
            ],
            "hint": "Consider how the law (HASAWA) requires specific people (dutyholders) to act with responsibility (duty of care)."
          }
        ]
      }
    },
    {
      "id": "201-1A-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Organisational and Client Duties",
        "content": "### In this lesson\nIn this lesson, you will learn about the safety and environmental responsibilities held by the organisation as a whole and the client who hires the contractors. You will see how these roles provide the foundation for safe work on any electrical project.\n\n*   The role of the organisation in creating safety systems and policies.\n*   The responsibilities of the **Client** to provide site information and access.\n*   How these roles ensure compliance with environmental and health and safety legislation.\n\n**What this is**\nWhile individual employers and employees have duties, the \"Organisation\" refers to the company as a legal entity. The organisation is responsible for the high-level management systems, such as health and safety policies and risk management processes. The **Client** is the person or organisation for whom the project is being carried out. They are not necessarily the employer of the electricians, but they own or control the premises where the work happens. Both must work together to ensure that the work does not harm people or the environment.\n\n**Why it matters**\nThe organisation provides the framework that allows a **Competent Person** to work effectively. Without organisational policies, there would be no consistency in how risks are managed across different sites. The **Client** is equally important because they hold vital information that the workers might not know. For example, if a building contains asbestos or hidden live services, the **Client** is the one who must provide that information. Failing to identify these roles leads to \"information gaps\" where workers might accidentally drill into a hazardous material because they weren't told it was there.\n\n**Key facts / rules**\n*   Organisations must have a written health and safety policy if they employ five or more people.\n*   The organisation is responsible for ensuring staff are competent through inductions and training records.\n*   The organisation must maintain documentation, such as insurance and safety records.\n*   The **Client** must provide accurate site information, including the location of existing services.\n*   The **Client** must allow sufficient time and resources for the work to be completed safely.\n*   The **Client** is responsible for informing contractors about known hazards, such as asbestos.\n*   Environmental legislation requires the organisation to manage waste and prevent pollution on site.\n*   Both the organisation and the **Client** must cooperate to ensure safe access and egress for all workers.\n\n**How to recognise it**\nYou can recognise the organisation's role through the presence of \"systems.\" If you are asked to sign an induction form or read a company-wide safety manual, you are interacting with the organisation's duties. You can recognise the **Client** role when you receive a site plan or a report identifying where asbestos is located. A common point of confusion is who provides the site info; remember, the organisation provides the *procedure* for the work, but the **Client** provides the *information* about the building itself. You would see the organisation's influence in the maintenance records of the company van, whereas you see the **Client**'s influence in the designated parking areas or the specific hours you are allowed to work on their premises.\n\n**Common mistakes**\nWorkers often mistake the **Client** for their employer. While the **Client** pays for the work, your employer (the organisation) is usually who provides your PPE and tools. Another mistake is ignoring environmental duties, such as improper disposal of fluorescent tubes or batteries; the organisation must provide the system for this, but the individual must follow it to remain compliant with environmental laws.\n\n**Key Points**\n*   Organisations provide the policies, documentation, and management systems.\n*   The **Client** provides the site-specific facts, such as hazard locations and access rules.\n*   Environmental protection is a legal duty for the organisation, not just a suggestion.\n*   Safe working requires the **Client** to provide enough time for the job to be done right.\n\n**Quick recap**\nSafety is a team effort involving the organisation and the **Client**. The organisation sets the rules and manages the staff, while the **Client** ensures the site is ready and safe for work to begin. By sharing information and following established policies, both parties help prevent accidents and environmental damage.\n\n### Coming Up Next\nWith the roles and responsibilities clear, we will next look at the specific health and safety legislation that governs the electrical industry in more detail."
      }
    },
    {
      "id": "201-1A-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Organisational and Client Duties",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "201-1A-C2-L1-A",
            "questionText": "At what point is an organisation legally required to have a written health and safety policy?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "employ five or more people",
              "if they employ five or more people",
              "5 or more employees"
            ],
            "hint": "Look for the specific number of employees that triggers the requirement for a written policy."
          },
          {
            "id": "201-1A-C2-L1-B",
            "questionText": "Identify what the Client must provide to contractors regarding the location of existing services.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "accurate site information",
              "provide accurate site information",
              "accurate information"
            ],
            "hint": "This refers to the facts and data the client holds about the building's services."
          },
          {
            "id": "201-1A-C2-L1-C",
            "questionText": "What does environmental legislation require the organisation to do on a project site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "manage waste and prevent pollution",
              "manage waste",
              "prevent pollution"
            ],
            "hint": "This involves handling materials correctly to protect the surrounding environment."
          },
          {
            "id": "201-1A-C2-L2",
            "questionText": "Using your answers to Q1 (written policy), Q2 (site information), and Q3 (environmental management), explain how these requirements combine to protect the workplace.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "a written policy and accurate site information allow the organisation to manage waste and prevent pollution",
              "organisational policies and client information work together to manage site hazards and waste",
              "the organisation uses the policy and site info to manage waste and pollution effectively",
              "having a written policy and site information ensures that environmental pollution and waste are managed"
            ],
            "hint": "Consider how having a formal policy and specific site facts allows a company to handle waste and pollution correctly."
          }
        ]
      }
    },
    {
      "id": "201-1A-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "201-1A-P1",
            "questionText": "What is the primary UK legislation that defines the legal duties of employers and employees regarding workplace safety?",
            "answerType": "short-text",
            "expectedAnswer": [
              "HASAWA",
              "Health and Safety at Work Act",
              "Health and Safety at Work etc. Act 1974"
            ],
            "hint": "The UK's primary 'umbrella' law for health and safety."
          },
          {
            "id": "201-1A-P2",
            "questionText": "According to health and safety regulations, an organisation must have a written health and safety policy if it employs how many people or more? (Round to the nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "5",
              "5.0"
            ],
            "hint": "Minimum number of employees required for a written policy."
          },
          {
            "id": "201-1A-P3",
            "questionText": "Which party is legally responsible for providing contractors with specific site information, such as the known location of asbestos or hidden live services?",
            "answerType": "short-text",
            "expectedAnswer": [
              "The Client",
              "Client",
              "the client"
            ],
            "hint": "The person or organisation for whom the project is being carried out."
          },
          {
            "id": "201-1A-P4",
            "questionText": "What term describes the legal obligation for every person on a worksite to take reasonable care to avoid acts or omissions that could foreseeably cause harm to others?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Duty of Care",
              "a duty of care",
              "the duty of care"
            ],
            "hint": "A legal obligation to avoid harming others in the workplace."
          },
          {
            "id": "201-1A-P5",
            "questionText": "In the context of a typical electrical installation project, which party is primarily responsible for providing the necessary Personal Protective Equipment (PPE) to the workforce?",
            "answerType": "short-text",
            "expectedAnswer": [
              "The Employer",
              "Employer",
              "the organisation"
            ],
            "hint": "The party responsible for providing the 'hardware' like tools and boots."
          }
        ]
      }
    },
    {
      "id": "201-1A-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "201-1A-INT-1",
            "questionText": "Explain how legal responsibility is shared between different people in a workplace setting. In your answer, include: (1) the definition of a dutyholder, (2) the employer's responsibility for a safe environment, and (3) the employee's duty to follow safety procedures. (2-3 sentences)",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "A dutyholder is any person with a legal responsibility for health and safety, which includes employers providing a safe environment and employees following safety procedures. Both roles must cooperate to ensure that the duty of care is upheld across the entire workplace.",
              "Employers act as dutyholders by ensuring the workplace is safe, while employees fulfill their duty of care by following all established safety procedures. This shared status as dutyholders ensures that everyone is legally responsible for maintaining a safe working environment.",
              "Under health and safety law, a dutyholder is anyone with a legal obligation, such as an employer providing safe equipment or an employee following site safety procedures. These roles work together to maintain a safe environment through their mutual duty of care."
            ],
            "hint": "Think about how the term 'dutyholder' applies to both the person providing the equipment and the person using it."
          },
          {
            "id": "201-1A-INT-2",
            "questionText": "Describe how individual, organisational, and client roles combine to ensure safety and environmental compliance on an electrical project. In your answer, include: (1) the individual's duty of care, (2) the organisation's role in creating safety systems, (3) the client's responsibility for site information, and (4) how these roles work together to ensure compliance. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": [
              "Compliance is achieved when the organisation establishes safety systems and the client provides necessary site information and access. Individuals then exercise their duty of care by following these systems and working safely on site. Together, these coordinated efforts ensure the project meets all health, safety, and environmental legislative requirements.",
              "(1) Individuals must exercise a duty of care by working safely and following rules. (2) The organisation provides the safety policies and systems that govern the work. (3) The client contributes by providing essential site access and safety information. (4) These combined actions ensure the project remains compliant with all legal and environmental standards.",
              "An electrical project stays compliant when the organisation creates safety policies and the client provides the required site information. Individuals support this by exercising their duty of care and following the established procedures. This collaboration between the client, organisation, and individual is what ensures health and safety legislation is followed.",
              "(1) Organisations create the safety systems and policies for the work. (2) Clients provide the site information and access needed to work safely. (3) Individuals exercise a duty of care by following those policies and procedures. (4) This total cooperation ensures full compliance with health, safety, and environmental laws."
            ],
            "hint": "Consider how the information from the client and the policies from the organisation provide the framework for the individual to work safely."
          }
        ]
      }
    },
    {
      "id": "201-1A-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "201-1A-SR-1",
            "questionText": "What is the abbreviation for the main piece of legislation that governs health and safety in the UK?",
            "expectedAnswer": [
              "HASWA",
              "HASAWA",
              "HSWA",
              "The Health and Safety at Work Act"
            ],
            "hint": "It was passed in 1974 and is often referred to by its four or five letter acronym.",
            "answerType": "short-text"
          },
          {
            "id": "201-1A-SR-2",
            "questionText": "Under general safety principles, who is responsible for safety in the workplace?",
            "expectedAnswer": [
              "Everyone",
              "Everybody",
              "All people",
              "All staff"
            ],
            "hint": "Think about whether safety is the job of just one person or the whole team.",
            "answerType": "short-text"
          },
          {
            "id": "201-1A-SR-3",
            "questionText": "What is the nominal single-phase AC voltage used in the UK?",
            "expectedAnswer": [
              "230V",
              "230 Volts",
              "230",
              "230 V"
            ],
            "hint": "This is the standard voltage found at a domestic socket outlet.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Roles & responsibilities"
      }
    }
  ],
  "metadata": {
    "created": "2026-02-08",
    "updated": "2026-02-08",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}