{
  "id": "201-203-SC1A",
  "title": "201.203-SC1A — Socket Circuits (Noob Level 1)",
  "description": "Learn about Socket Circuits (Noob Level 1) in Health and Safety 2365 Level 2",
  "layout": "split-vis",
  "unit": "Unit 201",
  "topic": "Socket Circuits (Noob Level 1)",
  "learningOutcomes": [
    "Define a socket circuit and identify its main components including the consumer unit and socket outlets",
    "Describe the basic electrical path and the safety purpose of the Earth (CPC) conductor",
    "Classify a circuit as either ring final or radial based on its wiring path description"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "201-203-SC1A-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Define a socket circuit and identify its main components including the consumer unit and socket outlets",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the basic electrical path and the safety purpose of the Earth (CPC) conductor",
            "bloomLevel": "understand"
          },
          {
            "text": "Classify a circuit as either ring final or radial based on its wiring path description",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "201-203-SC1A-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Consumer Unit",
            "definition": "The central distribution point where incoming electrical supply is divided into individual circuits and protected by safety devices."
          },
          {
            "term": "Circuit Protective Conductor (CPC)",
            "definition": "A dedicated conductor that provides a safe path for fault current to travel to earth, different from the line and neutral conductors which carry functional current."
          },
          {
            "term": "Line Conductor",
            "definition": "The conductor that carries electrical energy at voltage from the source to the equipment, not to be confused with the neutral conductor which provides the return path."
          },
          {
            "term": "Radial Circuit",
            "definition": "A circuit arrangement where the cabling runs in a single path from the supply to the final point, rather than returning to the source."
          },
          {
            "term": "Ring Final Circuit",
            "definition": "A circuit arrangement where the conductors form a continuous loop by starting and ending at the same point in the consumer unit."
          }
        ]
      }
    },
    {
      "id": "201-203-SC1A-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Socket Circuits (Noob Level 1) Diagram",
        "description": "Visual representation of Socket Circuits (Noob Level 1)",
        "videoUrl": "",
        "diagramType": "circuit",
        "elementIds": [
          "consumer-unit",
          "socket-outlet",
          "line-conductor",
          "neutral-conductor",
          "cpc-conductor"
        ],
        "placeholderText": "A diagram showing two circuit layouts side-by-side. On the left, a Radial Circuit starts at a 'consumer-unit', travels through three 'socket-outlet' components in a line, and ends at the final socket. On the right, a Ring Final Circuit starts at the 'consumer-unit', passes through three 'socket-outlet' components, and then the cable returns from the last socket back to the 'consumer-unit'. Each cable path should be shown as a bundle containing a 'line-conductor' (brown), 'neutral-conductor' (blue), and 'cpc-conductor' (green/yellow). The diagram clearly labels the 'end' of the radial and the 'loop' of the ring."
      }
    },
    {
      "id": "201-203-SC1A-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Socket Circuit Components",
        "content": "### In this lesson\n- You will learn to define a socket circuit and identify its primary physical parts.\n- This knowledge allows you to recognise the equipment and wiring used to provide power to appliances safely.\n- Key takeaways: identifying the **Consumer Unit**, distinguishing between conductors, and understanding the role of the **Circuit Protective Conductor (CPC)**.\n\n**What this is**\nA socket circuit is a specific electrical arrangement designed to provide power to **socket outlets** throughout a building. It acts as the delivery system for electrical energy, allowing users to plug in and use various devices. The circuit begins at the **Consumer Unit**, which is the central distribution point where the incoming electrical supply is divided into individual circuits and protected by safety devices. From here, cables travel through the walls or floors to reach the sockets where equipment is connected. \n\n**Why it matters**\nUnderstanding these components is the first step in ensuring electrical safety. Every part of the circuit has a specific job to do. If a component is missing or incorrectly identified, the circuit might fail to provide power or, more dangerously, fail to protect a user from an electric shock. By recognising the **Line Conductor**, neutral conductor, and **Circuit Protective Conductor (CPC)**, you can understand how electricity flows out to a device and how it is safely managed if a fault occurs.\n\n**Key facts / rules**\n- The **Consumer Unit** is the starting point for every socket circuit in a domestic installation.\n- The **Line Conductor** is the wire that carries electrical energy at voltage from the source to the equipment.\n- The neutral conductor provides the essential return path for the current to complete the circuit.\n- The **Circuit Protective Conductor (CPC)** is a dedicated safety wire that provides a path for fault current to travel to earth.\n- **Socket outlets** are the termination points where users interact with the circuit.\n- All socket circuits must include a functional earth path for safety (verify current edition/version of wiring regulations).\n\n**How to recognise it**\nTo identify a socket circuit, look for the cable exiting a protective device (like a circuit breaker) inside the **Consumer Unit**. You can recognise the different conductors by their standard insulation colours, though you should always verify these with a voltage indicator (following safe isolation procedures). The **Line Conductor** is typically brown, the neutral is blue, and the **Circuit Protective Conductor (CPC)** is identified by green and yellow stripes. Physically, the **socket outlet** is the most recognisable part, usually featuring three rectangular openings designed to accept a standard plug. \n\nIn a physical-world analogy, think of the circuit like a central heating system. The **Consumer Unit** is the boiler (the source), the **Line Conductor** is the pipe carrying hot water out, the neutral is the return pipe, and the **Circuit Protective Conductor (CPC)** is the safety overflow pipe that only carries water if the system breaks.\n\n*Micro-scenario:* Consider a circuit with one **Consumer Unit** and five **socket outlets**. If you look at the wiring, you will see three distinct types of conductors connected to every single socket to ensure both operation and safety.\n\n**Common mistakes**\nLearners often confuse the **Line Conductor** with the neutral conductor; the **Line Conductor** is the one that carries the voltage to the load, whereas the neutral conductor is the return path that completes the loop. \n\nMisconceptions (targeted):\n- Misconception: The **Circuit Protective Conductor (CPC)** carries electricity all the time like the other wires. | Correction: The CPC only carries current during a fault to protect people and equipment. | AC: AC3.1\n- Misconception: The **Consumer Unit** only turns the power on and off. | Correction: The Consumer Unit also houses safety devices that automatically disconnect power during a fault. | AC: AC3.1\n\n**Key Points**\n- The **Consumer Unit** distributes and protects the power.\n- The **Line Conductor** brings power out; the neutral brings it back.\n- The **Circuit Protective Conductor (CPC)** is for safety only.\n- **Socket outlets** are where appliances connect to the system.\n\n**Quick recap**\nA socket circuit delivers electricity from a **Consumer Unit** to various **socket outlets** using a set of three conductors. The **Line Conductor** and neutral conductor handle the functional flow of electricity, while the **Circuit Protective Conductor (CPC)** acts as a vital safety path to earth in case of a fault.\n\n### Coming Up Next\nNow that you can identify the parts, we will look at the two ways these components are wired together: the **Radial Circuit** and the **Ring Final Circuit**."
      }
    },
    {
      "id": "201-203-SC1A-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Socket Circuit Components",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "201-203-SC1A-C1-L1-A",
            "questionText": "What is the starting point for every socket circuit in a domestic installation?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Consumer Unit",
              "The Consumer Unit",
              "Consumer Units"
            ],
            "hint": "Identify the central distribution point where the incoming supply is divided."
          },
          {
            "id": "201-203-SC1A-C1-L1-B",
            "questionText": "Which wire is responsible for carrying electrical energy at voltage from the source to the equipment?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Line Conductor",
              "The Line Conductor",
              "Line Conductors"
            ],
            "hint": "This wire is typically brown in standard insulation colours."
          },
          {
            "id": "201-203-SC1A-C1-L1-C",
            "questionText": "Under what specific condition does the Circuit Protective Conductor (CPC) carry current?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "During a fault",
              "In a fault",
              "Fault condition",
              "A fault"
            ],
            "hint": "The CPC is a dedicated safety wire that does not carry current during normal operation."
          },
          {
            "id": "201-203-SC1A-C1-L2",
            "questionText": "Using your answers to Q1 (starting point), Q2 (energy carrier), and Q3 (CPC function), explain how these components work together. Why must the CPC be present even if the circuit provides power without it?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The Consumer Unit distributes power to the Line Conductor to reach the load.",
              "The Line Conductor provides the functional voltage for equipment to operate.",
              "The CPC provides a safety path to earth that only activates during a fault.",
              "Without the CPC, a fault has no safe path, meaning the system is functional but dangerous."
            ],
            "expectedAnswer": [
              "The Consumer Unit starts the circuit and sends power through the Line Conductor to the equipment. Although the circuit works with just the Line and neutral, the CPC must be present because it provides a safety path for current during a fault. If a fault occurs and the CPC is missing, the circuit would be dangerous to users.",
              "Power leaves the Consumer Unit via the Line Conductor to operate appliances. The CPC is also connected but only carries current during a fault to ensure safety. This relationship matters because the CPC ensures that if the functional energy carrier fails, the fault current is safely managed."
            ],
            "hint": "Consider the difference between what makes the circuit work and what makes the circuit safe."
          }
        ]
      }
    },
    {
      "id": "201-203-SC1A-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Circuit Types: Ring vs Radial",
        "content": "### In this lesson\n- You will learn the conceptual difference between the two main types of socket wiring.\n- This helps you classify a circuit based on the path the cables take from the **Consumer Unit**.\n- Key takeaways: defining a **Radial Circuit**, defining a **Ring Final Circuit**, and knowing when each is typically used.\n\n**What this is**\nThere are two primary ways to wire a socket circuit. A **Radial Circuit** is an arrangement where the cabling runs in a single path from the supply (the **Consumer Unit**) to the final point, stopping there. In contrast, a **Ring Final Circuit** is a circuit arrangement where the conductors form a continuous loop by starting at the **Consumer Unit**, visiting every **socket outlet**, and then returning to the same starting point in the **Consumer Unit**.\n\n**Why it matters**\nThe choice between these two types affects how much power the circuit can handle and how much cable is required. A **Ring Final Circuit** effectively uses two paths to reach every socket, which can allow for thinner cables to carry more total current across the loop. A **Radial Circuit** is simpler to install and understand but is generally limited by the capacity of its single cable run. Identifying which one is in front of you is essential for safe maintenance and testing.\n\n**Key facts / rules**\n- A **Radial Circuit** has a definite \"end\" point at the last socket.\n- A **Ring Final Circuit** has no \"end\" because it loops back to the source.\n- Both circuit types must include a **Circuit Protective Conductor (CPC)** for safety.\n- In a **Ring Final Circuit**, there are two sets of conductors connected to the same protective device in the **Consumer Unit**.\n- In a **Radial Circuit**, there is usually only one set of conductors leaving the protective device.\n- Selection depends on floor area and expected load (verify current edition/version of regulations).\n\n**When to choose it**\nYou would typically choose a **Radial Circuit** for smaller areas or specific dedicated appliances, such as a single socket for a washing machine in a utility room. It is chosen when simplicity is preferred and the power demand is low. You would choose a **Ring Final Circuit** for larger areas like a living room or a whole floor of a house. Because the current can travel in two directions around the loop, the ring can support many sockets and high-power appliances (like kettles and heaters) simultaneously without overheating the cables.\n\nTo visualize this, imagine a bus route. A **Radial Circuit** is like a bus that goes from the station to the countryside and stops at the last village. A **Ring Final Circuit** is like a city \"circle line\" bus that leaves the station, visits several stops, and eventually arrives back at the station where it started.\n\n*Micro-scenario:* If you have a circuit where the cable enters the first socket and ends at the fourth socket, it is a **Radial Circuit**. If the cable enters the first socket, continues to the fourth, and then a final cable runs from the fourth back to the **Consumer Unit**, it is a **Ring Final Circuit**.\n\n**Common mistakes**\nLearners often confuse a **Radial Circuit** with a **Ring Final Circuit** when looking at a single socket; both types look identical at the socket face, whereas the difference is only visible in the cable path or at the **Consumer Unit**. \n\nMisconceptions (targeted):\n- Misconception: A **Ring Final Circuit** is safer than a **Radial Circuit**. | Correction: Both are equally safe if installed correctly; the ring just allows for more current over a larger area. | AC: AC3.1\n- Misconception: If a ring is broken, the sockets stop working. | Correction: The sockets will often still work because there is another path, but the cable may become dangerously overloaded. | AC: AC3.1\n\n**Key Points**\n- **Radial Circuit**: A single run that ends at the last socket.\n- **Ring Final Circuit**: A continuous loop that returns to the **Consumer Unit**.\n- Rings allow for higher current capacity using two paths.\n- Radials are simpler and used for smaller loads or dedicated points.\n\n**Quick recap**\nThe two main socket circuit types are defined by their wiring path. A **Radial Circuit** follows a single line to an end point, while a **Ring Final Circuit** forms a complete loop back to the **Consumer Unit**. Choosing between them depends on the size of the area and the amount of power needed.\n\n### Coming Up Next\nIn the next stage, we will look at how to safely isolate these circuits before any work is carried out."
      }
    },
    {
      "id": "201-203-SC1A-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Circuit Types: Ring vs Radial",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "201-203-SC1A-C2-L1-A",
            "questionText": "Which circuit arrangement runs in a single path from the supply to the final point and stops there?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Radial Circuit",
              "A Radial Circuit",
              "Radial"
            ],
            "hint": "Think of the arrangement used for smaller areas or dedicated appliances."
          },
          {
            "id": "201-203-SC1A-C2-L1-B",
            "questionText": "What type of circuit forms a continuous loop by starting and returning to the same point in the Consumer Unit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Ring Final Circuit",
              "A Ring Final Circuit",
              "Ring Final"
            ],
            "hint": "This arrangement allows current to travel in two directions around the loop."
          },
          {
            "id": "201-203-SC1A-C2-L1-C",
            "questionText": "How many sets of conductors usually leave the protective device in a Radial Circuit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "One set",
              "One",
              "1 set",
              "A single set"
            ],
            "hint": "Contrast this with a ring circuit which must return to the source."
          },
          {
            "id": "201-203-SC1A-C2-L2",
            "questionText": "Using your answers to Q1 (radial path), Q2 (ring loop), and Q3 (conductors at source), explain how these facts connect. How do we know which circuit type is being used by looking at the Consumer Unit?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "A Radial Circuit uses a single path and only one set of conductors at the protective device.",
              "A Ring Final Circuit forms a loop, meaning it must return to the starting point.",
              "The presence of two sets of conductors at one protective device indicates a Ring Final Circuit.",
              "We know the type because the number of conductor sets at the source reflects whether the path is a single line or a returning loop."
            ],
            "expectedAnswer": [
              "A Radial Circuit is a single path with one set of conductors leaving the protective device. Because a Ring Final Circuit is a continuous loop, it must return to the source, resulting in two sets of conductors at the protective device. We can identify the circuit type at the Consumer Unit by checking if there is one set of wires (Radial) or two sets (Ring) connected to the breaker.",
              "We identify the circuit by looking at the conductors in the Consumer Unit. A Radial Circuit has one set of conductors for its single path to the end point. A Ring Final Circuit returns to the start to form a loop, so it will have two sets of conductors connected to the same safety device. This confirms whether the cable path is a single line or a complete ring."
            ],
            "hint": "Focus on how the path of the cable (loop vs single line) changes what you see at the starting point."
          }
        ]
      }
    },
    {
      "id": "201-203-SC1A-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "201-203-SC1A-P1",
            "questionText": "Which specific conductor is designed to provide a safety path for fault current to travel to earth and does not carry current during normal operation?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Circuit Protective Conductor",
              "CPC",
              "Circuit Protective Conductor (CPC)",
              "the CPC"
            ],
            "hint": "This wire is usually identified by green and yellow stripes."
          },
          {
            "id": "201-203-SC1A-P2",
            "questionText": "Why can a Ring Final Circuit typically support a higher electrical load than a Radial Circuit using the same size of cable?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Two paths for current",
              "Current flows in two directions",
              "It has two paths",
              "Dual paths"
            ],
            "hint": "Think about the route the electricity takes from the source to the sockets in a loop."
          },
          {
            "id": "201-203-SC1A-P3",
            "questionText": "In a Ring Final Circuit, how many distinct sets of conductors (the start and end of the loop) must be connected to the protective device in the Consumer Unit?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2"
            ],
            "hint": "Consider how many cable ends must return to the source to form a complete loop."
          },
          {
            "id": "201-203-SC1A-P4",
            "questionText": "A technician installs a circuit in a new office where the cable runs from the distribution board to the first outlet and terminates permanently at the final outlet. Which circuit type has been installed?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Radial Circuit",
              "Radial",
              "A radial circuit"
            ],
            "hint": "This arrangement has a definite end point and does not return to the source."
          },
          {
            "id": "201-203-SC1A-P5",
            "questionText": "How many different types of conductors (functional and safety) are required at a standard socket outlet to ensure it is both operational and protected?",
            "answerType": "numeric",
            "expectedAnswer": [
              "3"
            ],
            "hint": "Count the Line, Neutral, and the safety conductor."
          }
        ]
      }
    },
    {
      "id": "201-203-SC1A-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "201-203-SC1A-INT-1",
            "questionText": "Explain the relationship between the physical wiring configuration and the function of the Circuit Protective Conductor (CPC). In your answer, include: (1) the path from the Consumer Unit to the socket outlets, (2) the specific role of the CPC, and (3) how the circuit type (Radial or Ring) alters the physical return path. Why must the CPC remain continuous across all components regardless of the circuit type? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies the Consumer Unit as the origin of the circuit path",
              "Defines the CPC as the safety conductor for fault current",
              "Distinguishes between the linear path of a Radial and the looped path of a Ring",
              "Explains that continuity is required to ensure a path to ground",
              "Relates component connectivity to the overall safety of the system"
            ],
            "expectedAnswer": [
              "In both Radial and Ring circuits, conductors run from the Consumer Unit to provide power to socket outlets, while the CPC serves as a dedicated safety path for fault currents. While a Radial circuit terminates at the last outlet and a Ring circuit returns to the source, the CPC must be continuous throughout to ensure any fault has a low-resistance path back to the ground. Without this continuity, the protection provided by the Consumer Unit would fail to activate during a fault.",
              "The circuit path starts at the Consumer Unit and connects multiple socket outlets, using either a single-run Radial or a looped Ring Final configuration. The CPC is integrated into these paths to prevent electric shock by carrying fault current safely away. Continuity must be maintained across all points because the safety of the entire circuit depends on a complete electrical link back to the distribution point to trigger safety devices."
            ],
            "hint": "Consider how the electrical path changes between a loop and a single line, and what that means for the safety wire."
          },
          {
            "id": "201-203-SC1A-INT-2",
            "questionText": "Evaluate the integration of system components and wiring configurations within a standard socket circuit. In your answer, include: (1) the role of the Consumer Unit as the supply point, (2) the distribution to socket outlets, (3) the distinction between Radial and Ring Final paths, and (4) how the CPC integrates with these paths to ensure safe operation. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Identifies Consumer Unit as the distribution and protection source",
              "Describes socket outlets as the termination points for appliances",
              "Defines Radial as a single-path branch configuration",
              "Defines Ring Final as a continuous loop returning to the source",
              "Explains CPC integration across the entire wiring layout",
              "Relates CPC function to fault protection and shock prevention",
              "Synthesizes how layout choice affects the physical conductor arrangement",
              "Concludes how all components work together for safe power delivery"
            ],
            "expectedAnswer": [
              "A socket circuit integrates a Consumer Unit as the supply source, distributing power to various socket outlets through either a linear Radial path or a looped Ring Final configuration. The Circuit Protective Conductor (CPC) is installed alongside these power paths to provide a dedicated safety route for fault currents. This synthesis of components and wiring paths ensures that electricity is delivered efficiently to appliances while maintaining a constant safety link to the ground to prevent hazards.",
              "• The Consumer Unit serves as the starting point for power distribution and circuit protection.\n• Socket outlets are connected via a Radial (single path) or Ring Final (loop) wiring arrangement.\n• The CPC is integrated into every part of the circuit to ensure a continuous safety path for fault current.\n• Together, these elements form a complete system that provides reliable power and automated safety shut-off capabilities."
            ],
            "hint": "Think about the start point, the end points, the two different ways to connect them, and the safety wire that follows them."
          }
        ]
      }
    },
    {
      "id": "201-203-SC1A-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "201-203-SC1A-SR-1",
            "questionText": "What term is used to describe a complete path that allows electricity to flow?",
            "expectedAnswer": [
              "circuit",
              "electrical circuit",
              "a circuit"
            ],
            "hint": "This term is found in the lesson title.",
            "answerType": "short-text"
          },
          {
            "id": "201-203-SC1A-SR-2",
            "questionText": "What name is given to a material or wire that allows an electrical current to pass through it?",
            "expectedAnswer": [
              "conductor",
              "electrical conductor",
              "conductors"
            ],
            "hint": "The Earth (CPC) is an example of this.",
            "answerType": "short-text"
          },
          {
            "id": "201-203-SC1A-SR-3",
            "questionText": "What is the name of the main component used to distribute electricity to various circuits in a building?",
            "expectedAnswer": [
              "consumer unit",
              "the consumer unit",
              "consumer units"
            ],
            "hint": "It is mentioned as a main component in the first learning outcome.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Socket Circuits (Noob Level 1)"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1"
  ],
  "metadata": {
    "created": "2026-02-22",
    "updated": "2026-02-22",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "203",
      "learningOutcome": "LO3",
      "coveredAC": [
        "AC1"
      ],
      "outOfScopeAC": [
        "AC2",
        "AC3",
        "AC4"
      ]
    },
    "scope": {
      "inScope": "Basic definitions, component identification (L, N, CPC), and the conceptual difference between ring and radial paths.",
      "outOfScope": "Spurs, diversity, cable sizing, testing (R1+R2), installation procedures, and live working.",
      "rationale": "Focuses on foundational recognition and safety terminology for absolute beginners before moving to technical execution."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Dead-safe only; no installation steps or live work permitted."
    },
    "misconceptions": [
      {
        "misconception": "The Circuit Protective Conductor (CPC) carries electricity all the time like the other wires.",
        "correction": "The CPC only carries current during a fault to protect people and equipment.",
        "relatedAC": "AC3.1"
      },
      {
        "misconception": "If a ring is broken, the sockets stop working.",
        "correction": "The sockets will often still work because there is another path, but the cable may become dangerously overloaded.",
        "relatedAC": "AC3.1"
      }
    ]
  }
}