{
  "id": "202-5A3",
  "title": "202.5A3 — Magnetism basics",
  "description": "Learn about Magnetism basics in Science 2365 Level 2",
  "layout": "split-vis",
  "unit": "Unit 202",
  "topic": "Magnetism basics",
  "learningOutcomes": [
    "Describe the principles of magnetic attraction and repulsion between poles",
    "State the conceptual difference between magnetic flux and magnetic flux density",
    "Classify physical scenarios as examples of either magnetic flux or flux density"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "202-5A3-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Describe the principles of magnetic attraction and repulsion between poles",
            "bloomLevel": "understand"
          },
          {
            "text": "State the conceptual difference between magnetic flux and magnetic flux density",
            "bloomLevel": "remember"
          },
          {
            "text": "Classify physical scenarios as examples of either magnetic flux or flux density",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "202-5A3-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Magnetic Pole",
            "definition": "The region at each end of a magnet where the magnetic force is most concentrated, designated as either North or South."
          },
          {
            "term": "Magnetic Field",
            "definition": "The invisible area of influence surrounding a magnetic material or current-carrying conductor where magnetic forces can be detected."
          },
          {
            "term": "Magnetic Flux",
            "definition": "The total number of magnetic field lines passing through a given area, measured in Webers (Wb), representing the overall quantity of magnetism."
          },
          {
            "term": "Magnetic Flux Density",
            "definition": "The concentration of magnetic field lines per unit area, different from flux because it measures the intensity of the field rather than the total quantity."
          },
          {
            "term": "Attraction",
            "definition": "The pulling force exerted between two opposite magnetic poles, not to be confused with the force between like poles."
          },
          {
            "term": "Repulsion",
            "definition": "The pushing force exerted between two identical magnetic poles, occurring when two North or two South poles are brought together."
          }
        ]
      }
    },
    {
      "id": "202-5A3-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Magnetism basics Diagram",
        "description": "Visual representation of Magnetism basics",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "magnetic-pole",
          "magnetic-field-lines",
          "attraction-vector",
          "repulsion-vector"
        ],
        "placeholderText": "The diagram should feature two bar magnets. In the top half, show two magnets with opposite poles (N and S) facing each other, with 'magnetic-field-lines' flowing between them and 'attraction-vector' arrows pointing inward to show they are pulling together. In the bottom half, show two magnets with identical poles (N and N) facing each other, with 'magnetic-field-lines' curving away from each other and 'repulsion-vector' arrows pointing outward. Each end of the magnets should be clearly labeled as a 'magnetic-pole'."
      }
    },
    {
      "id": "202-5A3-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Magnetic Attraction and Repulsion",
        "content": "### In this lesson\nThis lesson explores how magnetic forces interact between physical objects. You will learn to identify the behavior of magnets when they are brought into close proximity in various technical applications.\n\n*   Identify the characteristics of a **Magnetic Pole**.\n*   Describe the interaction between like and opposite poles.\n*   Recognise the invisible nature of a **Magnetic Field**.\n\n**What this is**\nMagnetism is a non-contact force that originates from a material's internal structure. Every magnet possesses a **Magnetic Pole** at each of its two ends, typically designated as North (N) and South (S). These are the specific regions where the magnetic force is most concentrated. Surrounding these poles is the **Magnetic Field**, which is the invisible area of influence where magnetic forces can be detected. Although we cannot see the field directly, we can observe its effects on other magnetic materials or conductors. The interaction between these fields results in two primary mechanical behaviors: **Attraction** and **Repulsion**.\n\n**Why it matters**\nUnderstanding how poles interact is fundamental to the design of motors, relays, and sensors. In many cases, technical systems rely on the predictable pushing or pulling forces generated by magnets to create motion or trigger switches. If a technician cannot identify which way a magnet is oriented, they cannot predict how a system will react when power is applied or components are moved.\n\n**Key facts / rules**\n*   Every magnet must have at least two poles: a North pole and a South pole.\n*   The **Magnetic Field** is strongest at the poles and weakens as you move away.\n*   Like poles (North-North or South-South) will always exhibit **Repulsion**.\n*   Opposite poles (North-South) will always exhibit **Attraction**.\n*   Magnetic field lines are conventionally described as flowing from the North pole to the South pole outside the magnet.\n*   The force of interaction increases significantly as the distance between poles decreases.\n\n**How to recognise it**\nTo identify these forces, observe the physical reaction between two magnets. **Attraction** is recognised as a pulling force that draws two magnets together until they touch. **Repulsion** is recognised as a resistive pushing force that makes it difficult to bring two magnets together. Think of **Attraction** like invisible rubber bands snapping two objects together, while **Repulsion** feels like trying to squeeze a firm, invisible balloon between two surfaces. \n\nIn a micro-scenario, imagine placing two North **Magnetic Poles** 2cm apart on a smooth surface; they will move away from each other. If you flip one magnet so a North and South pole face each other at the same distance, they will immediately snap together. This comparison shows that the direction of the force depends entirely on pole orientation.\n\n**Common mistakes**\nLearners often confuse **Attraction** with **Repulsion**; **Attraction** is the pulling force between opposite poles, whereas **Repulsion** is the pushing force between identical poles.\n\nMisconceptions (targeted):\n*   Misconception: All magnets automatically stick to each other. | Correction: Magnets only stick (attract) if opposite poles face each other; identical poles will push away. | AC: AC1\n*   Misconception: The magnetic force is the same strength everywhere around a magnet. | Correction: The force is most concentrated at the **Magnetic Pole** and dissipates across the **Magnetic Field**. | AC: AC1\n\n**Key Points**\n*   **Magnetic Poles** are the points of highest force concentration.\n*   **Attraction** occurs between North and South poles.\n*   **Repulsion** occurs between two North or two South poles.\n*   The **Magnetic Field** is the zone where these forces operate.\n\n**Quick recap**\nMagnets interact through invisible fields that concentrate at their poles. By observing whether two magnets pull together or push apart, you can identify if you are dealing with opposite or identical poles. This predictable behavior is the basis for all magnetic mechanical interactions.\n\n### Coming Up Next\nWe will move from the behavior of poles to measuring the quantity and intensity of the magnetic force itself."
      }
    },
    {
      "id": "202-5A3-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Magnetic Attraction and Repulsion",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "202-5A3-C1-L1-A",
            "questionText": "What is the minimum number of poles that every magnet must possess?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "At least two",
              "Two poles",
              "2 poles",
              "Two"
            ],
            "hint": "Recall the basic internal structure of a magnet which always includes a North and a South designation."
          },
          {
            "id": "202-5A3-C1-L1-B",
            "questionText": "What specific mechanical behavior is exhibited when like poles such as North-North are brought together?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Repulsion",
              "Repelling",
              "Pushing force"
            ],
            "hint": "Think about the resistive force that occurs when identical magnetic ends face each other."
          },
          {
            "id": "202-5A3-C1-L1-C",
            "questionText": "Between which two specific types of poles does magnetic attraction occur?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "North and South",
              "Opposite poles",
              "N and S poles"
            ],
            "hint": "Attraction is the pulling force that happens when the poles are not identical."
          },
          {
            "id": "202-5A3-C1-L2",
            "questionText": "Using your answers to Q1 (number of poles), Q2 (like pole behavior), and Q3 (attraction between poles), why must a technician identify the orientation of poles before assembling a technical system?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Every magnet has two poles that determine the direction of force",
              "Predicting attraction or repulsion depends on knowing which poles are facing each other",
              "Orientation is critical because like poles push away while opposite poles pull together",
              "Technicians must identify orientation to ensure the system creates the intended motion or switch trigger"
            ],
            "expectedAnswer": [
              "Because every magnet has two poles, you must know their orientation to predict if the system will exhibit attraction or repulsion. If like poles face each other they will push apart, but opposite poles will pull together, so the orientation determines the direction of the mechanical force.",
              "A technician needs to know the pole orientation because magnets always have two poles that interact differently. Since like poles cause repulsion and opposite poles cause attraction, knowing the orientation is the only way to ensure the magnetic force moves components in the correct direction."
            ],
            "hint": "Consider how the existence of two distinct poles and their specific rules of interaction allow us to predict mechanical movement."
          }
        ]
      }
    },
    {
      "id": "202-5A3-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Magnetic Flux vs. Flux Density",
        "content": "### In this lesson\nThis lesson clarifies the distinction between the total amount of magnetism and how concentrated that magnetism is in a specific area. This is a vital conceptual step for calculating the efficiency of magnetic circuits.\n\n*   Define the term **Magnetic Flux** and its unit of measurement.\n*   Explain the concept of **Magnetic Flux Density**.\n*   Classify scenarios based on total quantity versus intensity.\n\n**What this is**\nWhen we describe a **Magnetic Field**, we often use imaginary \"lines\" to represent the force. **Magnetic Flux** is the term for the total number of these magnetic field lines passing through a given area. It represents the overall quantity of magnetism produced by a source and is measured in Webers (Wb). In contrast, **Magnetic Flux Density** refers to how tightly packed or concentrated those lines are within a specific unit of area (typically a square meter). While flux tells us the \"total volume,\" density tells us the \"intensity\" at a specific point.\n\n**Why it matters**\nIn many technical applications, the total amount of magnetism is less important than how much of it is concentrated where it is needed. For example, in a transformer or a motor, we need a high **Magnetic Flux Density** to ensure the device operates efficiently. If the flux is spread too thin over a large area, the resulting force or induced energy will be weak, even if the total flux remains the same.\n\n**Key facts / rules**\n*   **Magnetic Flux** is the total quantity of magnetic field lines (measured in Webers).\n*   **Magnetic Flux Density** is the concentration of those lines per unit area.\n*   If the area decreases while flux remains constant, the **Magnetic Flux Density** increases.\n*   If the flux increases while the area remains constant, the **Magnetic Flux Density** increases.\n*   Flux is the \"whole,\" while density is the \"concentration.\"\n*   Scenarios involving the total output of a magnet refer to flux; scenarios involving the strength at a specific surface refer to density.\n\n**How to recognise it**\nTo distinguish between these two, look at whether the description focuses on the whole source or a specific measurement point. **Magnetic Flux** is like the total amount of rain falling over a whole city. **Magnetic Flux Density** is like measuring how much rain falls into a single bucket. If you have 1,000 lines of flux (the total), but you squeeze them all through a tiny 1cm² opening, you have created a very high density. \n\nConsider a micro-scenario: Magnet A and Magnet B both produce 0.01 Webers of **Magnetic Flux**. However, Magnet A's field is spread over 10cm², while Magnet B's field is concentrated into 1cm². Magnet B has a much higher **Magnetic Flux Density**, making it feel \"stronger\" at that specific point of contact.\n\n**Common mistakes**\nLearners often confuse **Magnetic Flux** with **Magnetic Flux Density**; **Magnetic Flux** is the total number of field lines (the quantity), whereas **Magnetic Flux Density** is the concentration of those lines per unit area (the intensity).\n\nMisconceptions (targeted):\n*   Misconception: Flux and flux density are the same thing. | Correction: Flux is the total amount (Webers), while density is how squashed that amount is into a space. | AC: AC2\n*   Misconception: A large magnet always has a higher flux density than a small magnet. | Correction: A small magnet might have a lower total flux but a much higher density if its field is very concentrated. | AC: AC2\n\n**Key Points**\n*   **Magnetic Flux** = Total amount of magnetism (Webers).\n*   **Magnetic Flux Density** = Concentration of magnetism in an area.\n*   Changing the area changes the density, even if the total flux stays the same.\n*   High density is usually required for high-performance technical components.\n\n**Quick recap**\nFlux is the total magnetic \"output,\" while flux density describes how \"crowded\" the magnetic field lines are in a specific area. Recognising this difference allows technicians to understand why some magnets feel stronger than others even if they have the same total magnetic potential.\n\n### Coming Up Next\nWe will explore how electrical current can be used to create these magnetic fields and how we can control their strength."
      }
    },
    {
      "id": "202-5A3-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Magnetic Flux vs. Flux Density",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "202-5A3-C2-L1-A",
            "questionText": "Which term describes the total quantity of magnetic field lines measured in Webers?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Magnetic Flux",
              "Flux",
              "Total Flux"
            ],
            "hint": "This term refers to the overall output or volume of magnetism from a source."
          },
          {
            "id": "202-5A3-C2-L1-B",
            "questionText": "What happens to the Magnetic Flux Density if the area through which the field passes decreases while the flux remains constant?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "It increases",
              "Increases",
              "Goes up",
              "Becomes higher"
            ],
            "hint": "Think about what happens to the concentration of lines when they are squeezed into a smaller space."
          },
          {
            "id": "202-5A3-C2-L1-C",
            "questionText": "When comparing total output to concentration, which concept is described as the whole?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Flux",
              "Magnetic Flux",
              "The flux"
            ],
            "hint": "Density represents the concentration, whereas this term represents the entire quantity."
          },
          {
            "id": "202-5A3-C2-L2",
            "questionText": "Using your answers to Q1 (total quantity), Q2 (density change), and Q3 (whole vs concentration), how do we know if a specific component will provide enough intensity for a high-performance application?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Magnetic flux represents the total quantity available from the source",
              "Flux density determines the intensity at the specific point of use",
              "We know intensity is sufficient if the flux is concentrated into a small enough area to increase density",
              "High-performance requires high density, not just high total flux"
            ],
            "expectedAnswer": [
              "We know a component is suitable by checking the flux density, not just the total flux. While flux is the whole quantity, density is the concentration; therefore, even if the total flux is constant, we can increase intensity for high-performance by decreasing the area to increase the density.",
              "To ensure enough intensity, we must look at how the total flux is concentrated. Since density increases when the same amount of flux is forced into a smaller area, we know a component will be effective if it achieves high concentration at the required point."
            ],
            "hint": "Relate the total amount of magnetic lines to how they are packed into a specific space to create strength."
          }
        ]
      }
    },
    {
      "id": "202-5A3-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "202-5A3-P1",
            "questionText": "What specific mechanical behavior is exhibited when two North magnetic poles are brought into close proximity?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Repulsion",
              "Magnetic repulsion"
            ],
            "hint": "Consider the rule for 'like' poles interacting."
          },
          {
            "id": "202-5A3-P2",
            "questionText": "If a technician observes two unmarked magnetic components instantly snapping together, what must be true about the poles facing each other?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Opposite poles",
              "They are opposite",
              "Opposite"
            ],
            "hint": "Recall which pole orientations result in a pulling force."
          },
          {
            "id": "202-5A3-P3",
            "questionText": "Regardless of size or strength, every individual magnet must possess a minimum of how many magnetic poles?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2"
            ],
            "hint": "Every magnet must have both a North and a South designation."
          },
          {
            "id": "202-5A3-P4",
            "questionText": "A system requires a high intensity of magnetic force at a specific contact point. If the total magnetic flux remains constant, what must happen to the area of the field to increase the flux density?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Reduce the area",
              "Decrease the area",
              "Smaller area"
            ],
            "hint": "Think about how concentration changes when the same amount of flux is squeezed into a different sized space."
          },
          {
            "id": "202-5A3-P5",
            "questionText": "A magnetic source produces a fixed total flux. If this flux is concentrated from its original area into an area exactly half that size, by what factor does the magnetic flux density increase?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2"
            ],
            "hint": "If the space is halved but the quantity of flux is the same, the density doubles."
          }
        ]
      }
    },
    {
      "id": "202-5A3-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "202-5A3-INT-1",
            "questionText": "Explain how the distribution of magnetic flux influences the force experienced between two magnetic poles. In your answer, include: (1) the behavior of like and opposite poles, (2) the definition of magnetic flux as a total quantity, and (3) the relationship between flux concentration and the magnitude of attraction or repulsion. Why must the flux be concentrated at the poles for significant force to be detected? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies that opposite poles attract and like poles repel as the fundamental interaction.",
              "Defines magnetic flux as the total number of magnetic lines of force within the field.",
              "Explains that the strength of the force is proportional to the concentration of flux lines.",
              "Reasons that force is maximized at the poles because that is where the flux density is highest.",
              "Connects the invisible nature of the field to the observable physical movement of the magnets."
            ],
            "expectedAnswer": [
              "Magnetic attraction occurs between opposite poles while repulsion occurs between like poles, driven by the total magnetic flux surrounding the material. The magnitude of this force is determined by how concentrated the flux is; we know that force is strongest at the poles because that is where the flux lines are most densely packed. If the flux were not concentrated at these specific points, the magnetic field would be too diffuse to exert a significant mechanical force over a distance.",
              "While magnetic flux represents the total quantity of magnetism, the physical force of attraction or repulsion is felt most strongly at the poles where those lines of force are concentrated. For significant force to be detected, the flux must be concentrated into a small area to increase the intensity of the interaction between the two magnetic fields. This explains why magnets only show strong interaction when their poles, rather than their centers, are brought into close proximity."
            ],
            "hint": "Think about where the lines of force are most crowded and how that crowding relates to the strength of the pull or push."
          },
          {
            "id": "202-5A3-INT-2",
            "questionText": "Evaluate the functional relationship between field intensity and total magnetic output when two components interact. In your answer, include: (1) the role of magnetic poles in determining force direction, (2) the distinction between total magnetic flux and flux density, (3) how changing the surface area of the contact point affects the intensity of the interaction, and (4) how these factors combined define the overall efficiency of a magnetic circuit. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "States that pole orientation (North/South) dictates whether the force vector is attractive or repulsive.",
              "Distinguishes flux as the total quantity of magnetism versus flux density as the concentration per unit area.",
              "Explains that reducing the surface area of a pole increases the flux density for a constant total flux.",
              "Relates higher flux density to a more powerful and efficient magnetic interaction.",
              "Synthesizes how managing the path of flux is essential for technical magnetic applications.",
              "Maintains technical precision regarding the relationship between area, quantity, and intensity.",
              "Addresses all four required components of the prompt."
            ],
            "expectedAnswer": [
              "The direction of force is determined by the alignment of magnetic poles, while the total magnetic flux defines the overall capacity of the magnet. By concentrating this flux into a smaller surface area, the flux density increases, which significantly heightens the intensity of the attraction or repulsion at the point of contact. This optimization of flux density relative to total flux is what determines the efficiency and strength of a magnetic circuit in technical applications.",
              "• Magnetic poles determine if the interaction results in attraction or repulsion based on their orientation.\n• Flux represents the total magnetic output, whereas flux density measures how concentrated that output is over a specific area.\n• Reducing the pole's surface area increases the flux density, creating a much stronger localized force for the same amount of total flux.\n• Efficiency is achieved when the maximum amount of flux is concentrated into the smallest possible area to perform work."
            ],
            "hint": "Consider how the same amount of 'total magnetism' can feel stronger or weaker depending on the size of the magnet's tip."
          }
        ]
      }
    },
    {
      "id": "202-5A3-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "202-5A3-SR-1",
            "questionText": "What is the standard SI unit of measurement for force?",
            "expectedAnswer": [
              "newton",
              "newtons",
              "n"
            ],
            "hint": "It is named after the scientist who formulated the laws of motion.",
            "answerType": "short-text"
          },
          {
            "id": "202-5A3-SR-2",
            "questionText": "What term describes a physical quantity that has both magnitude and direction?",
            "expectedAnswer": [
              "vector",
              "vectors",
              "vector quantity"
            ],
            "hint": "This is distinct from a scalar quantity, which only has magnitude.",
            "answerType": "short-text"
          },
          {
            "id": "202-5A3-SR-3",
            "questionText": "Which metric prefix is used to represent a multiplier of one thousand (1,000)?",
            "expectedAnswer": [
              "kilo",
              "k",
              "kilo-"
            ],
            "hint": "Think of the prefix used in terms like 'kilometre' or 'kilogram'.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Magnetism basics"
      }
    }
  ],
  "metadata": {
    "created": "2026-02-11",
    "updated": "2026-02-11",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}