{
  "id": "202-5AAA",
  "title": "202.5AAA — Magnetism basics",
  "description": "Learn about Magnetism basics in Science 2365 Level 2",
  "layout": "split-vis",
  "unit": "Unit 202",
  "topic": "Magnetism basics",
  "learningOutcomes": [
    "Describe the principles of attraction and repulsion between magnetic poles",
    "Explain the difference between magnetic flux and magnetic flux density",
    "Classify simple magnetic scenarios as relating to either flux or flux density"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "202-5AAA-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Describe the principles of attraction and repulsion between magnetic poles",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the difference between magnetic flux and magnetic flux density",
            "bloomLevel": "understand"
          },
          {
            "text": "Classify simple magnetic scenarios as relating to either flux or flux density",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "202-5AAA-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Magnetic Poles",
            "definition": "The two ends of a magnet where the magnetic force is strongest and where attraction or repulsion occurs."
          },
          {
            "term": "Magnetic Field",
            "definition": "The invisible region of force surrounding a magnet where its influence can be detected on other magnetic materials."
          },
          {
            "term": "Magnetic Flux",
            "definition": "Symbolised by Φ and measured in Webers, magnetic flux is the total quantity of magnetic field lines produced, not the concentration of those lines."
          },
          {
            "term": "Magnetic Flux Density",
            "definition": "Symbolised by B and measured in Teslas, flux density is the amount of magnetic field passing through a specific unit area, which is different from flux because it measures field intensity."
          },
          {
            "term": "Weber (Wb)",
            "definition": "The SI unit used to measure the total amount of magnetic flux emitted by a source."
          },
          {
            "term": "Tesla (T)",
            "definition": "The SI unit used to measure magnetic flux density, representing the strength of the magnetic field per square metre."
          }
        ]
      }
    },
    {
      "id": "202-5AAA-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Magnetism basics Diagram",
        "description": "Visual representation of Magnetism basics",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "magnetic-poles",
          "magnetic-field",
          "magnetic-flux",
          "magnetic-flux-density"
        ],
        "placeholderText": "A diagram showing two bar magnets. The first part shows two magnets with North and South poles facing each other to demonstrate attraction, and two North poles facing each other to show repulsion. Invisible field lines (magnetic-field) should be shown looping from North to South. The second part of the diagram should show a single magnet with many field lines (magnetic-flux) emerging from it. A small square frame should be placed in the path of these lines to illustrate 'flux density'—showing that the number of lines passing through that specific square area represents the magnetic-flux-density."
      }
    },
    {
      "id": "202-5AAA-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Magnetic Poles and Interaction",
        "content": "### In this lesson\n- You will learn how magnets interact with one another through their invisible forces.\n- This lesson is set in the context of fundamental electrical science, which is the basis for understanding motors and transformers.\n- Key takeaways: Like poles repel, opposite poles attract, and magnetic forces are strongest at the ends of the magnet.\n\n**What this is**\nMagnetism is a fundamental force of nature that acts upon specific materials, such as iron, nickel, and cobalt. Every magnet, regardless of its shape or size, possesses two distinct regions known as **Magnetic Poles**. These are typically referred to as the North-seeking pole and the South-seeking pole. Around these poles exists a **Magnetic Field**, which is the invisible region of force where the magnet’s influence can be detected. While we cannot see the field directly, we can visualise it using field lines that flow from the North pole to the South pole. These lines represent the path that a small North-seeking pole would take if placed within the field.\n\n**Why it matters**\nUnderstanding how **Magnetic Poles** interact is critical for an electrician because it explains the mechanical rotation in electric motors and the operation of solenoids. In a motor, magnetic forces are used to push and pull components to create motion. If you do not understand the principles of attraction and repulsion, you cannot grasp how electrical energy is converted into mechanical work. This knowledge also helps in identifying how magnetic interference might affect sensitive electronic equipment or how protective devices like circuit breakers use magnetic trips to detect faults.\n\n**Key facts / rules**\n- Every magnet has exactly two **Magnetic Poles**: North and South.\n- The **Magnetic Field** is strongest at the poles and weakens as you move further away.\n- Like poles (North-North or South-South) will always repel each other.\n- Opposite poles (North-South) will always attract each other.\n- Magnetic field lines never cross each other and always form continuous loops.\n- The force of attraction or repulsion increases as the distance between the poles decreases.\n\n**How to recognise it**\nTo identify how magnets are interacting, you must observe the physical movement or resistance between them. If you attempt to bring two magnets together and feel an invisible \"cushion\" or a force pushing them apart, you are recognising repulsion between like poles. Conversely, if the magnets snap together with force, you are witnessing attraction between opposite poles. On the diagram, notice that the **magnetic-field** lines indicate the direction of the force flowing from the North pole to the South pole. You can also recognise the strength of the field by looking at the concentration of these lines; where they are closest together (at the poles), the force is at its peak intensity.\n\n**Common mistakes**\nLearners often confuse **attraction** with **repulsion**; **attraction** is the force that pulls opposite poles together, whereas **repulsion** is the force that pushes like poles apart. Another common error is believing that a magnet can have only one pole; in reality, even if a magnet is snapped in half, each piece will immediately develop its own North and South pole.\n\n**Key Points**\n- Magnets always have two poles: North and South.\n- The **Magnetic Field** is the area where magnetic forces act.\n- Opposite poles attract; like poles repel.\n- Magnetic force is most concentrated at the poles.\n\n**Quick recap**\nMagnetism is defined by the presence of a **Magnetic Field** surrounding a magnet's North and South **Magnetic Poles**. These poles dictate how magnets interact, following the simple rule that opposites attract and likes repel. This invisible interaction is the foundation for much of the electrical equipment used in modern installations.\n\n### Coming Up Next\nWe will move from the physical interaction of poles to the specific units used to measure the quantity and intensity of magnetism: flux and flux density."
      }
    },
    {
      "id": "202-5AAA-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Magnetic Poles and Interaction",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "202-5AAA-C1-L1-A",
            "questionText": "State the specific number of magnetic poles that every magnet possesses.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "two Magnetic Poles",
              "exactly two",
              "two",
              "2"
            ],
            "hint": "Every magnet, regardless of its shape, has a North and a South pole."
          },
          {
            "id": "202-5AAA-C1-L1-B",
            "questionText": "How do the forces of attraction and repulsion differ in terms of how they move magnetic poles?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "attraction pulls opposite poles together whereas repulsion pushes like poles apart",
              "attraction pulls opposites whereas repulsion pushes likes",
              "attraction pulls together whereas repulsion pushes apart"
            ],
            "hint": "Think about whether the poles are the same or different and the direction of the resulting force."
          },
          {
            "id": "202-5AAA-C1-L1-C",
            "questionText": "On the diagram, what specific information do the magnetic-field lines provide about the force between poles?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "direction of the force flowing from the North pole to the South pole",
              "direction of the force",
              "force direction"
            ],
            "hint": "Look at the flow of the lines between the North and South poles on the diagram."
          },
          {
            "id": "202-5AAA-C1-L2",
            "questionText": "Using your answers to Q1 (number of poles), Q2 (attraction and repulsion), and Q3 (field line direction), explain how the properties of poles define the physical interaction between two magnets.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Magnets interact through two distinct poles which determine the type of force",
              "The direction of the field lines from North to South dictates how the poles pull or push",
              "Interaction is defined by whether like poles repel or opposite poles attract"
            ],
            "expectedAnswer": [
              "Every magnet has two poles that create a field flowing from North to South, which causes opposite poles to pull together and like poles to push apart.",
              "The two poles of a magnet interact based on the direction of their field lines, resulting in attraction between opposites and repulsion between likes."
            ],
            "hint": "Connect the existence of the two poles to the direction of the force and the resulting movement."
          }
        ]
      }
    },
    {
      "id": "202-5AAA-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Magnetic Flux vs. Flux Density",
        "content": "### In this lesson\n- You will learn to distinguish between the total amount of magnetism and how concentrated it is.\n- This is essential for calculating the efficiency of electrical machines like transformers.\n- Key takeaways: Flux is the total quantity, Flux Density is the concentration, and they use different SI units (Webers and Teslas).\n\n**What this is**\nWhen we talk about magnetism in a scientific context, we need to measure it accurately. **Magnetic Flux**, symbolised by the Greek letter Phi (Φ), represents the total quantity of magnetic field lines produced by a magnet. Think of it as the total \"volume\" of magnetism. The unit of measurement for flux is the **Weber (Wb)**. On the other hand, **Magnetic Flux Density**, symbolised by the letter B, describes how concentrated those magnetic field lines are within a specific area. If you have a large amount of flux squeezed into a very small space, you have a high flux density. The unit for flux density is the **Tesla (T)**.\n\n**Why it matters**\nIn electrical engineering, simply knowing the total amount of magnetism (flux) isn't enough; we need to know if that magnetism is strong enough to perform a task. For example, in a transformer core, the **Magnetic Flux Density** must be carefully managed. If the density is too high, the core can become \"saturated,\" leading to inefficiency and overheating. By understanding the difference between the total **Magnetic Flux** and its density, electricians and designers can ensure that equipment operates within its safe and efficient limits.\n\n**Key facts / rules**\n- **Magnetic Flux** (Φ) is the total number of magnetic lines of force.\n- The **Weber (Wb)** is the SI unit for measuring total flux.\n- **Magnetic Flux Density** (B) is the amount of flux per unit area (usually per square metre).\n- The **Tesla (T)** is the SI unit for flux density.\n- Flux density is a measure of the \"intensity\" or strength of the field at a specific point.\n- If the area decreases while the flux remains the same, the flux density will increase.\n\n**How to recognise it**\nYou can recognise the difference between these two concepts by looking at the \"big picture\" versus the \"specific spot.\" If a scenario describes the total output of a magnetic source, it is referring to **Magnetic Flux**. For example, saying a magnet emits a certain amount of total field lines is a flux measurement in Webers. If a scenario describes the strength of a field passing through a specific metal plate or a square centimetre of a motor, it is referring to **Magnetic Flux Density**. On the diagram, notice that **magnetic-flux-density** is represented by how tightly packed the lines are within the shaded area, whereas **magnetic-flux** represents all the lines shown. \n\n**Common mistakes**\nLearners often confuse **Magnetic Flux** with **Magnetic Flux Density**; **Magnetic Flux** is the total quantity of the field measured in Webers, whereas **Magnetic Flux Density** is the concentration of that field per unit area measured in Teslas. It is also a mistake to think that a large magnet always has a higher flux density than a small one; a small, powerful magnet can have a very high density even if its total flux is low.\n\n**Key Points**\n- Flux (Φ) = Total quantity (Webers).\n- Flux Density (B) = Concentration (Teslas).\n- More lines in a smaller area equals higher density.\n- Both units are essential for describing the strength and scale of a magnetic field.\n\n**Quick recap**\nWhile **Magnetic Flux** tells us the total amount of magnetism available (measured in Webers), **Magnetic Flux Density** tells us how \"squashed\" or concentrated that magnetism is (measured in Teslas). Recognising which term to use depends on whether you are looking at the total magnetic output or the intensity of the field in a specific area.\n\n### Coming Up Next\nNow that you understand the basics of magnetism and its measurements, we will explore how electricity can be used to create magnetic fields in the topic of Electromagnetism."
      }
    },
    {
      "id": "202-5AAA-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Magnetic Flux vs. Flux Density",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "202-5AAA-C2-L1-A",
            "questionText": "What does the term Magnetic Flux represent in a magnetic field?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "total quantity of magnetic field lines",
              "total quantity",
              "total amount of field lines",
              "volume of magnetism"
            ],
            "hint": "Think of this as the total 'volume' or amount of magnetism produced."
          },
          {
            "id": "202-5AAA-C2-L1-B",
            "questionText": "How do the units for measuring total magnetic quantity differ from those used for field concentration?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Magnetic Flux is measured in Webers whereas Magnetic Flux Density is measured in Teslas",
              "Webers for flux whereas Teslas for density",
              "Webers and Teslas"
            ],
            "hint": "Recall the specific SI units for total quantity (Φ) and concentration (B)."
          },
          {
            "id": "202-5AAA-C2-L1-C",
            "questionText": "On the diagram, what visual feature represents the magnetic-flux-density?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "how tightly packed the lines are within the shaded area",
              "how tightly packed the lines are",
              "tightly packed lines"
            ],
            "hint": "Look at the concentration of lines in the specific area shown on the diagram."
          },
          {
            "id": "202-5AAA-C2-L2",
            "questionText": "Using your answers to Q1 (total quantity), Q2 (measurement units), and Q3 (visual representation), explain the difference between the total output of a magnet and its intensity in a specific area.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Flux is the total volume of magnetism measured in Webers",
              "Flux density is the concentration or intensity measured in Teslas",
              "Visual packing of lines indicates density while the sum of all lines indicates flux"
            ],
            "expectedAnswer": [
              "Magnetic flux is the total quantity of lines measured in Webers, while flux density is how tightly packed those lines are in an area, measured in Teslas.",
              "Total magnetism (flux) is measured in Webers, but its intensity (density) depends on the area it is packed into, which is measured in Teslas."
            ],
            "hint": "Relate the total amount of field lines to how closely they are squeezed together in a specific space."
          }
        ]
      }
    },
    {
      "id": "202-5AAA-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "202-5AAA-P1",
            "questionText": "What is the SI unit used to measure the total quantity of magnetic flux (Φ) emitted by a source?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Weber",
              "the Weber",
              "Webers"
            ],
            "hint": "This unit is represented by the symbol Wb."
          },
          {
            "id": "202-5AAA-P2",
            "questionText": "An electrician brings the North pole of a magnet towards the North-seeking pole of a magnetic trip mechanism. What specific magnetic interaction will occur?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Repulsion",
              "repel",
              "repelling"
            ],
            "hint": "Think about how 'like' poles interact with one another."
          },
          {
            "id": "202-5AAA-P3",
            "questionText": "If a single permanent bar magnet is snapped into 5 smaller individual pieces, how many total magnetic poles will be present across all the pieces? (Round to the nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "10",
              "10.0"
            ],
            "hint": "Every separate piece of a magnet immediately develops its own North and South poles."
          },
          {
            "id": "202-5AAA-P4",
            "questionText": "Which term describes the concentration of magnetic field lines passing through a specific unit area?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Magnetic Flux Density",
              "the magnetic flux density"
            ],
            "hint": "This property is symbolised by the letter B and represents field intensity."
          },
          {
            "id": "202-5AAA-P5",
            "questionText": "Which SI unit is used to measure the strength of a magnetic field per square metre (flux density)?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Tesla",
              "the Tesla",
              "Teslas"
            ],
            "hint": "This unit is represented by the symbol T."
          }
        ]
      }
    },
    {
      "id": "202-5AAA-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "202-5AAA-INT-1",
            "questionText": "Explain how the distribution of magnetic force across a magnet's surface relates to its interaction with other magnets. In your answer, include: (1) the law of attraction and repulsion, (2) where the magnetic force is most concentrated, and (3) the relationship between this concentration and magnetic flux density. (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "States that opposite poles attract and like poles repel",
              "Identifies that magnetic forces are strongest/most concentrated at the poles",
              "Connects high concentration of flux lines to the concept of flux density",
              "Explains that flux density is highest where the force is strongest",
              "Uses correct terminology (poles, flux density)"
            ],
            "expectedAnswer": [
              "The law of magnetism states that opposite poles attract while like poles repel, with these forces being most concentrated at the ends of the magnet. Because the magnetic flux is most tightly packed at these poles, the magnetic flux density is at its highest point there.",
              "Magnetic forces cause attraction between opposites and repulsion between like poles, specifically at the magnet's poles where the force is strongest. This strength is a result of high magnetic flux density, where the total magnetic flux is concentrated into a small area."
            ],
            "hint": "Think about where the invisible lines of force are closest together and how that relates to the physical 'ends' of the magnet."
          },
          {
            "id": "202-5AAA-INT-2",
            "questionText": "Summarize how scientific measurements of magnetism explain the physical behavior of magnets in electrical applications. In your answer, include: (1) the interaction between like and opposite poles, (2) the definition and unit of magnetic flux, (3) the definition and unit of magnetic flux density, and (4) how these concepts combine to determine the strength of a magnetic field. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Describes attraction between opposite poles and repulsion between like poles",
              "Defines magnetic flux as the total quantity of magnetism",
              "Identifies the Weber (Wb) as the unit for magnetic flux",
              "Defines magnetic flux density as the concentration of flux per unit area",
              "Identifies the Tesla (T) as the unit for magnetic flux density",
              "Explains that higher flux density results in a stronger magnetic field/force",
              "Links the physical interaction (attraction/repulsion) to the density of the field",
              "Distinguishes between total quantity (flux) and field intensity (density)"
            ],
            "expectedAnswer": [
              "Magnets interact by attracting opposite poles and repelling like poles, a force governed by the magnetic flux density (measured in Teslas). While magnetic flux is the total quantity of magnetism measured in Webers, the flux density describes its concentration in a specific area. Ultimately, the higher the flux density at the poles, the stronger the resulting magnetic field and its physical interactions.",
              "1. Like poles repel and opposite poles attract. 2. Magnetic flux is the total magnetism produced, measured in Webers (Wb). 3. Magnetic flux density is the concentration of that flux per square meter, measured in Teslas (T). 4. A strong magnetic field is created when a high amount of flux is concentrated into a small area, increasing the flux density."
            ],
            "hint": "Consider the difference between the total amount of 'magnetism' and how 'squashed' it is into a specific space."
          }
        ]
      }
    },
    {
      "id": "202-5AAA-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "202-5AAA-SR-1",
            "questionText": "In electrostatics, what do two identical positive charges do when placed near each other?",
            "expectedAnswer": [
              "Repel",
              "They repel",
              "Repulsion"
            ],
            "hint": "Think about whether 'like' charges attract or move away from each other.",
            "answerType": "short-text"
          },
          {
            "id": "202-5AAA-SR-2",
            "questionText": "What is the standard SI unit of measurement for electrical current?",
            "expectedAnswer": [
              "Ampere",
              "Amps",
              "Amp",
              "Amperes"
            ],
            "hint": "It is the unit measured by an ammeter.",
            "answerType": "short-text"
          },
          {
            "id": "202-5AAA-SR-3",
            "questionText": "Which negatively charged subatomic particle orbits the nucleus of an atom?",
            "expectedAnswer": [
              "Electron",
              "Electrons",
              "The electron"
            ],
            "hint": "The movement of these particles creates an electric current.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Magnetism basics"
      }
    }
  ],
  "metadata": {
    "created": "2026-02-11",
    "updated": "2026-02-11",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}