{
  "id": "202-202-5A",
  "title": "202.202-5A —  Magnetism basics ",
  "description": "Learn about  Magnetism basics  in Science 2365 Level 2",
  "layout": "split-vis",
  "unit": "Unit 202",
  "topic": " Magnetism basics ",
  "learningOutcomes": [
    "Describe the principles of magnetic attraction and repulsion between poles",
    "Explain the conceptual difference between magnetic flux and magnetic flux density",
    "Classify simple scenarios as examples of either magnetic flux or flux density"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "202-202-5A-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Describe the principles of magnetic attraction and repulsion between poles",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the conceptual difference between magnetic flux and magnetic flux density",
            "bloomLevel": "understand"
          },
          {
            "text": "Classify simple scenarios as examples of either magnetic flux or flux density",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "202-202-5A-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Magnetic Pole",
            "definition": "A magnetic pole is one of the two regions at the ends of a magnet where the magnetic force is strongest, designated as either North or South."
          },
          {
            "term": "Magnetic Field",
            "definition": "A magnetic field is the invisible region surrounding a magnet where magnetic materials or moving electric charges experience a force of attraction or repulsion."
          },
          {
            "term": "Magnetic Flux",
            "definition": "Magnetic flux is the total number of magnetic field lines produced by a magnet, measured in Webers (Wb), rather than the concentration of those lines in a specific spot."
          },
          {
            "term": "Magnetic Flux Density",
            "definition": "Magnetic flux density is the measure of how concentrated the magnetic flux is within a specific unit area, measured in Tesla (T), which differs from total flux as it depends on the cross-sectional area."
          },
          {
            "term": "Weber (Wb)",
            "definition": "The Weber is the SI unit used to measure total magnetic flux, representing the overall quantity of magnetic field lines present."
          },
          {
            "term": "Tesla (T)",
            "definition": "The Tesla is the SI unit for magnetic flux density, defined as one Weber per square metre of area."
          }
        ]
      }
    },
    {
      "id": "202-202-5A-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": " Magnetism basics  Diagram",
        "description": "Visual representation of  Magnetism basics ",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "magnetic-pole",
          "magnetic-field",
          "magnetic-flux",
          "magnetic-flux-density"
        ],
        "placeholderText": "The diagram should show a standard bar magnet with a North and South end clearly labeled as a magnetic-pole. Curved lines representing the magnetic-field should exit the North pole and enter the South pole. To illustrate magnetic-flux, a group of these lines should be highlighted as a 'total bundle'. To illustrate magnetic-flux-density, a small square 'window' should be placed near the pole where lines are crowded, and another identical square window further away where lines are sparse, showing the difference in concentration (Tesla) despite the total lines (Weber) being the same."
      }
    },
    {
      "id": "202-202-5A-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Magnetic Poles and Interaction",
        "content": "### In this lesson\nThis lesson introduces the fundamental nature of magnetism and how magnetic objects interact with one another.\nYou are exploring the foundational science required to understand electrical components like motors, relays, and transformers.\n- Like poles repel each other, while opposite poles attract.\n- Magnetic force is concentrated at the ends of a magnet.\n- Every magnet possesses a North and South pole regardless of its size.\n\n**What this is**\nMagnetism is a physical phenomenon produced by the motion of electric charge, resulting in attractive and repulsive forces between objects. At the heart of every magnet are two specific areas known as a **Magnetic Pole**. These are the regions where the magnetic strength is most intense. By convention, we identify these as the North-seeking pole and the South-seeking pole. Surrounding these poles is an invisible area of influence called the **Magnetic Field**. This field is the space where magnetic materials—such as iron, steel, or nickel—will experience a physical force without even touching the magnet itself.\n\n**Why it matters**\nUnderstanding how poles interact is the primary principle behind how an electric motor turns. By using electricity to create temporary magnets (electromagnets), we can force poles to repel and attract in a sequence that creates rotational movement. In domestic and commercial installations, these principles also govern the operation of circuit breakers (MCBs) and residual current devices (RCDs), which often use magnetic forces to trip a switch during a fault. Without a clear grasp of the **Magnetic Pole** and the resulting **Magnetic Field**, an electrician cannot fully understand how protective devices or machinery function.\n\n**Key facts / rules**\n- Every magnet must have at least one North and one South **Magnetic Pole**.\n- The rule of magnetism states: Like poles repel (North pushes North away).\n- The rule of magnetism states: Opposite poles attract (North pulls South closer).\n- Magnetic field lines are continuous loops that, by convention, flow from the North pole to the South pole outside the magnet.\n- The strength of the **Magnetic Field** decreases as the distance from the **Magnetic Pole** increases.\n- Breaking a magnet in half does not isolate a pole; it simply creates two smaller magnets, each with its own North and South.\n\n**How to recognise it**\nTo identify how magnets are interacting, you must look at the direction of the force being applied. If you bring two magnets together and feel a physical resistance pushing your hands apart, you are observing repulsion between two identical poles. Conversely, if the magnets jump toward each other, you are observing attraction between opposite poles. On the diagram, notice that the lines representing the **Magnetic Field** flow from the North to the South **Magnetic Pole**. In a laboratory or workshop setting, you can recognise the shape of the field by using iron filings; the filings will cluster most densely at the **Magnetic Pole** and spread out to trace the invisible lines of the field.\n\n**Common mistakes**\nLearners often confuse a **Magnetic Pole** with a **Magnetic Field**; a **Magnetic Pole** is one of the two regions at the ends of a magnet where the force is strongest, whereas a **Magnetic Field** is the entire invisible region surrounding the magnet where forces are experienced. Another common error is assuming that all metals are magnetic; in reality, only ferromagnetic materials like iron or steel respond significantly to these fields.\n\n**Key Points**\n- Magnets always have two poles: North and South.\n- Attraction occurs between opposite poles; repulsion occurs between like poles.\n- The **Magnetic Field** is the area where magnetic forces can be detected.\n- Field lines move from North to South externally.\n\n**Quick recap**\nMagnetism is centered around the **Magnetic Pole**, where the force is strongest. These poles interact according to the principles of attraction and repulsion: opposites attract and likes repel. This interaction takes place within the **Magnetic Field**, an invisible region of influence that governs how magnetic materials and electrical components behave.\n\n### Coming Up Next\nNow that we understand how magnets pull and push, we will look at how we measure the total amount of magnetism and its concentration using the concepts of flux and flux density."
      }
    },
    {
      "id": "202-202-5A-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Magnetic Poles and Interaction",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "202-202-5A-C1-L1-A",
            "questionText": "What is the fundamental rule regarding how different magnetic poles interact with each other?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Like poles repel each other while opposite poles attract",
              "like poles repel and opposite poles attract",
              "opposites attract and likes repel"
            ],
            "hint": "Think about what happens when you bring identical or different poles together."
          },
          {
            "id": "202-202-5A-C1-L1-B",
            "questionText": "In which specific regions of a magnet is the magnetic force the most concentrated?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "ends of a magnet",
              "the ends of a magnet",
              "at the ends of a magnet"
            ],
            "hint": "Identify the physical locations on a magnet where the strength is highest."
          },
          {
            "id": "202-202-5A-C1-L1-C",
            "questionText": "According to the diagram, in which direction do the lines representing the magnetic field flow?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "North to the South Magnetic Pole",
              "North to South Magnetic Pole",
              "from North to South"
            ],
            "hint": "Look at the visual path the field lines take outside of the magnet."
          },
          {
            "id": "202-202-5A-C1-L2",
            "questionText": "Using your answers to Q1 (pole interaction), Q2 (force concentration), and Q3 (field line direction), explain how these principles define the behavior of a magnet.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "magnetic force is strongest at the ends and flows from north to south causing like poles to repel and opposites to attract",
              "the field lines flow from north to south poles where force is highest to create attraction or repulsion",
              "the concentrated force at the poles and the direction of field lines determine if magnets pull together or push apart"
            ],
            "hint": "Connect the location of the force and the direction of the field to the rules of attraction and repulsion."
          }
        ]
      }
    },
    {
      "id": "202-202-5A-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Magnetic Flux and Density",
        "content": "### In this lesson\nThis lesson explains how we quantify magnetism using the concepts of total field and concentration.\nYou are learning how to distinguish between the total \"amount\" of magnetism and how \"squashed\" it is into a specific area.\n- **Magnetic Flux** represents the total number of field lines produced.\n- **Magnetic Flux Density** represents how concentrated those lines are.\n- Different units (**Weber** and **Tesla**) are used to measure these distinct properties.\n\n**What this is**\nWhen we talk about the total quantity of magnetism, we refer to **Magnetic Flux**. Think of this as the total volume of \"magnetic energy\" coming out of a magnet, represented by the total number of invisible field lines. The SI unit for this total quantity is the **Weber (Wb)**. However, knowing the total flux isn't always enough; we often need to know how strong the magnet is in one specific spot. This is **Magnetic Flux Density**. It measures how many of those field lines pass through a specific unit of area (usually one square metre). The SI unit for density is the **Tesla (T)**, which is defined as one **Weber** per square metre.\n\n**Why it matters**\nIn electrical engineering, the difference between these two terms is critical for designing efficient equipment. For example, a transformer core must be able to handle a certain **Magnetic Flux Density** before it becomes \"saturated\" and stops working efficiently. If an electrician understands that **Magnetic Flux** is the total output while density is the concentration, they can better understand why some magnets are physically smaller but much stronger than larger ones. This knowledge is vital when selecting components that rely on magnetic induction, such as high-efficiency motors or sensitive measuring instruments.\n\n**Key facts / rules**\n- **Magnetic Flux** is the total number of magnetic field lines and is measured in **Weber (Wb)**.\n- **Magnetic Flux Density** is the concentration of flux per unit area and is measured in **Tesla (T)**.\n- If the same amount of flux is squeezed into a smaller area, the **Magnetic Flux Density** increases.\n- 1 **Tesla** is equal to 1 **Weber** per square metre (1 T = 1 Wb/m²).\n- **Magnetic Flux** describes the \"whole picture,\" while density describes the \"intensity\" at a point.\n- Changing the cross-sectional area of a magnetic path will change the density even if the total flux remains the same.\n\n**How to recognise it**\nTo classify scenarios correctly, ask if you are looking at the \"total\" or the \"concentration.\" If a manufacturer describes the total magnetic output of a large industrial electromagnet, they are referring to **Magnetic Flux**. If a technician uses a probe to measure the strength of a field at a specific point on a motor casing to ensure it is safe, they are measuring **Magnetic Flux Density**. On the diagram, notice that where the field lines are closest together near the poles, the **Magnetic Flux Density** is highest, even though the total **Magnetic Flux** (the total number of lines) remains constant throughout the loop. You can recognise a high-density area because the field lines appear tightly packed.\n\n**Common mistakes**\nLearners often confuse **Magnetic Flux** with **Magnetic Flux Density**; **Magnetic Flux** is the total number of magnetic field lines produced by a magnet, whereas **Magnetic Flux Density** is the measure of how concentrated that flux is within a specific unit area. Students also sometimes mix up the units; remember that the **Weber (Wb)** is for the total amount, while the **Tesla (T)** is for the concentration per square metre.\n\n**Key Points**\n- **Magnetic Flux** = Total field lines (measured in **Weber**).\n- **Magnetic Flux Density** = Concentration of lines (measured in **Tesla**).\n- A smaller area with the same flux results in a higher **Tesla** rating.\n- These concepts are the \"quantity\" and \"intensity\" of magnetism.\n\n**Quick recap**\nWe measure the total \"amount\" of magnetism as **Magnetic Flux** in **Weber (Wb)**. To understand how \"strong\" or concentrated that magnetism is in a specific area, we use **Magnetic Flux Density**, measured in **Tesla (T)**. Distinguishing between total quantity and concentration is essential for understanding how electrical machines and transformers are rated and operated.\n\n### Coming Up Next\nWe have covered the basics of permanent magnets and their measurements. Next, we will explore how an electric current flowing through a conductor can create its own magnetic field, a process known as electromagnetism."
      }
    },
    {
      "id": "202-202-5A-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Magnetic Flux and Density",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "202-202-5A-C2-L1-A",
            "questionText": "Which term identifies the total number of magnetic field lines produced by a magnet?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Magnetic Flux",
              "the magnetic flux",
              "flux"
            ],
            "hint": "Identify the name for the total quantity of magnetism."
          },
          {
            "id": "202-202-5A-C2-L1-B",
            "questionText": "Which term describes the measure of how concentrated the magnetic flux is within a specific unit area?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Magnetic Flux Density",
              "the magnetic flux density",
              "flux density"
            ],
            "hint": "Think of the term used for the intensity or concentration of the field lines."
          },
          {
            "id": "202-202-5A-C2-L1-C",
            "questionText": "How is the unit of 1 Tesla defined in relation to the total quantity of magnetism per area?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "1 Weber per square metre",
              "one Weber per square metre",
              "1 Wb/m2"
            ],
            "hint": "State the relationship between the unit for total flux and the unit for density."
          },
          {
            "id": "202-202-5A-C2-L2",
            "questionText": "Using your answers to Q1 (total flux), Q2 (flux density), and Q3 (unit definition), explain how these measurements are used to quantify magnetism.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "magnetic flux is the total field measured in webers while flux density is the concentration measured in tesla per square metre",
              "we measure the whole field as flux and its intensity as density which is one weber per square metre",
              "these units allow us to distinguish between the total amount of magnetism and how tightly packed it is in an area"
            ],
            "hint": "Relate the total amount of field lines to how they are concentrated in a specific measurement of area."
          }
        ]
      }
    },
    {
      "id": "202-202-5A-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "202-202-5A-P1",
            "questionText": "Which SI unit is used to measure the total quantity of magnetic field lines (magnetic flux) produced by a magnet?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Weber",
              "the Weber",
              "Webers"
            ],
            "hint": "It is abbreviated as Wb."
          },
          {
            "id": "202-202-5A-P2",
            "questionText": "A maintenance technician is repurposing a large bar magnet and cuts it into three smaller, equal pieces. How many magnetic poles will each individual piece possess?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2",
              "2.0"
            ],
            "hint": "Every magnet, regardless of size, must have both a North and a South pole."
          },
          {
            "id": "202-202-5A-P3",
            "questionText": "Calculate the magnetic flux density if a total flux of 12.0 Webers passes through a cross-sectional area of 3.0 square metres. (Round to 1 decimal place)",
            "answerType": "numeric",
            "expectedAnswer": [
              "4",
              "4.0"
            ],
            "hint": "Density (T) = Total Flux (Wb) / Area (m²)"
          },
          {
            "id": "202-202-5A-P4",
            "questionText": "You are installing magnetic sensors on a security gate. If the North pole of the sensor magnet is brought directly toward the North pole of the contact magnet, what physical force will be observed?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Repulsion",
              "magnetic repulsion",
              "repelling force"
            ],
            "hint": "The rule of magnetism states that 'like' poles push each other away."
          },
          {
            "id": "202-202-5A-P5",
            "questionText": "What specific term is used to describe the measure of how concentrated the magnetic flux is within a specific unit area?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Magnetic Flux Density",
              "the Magnetic Flux Density"
            ],
            "hint": "This term relates to the 'intensity' of the field and is measured in Tesla (T)."
          }
        ]
      }
    },
    {
      "id": "202-202-5A-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "202-202-5A-INT-1",
            "questionText": "Explain how the interaction between magnetic poles relates to the distribution of magnetic flux. In your answer, include: (1) how like and opposite poles interact, (2) the definition of magnetic flux, (3) where flux lines are most concentrated on a magnet. (2-3 sentences)",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "Opposite poles attract while like poles repel, and these interactions are driven by magnetic flux, which is the total number of field lines produced. These flux lines are always most concentrated at the ends of the magnet, which are the North and South poles.",
              "Magnetic flux represents the total field lines produced by a magnet, which are most densely packed at the poles. These poles interact with other magnets by attracting opposites and repelling like poles."
            ],
            "hint": "Think about where the magnetic force is strongest and what we call the total number of field lines."
          },
          {
            "id": "202-202-5A-INT-2",
            "questionText": "Describe the relationship between the physical interaction of magnets and the quantification of their magnetic fields. In your answer, include: (1) the principle of attraction and repulsion between poles, (2) the definition of magnetic flux (Webers), (3) the definition of magnetic flux density (Tesla), (4) how flux density relates to the strength of the interaction at the poles. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": [
              "Magnets interact through attraction between opposite poles and repulsion between like poles. Magnetic flux (measured in Webers) is the total amount of field lines, while magnetic flux density (measured in Tesla) is the concentration of those lines in a given area. The forces of attraction and repulsion are strongest at the poles because that is where the magnetic flux density is at its highest.",
              "- Like poles repel and opposite poles attract.\n- Magnetic flux is the total number of magnetic field lines measured in Webers.\n- Magnetic flux density is the concentration of these lines measured in Tesla.\n- The interaction between magnets is strongest at the poles because the flux density is greatest at those points.",
              "Magnetic flux is the total field produced (Webers), while flux density (Tesla) measures how 'squashed' that field is. Because magnets have poles that attract opposites and repel likes, the force is strongest where the flux density is highest. This concentration of flux density occurs specifically at the North and South poles."
            ],
            "hint": "Combine the physical behavior of poles with the units used to measure the total field and its concentration."
          }
        ]
      }
    },
    {
      "id": "202-202-5A-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "202-202-5A-SR-1",
            "questionText": "Name the most common magnetic metal used in the construction of electrical components and cores.",
            "expectedAnswer": [
              "Iron",
              "Steel",
              "Soft iron",
              "Ferrous metal"
            ],
            "hint": "It is the primary element in all ferrous metals.",
            "answerType": "short-text"
          },
          {
            "id": "202-202-5A-SR-2",
            "questionText": "In basic physics, do two similar electrical charges (e.g., two positive charges) attract or repel each other?",
            "expectedAnswer": [
              "Repel",
              "They repel",
              "Repulsion"
            ],
            "hint": "Think about the rule 'likes' do one thing, 'opposites' do the other.",
            "answerType": "short-text"
          },
          {
            "id": "202-202-5A-SR-3",
            "questionText": "What is the standard SI unit of measurement for electrical resistance?",
            "expectedAnswer": [
              "Ohm",
              "Ohms",
              "Ω"
            ],
            "hint": "It is represented by the Greek letter Omega.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Magnetism basics"
      }
    }
  ],
  "metadata": {
    "created": "2026-02-09",
    "updated": "2026-02-09",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}