{
  "id": "202-5A1",
  "title": "202.5A1 — Magnetism basics ",
  "description": "Learn about Magnetism basics  in Science 2365 Level 2",
  "layout": "split-vis",
  "unit": "Unit 202",
  "topic": "Magnetism basics ",
  "learningOutcomes": [
    "Describe the principles of magnetic attraction and repulsion",
    "Explain the difference between magnetic flux and magnetic flux density",
    "Classify simple examples as representing either flux or flux density"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "202-5A1-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Describe the principles of magnetic attraction and repulsion",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the difference between magnetic flux and magnetic flux density",
            "bloomLevel": "understand"
          },
          {
            "text": "Classify simple examples as representing either flux or flux density",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "202-5A1-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Magnetic Poles",
            "definition": "The two regions at the ends of a magnet where the magnetic force is strongest, categorized as North and South."
          },
          {
            "term": "Magnetic Field",
            "definition": "The invisible area surrounding a magnet or current-carrying conductor where a magnetic force can be detected."
          },
          {
            "term": "Magnetic Lines of Force",
            "definition": "Imaginary lines used to visualize the direction and intensity of a magnetic field, always travelling from North to South externally."
          },
          {
            "term": "Magnetic Flux",
            "definition": "The total amount of magnetic field lines produced by a source, measured in Webers (Wb), not to be confused with the concentration of those lines."
          },
          {
            "term": "Magnetic Flux Density",
            "definition": "The measure of how many magnetic field lines pass through a specific area, measured in Teslas (T), which is different from flux because it describes the field's concentration rather than its total volume."
          }
        ]
      }
    },
    {
      "id": "202-5A1-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Magnetism basics  Diagram",
        "description": "Visual representation of Magnetism basics ",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "magnetic-poles",
          "magnetic-field",
          "magnetic-lines-of-force",
          "magnetic-flux",
          "magnetic-flux-density"
        ],
        "placeholderText": "A two-part diagram. Part A shows a bar magnet with labels for 'magnetic-poles' (North and South). It illustrates the 'magnetic-field' using 'magnetic-lines-of-force' exiting the North and entering the South. Part B shows two different scenarios: one with a wide area and widely spaced lines representing 'magnetic-flux', and another where the same number of lines are squeezed into a much smaller area to illustrate high 'magnetic-flux-density'."
      }
    },
    {
      "id": "202-5A1-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Magnetic Attraction and Repulsion",
        "content": "### In this lesson\n- You are learning the fundamental principles of how magnets interact with each other and the space around them.\n- Imagine you are working with electrical components like relays or solenoids, where magnetic forces are used to create mechanical movement.\n- Key takeaways include understanding magnetic poles, identifying the direction of field lines, and predicting the movement between two magnets.\n\n**What this is**\nMagnetism is a physical phenomenon produced by the motion of electric charge, resulting in attractive and repulsive forces between objects. In the context of electrical science, we primarily focus on permanent magnets and the **Magnetic Field** they generate. Every magnet has two distinct regions where its force is most concentrated: the **Magnetic Poles**, specifically designated as North and South. These poles are the origin and destination of the magnetic influence that governs how electrical equipment operates.\n\n**Why it matters**\nUnderstanding how magnets behave is essential for an electrician because magnetism is the bridge between electricity and motion. Whether you are installing a motor, a transformer, or a simple door chime, these devices rely on magnetic attraction and repulsion to function. If you do not understand how these forces interact, you cannot fully grasp how a circuit breaker trips under fault conditions or how an electric motor generates torque to turn a pump.\n\n**Key facts / rules**\n- Every magnet possesses two **Magnetic Poles**, regardless of its shape or size.\n- The law of magnetic poles states that like poles (e.g., North and North) repel each other.\n- Unlike poles (e.g., North and South) attract each other with a force that increases as they get closer.\n- A **Magnetic Field** exists in the space surrounding a magnet where these forces can be measured.\n- We visualize this field using **Magnetic Lines of Force**, which represent the path a small North pole would take.\n- Externally, these lines always travel from the North pole to the South pole.\n- Magnetic lines never cross each other and behave like stretched elastic bands, trying to take the shortest path.\n\n**How to recognise it**\nYou can identify the presence of magnetic forces by observing the interaction between two materials. If two objects push away from each other without touching, you are witnessing magnetic repulsion, which indicates that identical **Magnetic Poles** are facing one another. On the diagram, notice that the **magnetic-lines-of-force** indicate the direction of the field as they exit the North pole and enter the South pole. In a practical installation, you might recognise magnetic influence when a compass needle deviates near a high-current cable or when a relay armature clicks into place.\n\n**Common mistakes**\nLearners often confuse a **Magnetic Field** with **Magnetic Lines of Force**; a **Magnetic Field** is the actual physical area of influence surrounding the magnet, whereas **Magnetic Lines of Force** are the specific visual tools or imaginary lines used to show the direction and strength of that field. Another common error is assuming that a magnet only has one pole if it is broken; in reality, breaking a magnet in half simply creates two smaller magnets, each with its own North and South poles.\n\n**Key Points**\n- Magnets always have a North and a South pole.\n- Opposite poles attract; similar poles repel.\n- Field lines flow North to South outside the magnet.\n- The magnetic field is the area where magnetic force is detectable.\n\n**Quick recap**\nMagnetism is a fundamental force in electrical engineering. By identifying the **Magnetic Poles** and understanding the direction of **Magnetic Lines of Force**, we can predict whether two magnets will attract or repel. This invisible **Magnetic Field** is the basis for almost all electromechanical devices used in modern electrical installations.\n\n### Coming Up Next\nNow that we understand how magnets interact, we will look at how to measure the strength and concentration of these magnetic fields using the concepts of flux and flux density."
      }
    },
    {
      "id": "202-5A1-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Magnetic Attraction and Repulsion",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "202-5A1-C1-L1-A",
            "questionText": "What is the Magnetic Field in relation to the space surrounding a magnet?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "actual physical area of influence",
              "physical area of influence",
              "area of influence"
            ],
            "hint": "Think about the physical region where the magnet's force can be felt."
          },
          {
            "id": "202-5A1-C1-L1-B",
            "questionText": "On the diagram, how do the magnetic-lines-of-force indicate the direction of the field?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "exit the North pole and enter the South pole",
              "exit north and enter south",
              "from north to south"
            ],
            "hint": "Look at the flow of the lines from one pole to the other."
          },
          {
            "id": "202-5A1-C1-L1-C",
            "questionText": "What is the rule regarding whether magnetic lines can intersect each other?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "never cross each other",
              "do not cross",
              "never cross"
            ],
            "hint": "Consider if these lines can overlap or if they stay separate like elastic bands."
          },
          {
            "id": "202-5A1-C1-L2",
            "questionText": "Using your answers to Q1 (physical area of influence), Q2 (direction from North to South), and Q3 (lines never crossing), explain how we visualize the behavior of a magnetic field.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "we use lines that exit north and enter south without crossing to map the physical area of influence",
              "the lines map the area of influence by showing a specific direction without ever intersecting",
              "magnetic fields are visualized as non-crossing lines that flow from north to south within the area of influence"
            ],
            "hint": "Combine the physical space, the specific direction of travel, and the fact that lines stay distinct."
          }
        ]
      }
    },
    {
      "id": "202-5A1-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Magnetic Flux vs. Flux Density",
        "content": "### In this lesson\n- You are learning how to distinguish between the total amount of magnetism and how concentrated that magnetism is.\n- Imagine you are comparing two different transformer cores to see which one can handle more magnetic energy without saturating.\n- Key takeaways include the definition of flux, the definition of flux density, and the units used to measure each.\n\n**What this is**\nWhen we describe a **Magnetic Field**, we need precise terms to measure its strength. **Magnetic Flux** refers to the total number of **Magnetic Lines of Force** produced by a magnet or an electromagnet. It is a measure of the \"total volume\" of magnetism available. However, flux alone does not tell the whole story. We also use **Magnetic Flux Density**, which describes how concentrated those lines are within a specific cross-sectional area. While flux tells us the total amount, flux density tells us how \"crowded\" the magnetic field is in a given space.\n\n**Why it matters**\nIn electrical design, flux density is often more important than total flux. For example, the core of a transformer must be large enough to carry the required **Magnetic Flux** without the **Magnetic Flux Density** becoming too high. If the density is too high, the material can become saturated, leading to overheating and inefficiency. Electricians need to understand this difference to appreciate why certain components are sized the way they are and why high-performance magnets (like Neodymium) are more powerful than standard ceramic magnets of the same size.\n\n**Key facts / rules**\n- **Magnetic Flux** is the total quantity of magnetism, represented by the Greek letter Phi (Φ).\n- The unit of measurement for **Magnetic Flux** is the Weber (Wb).\n- **Magnetic Flux Density** is the amount of flux passing through a unit area, represented by the symbol B.\n- The unit of measurement for **Magnetic Flux Density** is the Tesla (T).\n- One Tesla is equal to one Weber per square metre (Wb/m²).\n- If you keep the total flux the same but decrease the area it passes through, the flux density increases.\n- Flux density is a vector quantity, meaning it has both magnitude and direction.\n\n**How to recognise it**\nTo classify examples, look at whether the description focuses on the whole source or a specific point. For instance, the total output of a bar magnet is a representation of **Magnetic Flux**. Conversely, the strength of the field measured exactly at the tip of a needle-nose magnet is an example of **Magnetic Flux Density**. On the diagram, notice that the **magnetic-flux-density** is shown as more lines passing through a smaller cross-sectional area, indicating a more intense field. If you are told a magnet produces \"0.01 Webers,\" you are looking at flux; if you are told it has a strength of \"1.2 Teslas,\" you are looking at density.\n\n**Common mistakes**\nLearners often confuse **Magnetic Flux** with **Magnetic Flux Density**; **Magnetic Flux** is the total volume of field lines produced by a source, whereas **Magnetic Flux Density** is the concentration of those lines passing through a specific area. It is similar to the difference between the total amount of water coming out of a showerhead (flux) and the pressure of the water hitting a single spot on the floor (density).\n\n**Key Points**\n- Flux (Webers) is the total amount of magnetic field.\n- Flux Density (Teslas) is the concentration of the field per square metre.\n- High flux density means the magnetic lines are packed tightly together.\n- Transformers and motors are designed based on managing flux density levels.\n\n**Quick recap**\nUnderstanding the difference between **Magnetic Flux** and **Magnetic Flux Density** is vital for understanding electrical machine theory. Flux tells us the total magnetic \"quantity\" measured in Webers, while flux density tells us the \"intensity\" or concentration measured in Teslas. This distinction allows engineers to design efficient equipment that avoids magnetic saturation.\n\n### Coming Up Next\nWe have covered the basics of permanent magnets and field measurements. Next, we will explore how electricity can be used to create these magnetic effects through the study of electromagnetism."
      }
    },
    {
      "id": "202-5A1-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Magnetic Flux vs. Flux Density",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "202-5A1-C2-L1-A",
            "questionText": "In contrast to total flux, how is Magnetic Flux Density defined?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "concentration of those lines passing through a specific area",
              "concentration of lines in an area",
              "concentration of flux in an area"
            ],
            "hint": "Focus on how crowded the lines are in a particular space rather than the total amount."
          },
          {
            "id": "202-5A1-C2-L1-B",
            "questionText": "What is the unit of measurement used for Magnetic Flux Density?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Tesla",
              "Teslas",
              "T"
            ],
            "hint": "This unit represents one Weber per square metre."
          },
          {
            "id": "202-5A1-C2-L1-C",
            "questionText": "On the diagram, how is a high magnetic-flux-density visually identified?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "more lines passing through a smaller cross-sectional area",
              "more lines in a smaller area",
              "closely packed lines"
            ],
            "hint": "Look for where the lines are most concentrated on the drawing."
          },
          {
            "id": "202-5A1-C2-L2",
            "questionText": "Using your answers to Q1 (concentration in an area), Q2 (Tesla unit), and Q3 (visual line density), explain how the intensity of a magnetic field is measured and represented.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "field intensity is measured in Teslas which represents the concentration of lines shown in a specific area",
              "we measure the concentration of lines in Teslas and visualize it by showing more lines in a smaller area",
              "flux density uses the Tesla unit to quantify the concentration of lines seen in a cross-sectional area"
            ],
            "hint": "Explain how the visual crowding of lines relates to the technical definition and the unit used to measure it."
          }
        ]
      }
    },
    {
      "id": "202-5A1-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Magnetic Attraction and Flux Practice",
        "questions": [
          {
            "id": "202-5A1-P1",
            "questionText": "In which direction do magnetic lines of force travel when they are outside of a permanent magnet?",
            "answerType": "short-text",
            "expectedAnswer": [
              "North to South",
              "North pole to South pole"
            ],
            "hint": "Identify the origin and destination of the lines externally."
          },
          {
            "id": "202-5A1-P2",
            "questionText": "An electrician is installing a magnetic door lock (maglock). When the electromagnet is energised, it pulls the steel armature plate toward it to lock the door. Which magnetic phenomenon is being used to keep the door closed?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Magnetic Attraction",
              "attraction",
              "the magnetic attraction"
            ],
            "hint": "Consider how unlike poles or magnetic materials react to a field."
          },
          {
            "id": "202-5A1-P3",
            "questionText": "A transformer core has a cross-sectional area of 1 square metre. If the total magnetic flux produced is 1.2 Webers, what is the magnetic flux density? (Round to 1 decimal place)",
            "answerType": "numeric",
            "expectedAnswer": [
              "1.2",
              "1.20"
            ],
            "hint": "1 Tesla = 1 Weber per square metre (T)"
          },
          {
            "id": "202-5A1-P4",
            "questionText": "What term identifies the total quantity of magnetism produced by a source, rather than its concentration in a specific area?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Magnetic Flux",
              "the Magnetic Flux",
              "Flux"
            ],
            "hint": "This value is measured in Webers (Wb)."
          },
          {
            "id": "202-5A1-P5",
            "questionText": "If a magnetic field has a total flux of 8 Webers passing through an area of 2 square metres, what is the flux density? (Round to the nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "4",
              "4.0"
            ],
            "hint": "Divide the total flux by the area. Answer in Teslas (T)."
          }
        ]
      }
    },
    {
      "id": "202-5A1-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "202-5A1-INT-1",
            "questionText": "How do magnetic field lines determine the physical interaction between two permanent magnets? In your answer, include: (1) the direction of magnetic flux lines, (2) the principle of attraction between opposite poles, and (3) how flux lines behave during repulsion. (2-3 sentences)",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "Magnetic flux lines always travel from the North pole to the South pole. Attraction occurs when opposite poles are placed together and flux lines join, while repulsion occurs between like poles because the flux lines cannot cross and instead push against each other.",
              "Flux lines flow from North to South; when opposite poles meet, these lines connect to create a force of attraction. Conversely, like poles cause repulsion because their flux lines are forced to bend away from one another rather than joining."
            ],
            "hint": "Think about the direction flux lines travel and what happens when those lines from two different magnets meet."
          },
          {
            "id": "202-5A1-INT-2",
            "questionText": "Explain how the total magnetic field and its concentration relate to the physical forces observed between magnets. In your answer, include: (1) the definition of magnetic flux and its unit, (2) the definition of flux density and its unit, (3) how flux lines create attraction or repulsion, and (4) the difference between total field strength and concentration. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": [
              "Magnetic flux is the total number of field lines measured in Webers (Wb), while flux density is the concentration of those lines per unit area measured in Teslas (T). These flux lines flow from North to South, causing attraction when opposite poles join their lines together or repulsion when like poles force lines apart. While flux measures the total magnetic field, flux density describes how strong or concentrated that field is in a specific part of the circuit.",
              "1. Magnetic flux is the total field measured in Webers (Wb). 2. Flux density is the concentration of flux measured in Teslas (T). 3. Attraction happens when flux lines from opposite poles connect, while repulsion happens when lines from like poles push away. 4. Flux represents the whole quantity of magnetism, whereas flux density identifies how 'packed' the magnetism is in a given area."
            ],
            "hint": "Consider both the quantity of the magnetic field and how that field's flow direction results in mechanical movement."
          }
        ]
      }
    },
    {
      "id": "202-5A1-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "202-5A1-SR-1",
            "questionText": "What is the standard unit of measurement for electric current?",
            "expectedAnswer": [
              "Ampere",
              "Amps",
              "Amp",
              "Amperes"
            ],
            "hint": "It is represented by the symbol 'A'.",
            "answerType": "short-text"
          },
          {
            "id": "202-5A1-SR-2",
            "questionText": "What is the unit of measurement for electrical Potential Difference?",
            "expectedAnswer": [
              "Volt",
              "Volts",
              "V"
            ],
            "hint": "This is often referred to as voltage.",
            "answerType": "short-text"
          },
          {
            "id": "202-5A1-SR-3",
            "questionText": "Which negatively charged subatomic particles flow through a conductor to create an electric current?",
            "expectedAnswer": [
              "Electrons",
              "Electron"
            ],
            "hint": "These particles orbit the nucleus of an atom.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Magnetism basics "
      }
    }
  ],
  "metadata": {
    "created": "2026-02-10",
    "updated": "2026-02-10",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}