{
  "id": "203-3A4",
  "title": "203.3A4 — Circuit Types: What They Do",
  "description": "Learn about Circuit Types: What They Do in Electrical Installations Technology",
  "layout": "split-vis",
  "unit": "Unit 203",
  "topic": "Circuit Types: What They Do",
  "learningOutcomes": [
    "Identify common functional circuit types within an electrical installation.",
    "Explain the specific purposes and typical use cases for power, lighting, and auxiliary circuits.",
    "Compare the principles of ring final and radial circuit arrangements."
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "203-3A4-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify common functional circuit types within an electrical installation.",
            "bloomLevel": "remember"
          },
          {
            "text": "Explain the specific purposes and typical use cases for power, lighting, and auxiliary circuits.",
            "bloomLevel": "understand"
          },
          {
            "text": "Compare the principles of ring final and radial circuit arrangements.",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "203-3A4-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Radial Circuit",
            "definition": "A circuit arrangement where the cable originates at the distribution board and runs to each point in turn, ending at the final outlet."
          },
          {
            "term": "Ring Final Circuit",
            "definition": "A circuit that forms a continuous loop by starting at the consumer unit, connecting to each socket-outlet, and returning to the same protective device."
          },
          {
            "term": "Functional Circuit",
            "definition": "An electrical circuit classified by its specific intended use, such as lighting, power, or heating."
          },
          {
            "term": "Auxiliary Circuit",
            "definition": "A secondary circuit designed for non-power functions such as fire alarms, emergency signals, or data control systems."
          },
          {
            "term": "Circuit Topology",
            "definition": "The specific physical layout or configuration of conductors that determines the path of electrical current within an installation."
          }
        ]
      }
    },
    {
      "id": "203-3A4-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Circuit Types: What They Do Diagram",
        "description": "Visual representation of Circuit Types: What They Do",
        "videoUrl": "",
        "diagramType": "circuit",
        "elementIds": [
          "Radial Circuit",
          "Ring Final Circuit",
          "Consumer Unit",
          "Socket-Outlet",
          "Lighting Point"
        ],
        "placeholderText": "A comparative layout diagram showing two rooms. Room A illustrates a Radial Circuit: a single line originates from the Consumer Unit, travels to three Lighting Points in a sequence, and ends at the final point. Room B illustrates a Ring Final Circuit: two cables leave the Consumer Unit from the same protective device, travel around the perimeter connecting multiple Socket-Outlets, and both return to the same starting point in the Consumer Unit to form a loop. Labels should clearly distinguish the 'single path' of the radial versus the 'dual path' of the ring."
      }
    },
    {
      "id": "203-3A4-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Functional Circuit Classifications",
        "content": "1. **What this is**: A **Functional Circuit** is an electrical circuit classified by its specific intended use within an installation. Rather than focusing solely on the wiring method, this classification defines what the circuit does, such as providing illumination, powering appliances, or managing safety systems. By categorizing circuits by function, electricians can ensure that the electrical system is organized, manageable, and safe for the end user.\n\n2. **Why it matters**: Identifying and separating circuits by function is critical for the safety and convenience of an installation. If a fault occurs on a power circuit, for example, it should not typically cause the lighting circuits to fail, which could leave occupants in the dark. Furthermore, different functional loads have different electrical characteristics; a heating element requires a very different level of protection and cable sizing than a data communication line or a smoke alarm system.\n\n3. **Key facts / rules**:\n- Lighting Circuits: Typically serve fixed luminaires and are often protected by 6A or 10A circuit breakers.\n- Power Circuits: Commonly serve socket-outlets for portable appliances or fixed equipment like washing machines.\n- Heating Circuits: Designed for high-current loads such as electric showers, immersion heaters, or space heating systems.\n- **Auxiliary Circuit**: A secondary circuit designed for non-power functions such as fire alarms, emergency signals, or data control systems.\n- Data and Control Circuits: Used for telecommunications, smart home automation, and signaling between devices.\n- IET On-Site Guide recommends the segregation of certain functional circuits to prevent electrical interference, particularly between power and data lines.\n\n4. **How to apply it**: When selecting a **Functional Circuit** type for a new installation, follow a systematic decision process based on the load requirements. First, identify the total current demand of the equipment. For high-load items like an electric cooker or shower, a dedicated power or heating circuit is typically selected to prevent overloading. Second, consider the reliability needs; emergency lighting and fire alarms are often placed on their own dedicated **Auxiliary Circuit** to ensure they remain operational even if other circuits fail. Finally, group similar loads together. For instance, in a domestic setting, it is common practice to have separate lighting circuits for different floors to ensure that a single fault does not disable all lights in the property. This selection process ensures the installation is divided into enough circuits to avoid danger and minimize inconvenience in the event of a fault.\n\n5. **Common mistakes**: A frequent error is mixing different functional loads on the same circuit, such as connecting a high-power heater to a lighting circuit. This usually leads to nuisance tripping of the protective device. Another mistake is failing to correctly identify an **Auxiliary Circuit**, which might lead to it being inadvertently isolated during routine maintenance of power circuits, potentially disabling critical safety systems like smoke detectors.\n\n6. **Quick recap**: A **Functional Circuit** is defined by its purpose, such as lighting, power, or heating. This classification includes the **Auxiliary Circuit**, which handles secondary tasks like alarms and data. Properly selecting and separating these circuits ensures that faults are localized, loads are safely managed, and critical safety systems remain functional even when primary power circuits are interrupted."
      }
    },
    {
      "id": "203-3A4-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Functional Circuit Classifications",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3A4-C1-L1-A",
            "questionText": "What is the definition of a Functional Circuit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "electrical circuit classified by its specific intended use",
              "circuit classified by its specific intended use",
              "circuit classified by its intended use",
              "an electrical circuit classified by its specific intended use"
            ],
            "hint": "Look at the first paragraph of the explanation for the definition."
          },
          {
            "id": "203-3A4-C1-L1-B",
            "questionText": "State the purpose of an Auxiliary Circuit.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "non-power functions such as fire alarms, emergency signals, or data control systems",
              "secondary circuit designed for non-power functions",
              "secondary tasks like alarms and data",
              "non-power functions such as fire alarms"
            ],
            "hint": "This circuit handles secondary tasks rather than primary power."
          },
          {
            "id": "203-3A4-C1-L1-C",
            "questionText": "What type of circuit should be selected for high-load items like an electric cooker or shower?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "dedicated power or heating circuit",
              "a dedicated power or heating circuit",
              "dedicated power or heating circuit to prevent overloading",
              "dedicated heating circuit"
            ],
            "hint": "High-current loads require a specific type of dedicated circuit to prevent overloading."
          },
          {
            "id": "203-3A4-C1-L2",
            "questionText": "Using your answers to Q1 (Functional Circuit definition), Q2 (Auxiliary Circuit purpose), and Q3 (high-load selection), explain how these classifications help an electrician organize a safe system.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "Classifying by specific intended use and using an Auxiliary Circuit for non-power functions, combined with a dedicated power or heating circuit for high-load items, ensures the system is organized and safe.",
              "By defining circuits by intended use, using an auxiliary circuit for secondary tasks, and selecting dedicated circuits for high loads, the installation avoids danger and minimizes inconvenience."
            ],
            "hint": "Think about how separating specific uses, secondary tasks, and high loads prevents faults from affecting the whole system."
          }
        ]
      }
    },
    {
      "id": "203-3A4-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Circuit Topologies: Ring vs Radial",
        "content": "1. **What this is**: **Circuit Topology** refers to the specific physical layout or configuration of conductors that determines the path of electrical current within an installation. In UK electrical systems, the two primary topologies used for final circuits are the **Radial Circuit** and the **Ring Final Circuit**. While both deliver power to outlets, they do so using different wiring paths and connection methods.\n\n2. **Why it matters**: The choice of **Circuit Topology** affects the amount of cable required, the ease of installation, and the electrical characteristics of the circuit. For example, a ring configuration allows for a higher current carrying capacity using smaller cables because the current has two paths to reach any point. Conversely, a radial configuration is simpler to install and test, making it ideal for specific types of loads or smaller areas.\n\n3. **Key facts / rules**:\n- **Radial Circuit**: A circuit arrangement where the cable originates at the distribution board and runs to each point in turn, ending at the final outlet.\n- **Ring Final Circuit**: A circuit that forms a continuous loop by starting at the consumer unit, connecting to each socket-outlet, and returning to the same protective device.\n- Current Path: In a radial, there is one path; in a ring, there are two paths in parallel.\n- Cable Sizing: Ring circuits typically use 2.5mm² conductors protected by a 30A or 32A device.\n- Floor Area: IET On-Site Guide Table 7.1(i) indicates that a standard 32A **Ring Final Circuit** can typically serve a floor area of up to 100m².\n- Radial Limits: A 20A **Radial Circuit** using 2.5mm² cable is commonly limited to a floor area of 50m².\n\n4. **How to apply it**: To choose the correct **Circuit Topology**, evaluate the physical environment and the anticipated load. Select a **Ring Final Circuit** when wiring a large room or an entire floor where many socket-outlets are required; this is the most efficient way to provide high power capacity over a large area (up to 100m²). Choose a **Radial Circuit** for dedicated appliances that require their own circuit, such as a washing machine or a dishwasher, or for small rooms where the distance from the distribution board is short. For lighting, a **Radial Circuit** is almost always the standard choice because the current demand is relatively low. When applying these topologies, ensure the protective device is matched to the cable size and the expected load according to the guidance in the IET On-Site Guide.\n\n5. **Common mistakes**: The most critical mistake in a **Ring Final Circuit** is the 'broken ring,' where the loop is interrupted, turning it into two radials fed by a single high-rating breaker. This can lead to cable overheating. In a **Radial Circuit**, a common error is adding too many points of use, which can exceed the current carrying capacity of the single cable run. Students also often forget that the ends of the ring must both be securely terminated into the same terminal at the protective device to maintain the loop.\n\n6. **Quick recap**: **Circuit Topology** defines the wiring layout. A **Radial Circuit** follows a linear path from the source to the last outlet, while a **Ring Final Circuit** forms a complete loop back to the source. Rings are typically used for large areas with many sockets, while radials are used for lighting and dedicated high-power appliances. Proper selection depends on the floor area, the expected load, and the need for circuit independence."
      }
    },
    {
      "id": "203-3A4-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Circuit Topologies: Ring vs Radial",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3A4-C2-L1-A",
            "questionText": "Describe the physical layout of a Radial Circuit.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "cable originates at the distribution board and runs to each point in turn, ending at the final outlet",
              "linear path from the source to the last outlet",
              "runs to each point in turn, ending at the final outlet",
              "linear path from the source to the final outlet"
            ],
            "hint": "Think about the path the cable takes from the source to the end."
          },
          {
            "id": "203-3A4-C2-L1-B",
            "questionText": "What configuration identifies a Ring Final Circuit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "forms a continuous loop by starting at the consumer unit, connecting to each socket-outlet, and returning to the same protective device",
              "circuit that forms a complete loop back to the source",
              "forms a continuous loop",
              "starts at the consumer unit and returns to the same protective device"
            ],
            "hint": "This topology returns to where it started."
          },
          {
            "id": "203-3A4-C2-L1-C",
            "questionText": "According to the IET On-Site Guide, what is the maximum floor area a 32A Ring Final Circuit can serve?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "100m²",
              "100 square metres",
              "100 m2",
              "up to 100m²"
            ],
            "hint": "Look for the numerical limit mentioned in Table 7.1(i)."
          },
          {
            "id": "203-3A4-C2-L2",
            "questionText": "Using your answers to Q1 (Radial Circuit path), Q2 (Ring Final Circuit loop), and Q3 (32A Ring floor area), explain how the physical layout of conductors determines the appropriate topology for an area.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "A Radial Circuit uses a linear path to the final outlet for simple loads, whereas a Ring Final Circuit forms a continuous loop which enables it to serve a larger floor area of up to 100m² efficiently.",
              "The linear path of a radial is for specific appliances while the continuous loop of a ring allows for a higher capacity over a floor area of 100m²."
            ],
            "hint": "Compare how the linear path versus the loop path affects the capacity and the size of the area being served."
          }
        ]
      }
    },
    {
      "id": "203-3A4-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "203-3A4-P1",
            "questionText": "A designer is planning a standard 32A Ring Final Circuit for a domestic installation. According to the IET On-Site Guide, what is the maximum floor area in square metres that this circuit can serve? (Round to the nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "100",
              "100.0"
            ],
            "hint": "Square metres (m²)"
          },
          {
            "id": "203-3A4-P2",
            "questionText": "An electrician installs a 20A Radial Circuit using 2.5mm² cable to serve a small room. What is the maximum recommended floor area in square metres for this specific circuit topology? (Round to the nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "50",
              "50.0"
            ],
            "hint": "Square metres (m²)"
          },
          {
            "id": "203-3A4-P3",
            "questionText": "Which classification of functional circuit is specifically used for secondary tasks such as fire alarms, emergency signals, or data control systems?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Auxiliary Circuit",
              "an Auxiliary Circuit",
              "Auxiliary"
            ],
            "hint": "This circuit handles non-power functions and signaling."
          },
          {
            "id": "203-3A4-P4",
            "questionText": "What term refers to the specific physical layout or configuration of conductors, such as a loop or a linear run, that determines the path of electrical current?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Circuit Topology",
              "the Circuit Topology",
              "Topology"
            ],
            "hint": "This defines the wiring path within an installation."
          },
          {
            "id": "203-3A4-P5",
            "questionText": "Identify the circuit topology that forms a continuous loop by starting at the consumer unit, connecting to each socket-outlet, and returning to the same protective device.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Ring Final Circuit",
              "a Ring Final Circuit",
              "Ring Final"
            ],
            "hint": "This configuration allows current to flow in two paths to reach an outlet."
          }
        ]
      }
    },
    {
      "id": "203-3A4-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "203-3A4-INT-1",
            "questionText": "How does the intended functional classification of a circuit, such as a power or lighting circuit, influence the selection of a specific circuit topology like ring or radial? (2-3 sentences)",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "The functional classification determines the expected electrical load and device types, which dictates whether a ring topology is needed for high-demand socket outlets or if a radial topology is more appropriate for simpler lighting runs. By matching the topology to the function, the electrician ensures the wiring path can safely handle the current demand of that specific circuit type.",
              "Electricians select a topology based on the circuit's function because power-heavy circuits often require the current-sharing capabilities of a ring final circuit, whereas lighting or auxiliary circuits are more efficiently served by the straightforward path of a radial circuit."
            ],
            "hint": "Consider how the power requirements of different functional types dictate the physical layout of the conductors."
          },
          {
            "id": "203-3A4-INT-2",
            "questionText": "Provide a comprehensive explanation of how an electrician uses functional circuit classifications and circuit topologies together to design a safe and effective electrical system. Please ensure your response is 3-4 sentences long.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": [
              "An electrician begins by categorizing circuits into functional types like power, lighting, or auxiliary to understand the specific needs and safety requirements of each load. They then apply the most suitable topology, typically utilizing ring final circuits for high-density socket areas to distribute load and radial circuits for dedicated appliances or illumination. This integrated approach ensures the installation is logically organized, complies with safety regulations, and provides a physical wiring structure that can handle the intended electrical use of the building.",
              "Designing a system requires identifying the functional purpose of each circuit—such as providing power to appliances or managing auxiliary systems—before choosing between a ring or radial topology. By selecting a ring topology for general power circuits and radial paths for lighting, the electrician creates a balanced system that optimizes material use while maintaining circuit integrity. Ultimately, this synthesis of classification and layout results in a manageable and safe electrical environment for the end user."
            ],
            "hint": "Reflect on the step-by-step process of moving from the purpose of a circuit (function) to the physical wiring method (topology)."
          }
        ]
      }
    },
    {
      "id": "203-3A4-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Spaced Review (from prerequisites)",
        "questions": [],
        "notes": "No prerequisites for this foundational lesson"
      }
    }
  ],
  "metadata": {
    "created": "2026-02-05",
    "updated": "2026-02-05",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}