{
  "id": "203-3E1111",
  "title": "203.3E1111 — Specialised Installing Equipment",
  "description": "Learn about Specialised Installing Equipment in Electrical Installations Technology",
  "layout": "split-vis",
  "unit": "Unit 203",
  "topic": "Specialised Installing Equipment",
  "learningOutcomes": [
    "Identify common specialised installation equipment used for conduit and cable tray systems",
    "Describe the purpose and application of conduit benders, tray benders, and formers",
    "Explain the intended use of stocks and dies in the installation process"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "203-3E1111-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify common specialised installation equipment used for conduit and cable tray systems",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the purpose and application of conduit benders, tray benders, and formers",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the intended use of stocks and dies in the installation process",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "203-3E1111-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Conduit Bender",
            "definition": "A mechanical tool used to create precise angles, offsets, and saddles in metal or plastic conduit."
          },
          {
            "term": "Former",
            "definition": "A curved component within a bender that determines the radius of the bend and supports the conduit to prevent kinking."
          },
          {
            "term": "Stocks and Dies",
            "definition": "A tool set used to manually cut external screw threads onto the ends of steel conduit for joining components together."
          },
          {
            "term": "Tray Bender",
            "definition": "A specialized tool designed to create accurate, uniform folds in cable tray sections for navigating corners or obstacles."
          },
          {
            "term": "Cutting Compound",
            "definition": "A lubricant applied during the threading process to reduce heat and ensure a clean, sharp thread is produced on the conduit."
          }
        ]
      }
    },
    {
      "id": "203-3E1111-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Specialised Installing Equipment Diagram",
        "description": "Visual representation of Specialised Installing Equipment",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "Conduit Bender",
          "Former",
          "Stocks and Dies",
          "Tray Bender",
          "Cutting Compound"
        ],
        "placeholderText": "The diagram should feature an isometric view of a workshop floor. In the center, show a floor-standing Conduit Bender with a 20mm Former clearly labeled and installed in the head. To the right, show a set of Stocks and Dies inside an open carry case, with one die held in the stock. Next to the case, place a tin of Cutting Compound with a small brush. On the left side of the diagram, show a Tray Bender positioned against a section of 150mm wide perforated cable tray, illustrating how the tool aligns with the tray's side rail. All labels should use the exact vocabulary terms and be connected to the items with clear leader lines."
      }
    },
    {
      "id": "203-3E1111-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Bending Equipment and Formers",
        "content": "1. **What this is**\n\nIn electrical containment installation, specialized tools are required to manipulate the shape of metallic and plastic enclosures. A **Conduit Bender** is a mechanical, floor-standing or bench-mounted tool designed to create precise, repeatable shapes in steel or heavy-duty plastic conduit. A vital part of this tool is the **Former**, a precision-machined curved block that the conduit rests against. For cable management systems involving perforated metal, a **Tray Bender** is a specialized hand tool or bench-mounted device used to create uniform, professional folds in cable tray sections. These tools collectively ensure that the containment system can navigate the physical geometry of a building while maintaining its structural and protective properties.\n\n2. **Why it matters**\n\nThis equipment is essential for both the safety and the aesthetics of an electrical installation. Without a **Conduit Bender**, an installer would be unable to create the 90-degree bends, offsets, and saddles required to follow the lines of a wall or bypass an obstacle. Using the correct **Former** ensures that the conduit is supported during the bending action, which prevents the material from kinking, flattening, or collapsing. This matters because a collapsed conduit reduces the internal cross-sectional area, making cable drawing difficult and potentially damaging the cable insulation. Similarly, a **Tray Bender** ensures that cable tray remains smooth and free of sharp edges, protecting the cables that will eventually lie within it.\n\n3. **Key facts / rules**\n\n*   **LO1 & LO2 Identification**: A **Conduit Bender** is used for steel and heavy-gauge PVC conduit; a **Tray Bender** is for cable tray only.\n*   **Former** Selection: The size of the **Former** must match the outside diameter (OD) of the conduit (e.g., 20mm, 25mm, or 32mm).\n*   Radius Control: The **Former** determines the fixed radius of the bend to ensure it meets industry standards for cable protection.\n*   Aesthetic Consistency: Specialized benders allow for multiple identical bends, which is a requirement for professional-grade containment runs.\n*   Material Specificity: Steel conduit requires the mechanical advantage of a floor-standing bender, whereas light-gauge plastic conduit may only require a bending spring.\n\n4. **When to choose it**\n\nSelection of a **Conduit Bender** is necessary whenever an installation plan requires steel conduit to change direction or elevation. It is the primary choice for industrial and commercial environments where mechanical protection is a priority. An installer chooses a specific **Former** based on the conduit size being installed—using a 25mm **Former** for 20mm conduit would result in a flattened, unsafe bend. A **Tray Bender** is selected when the installation involves cable tray that must pass over ceiling beams, around pillars, or through floor penetrations. It is chosen over manual improvised folding because it ensures the galvanised coating of the tray is not excessively stressed or cracked, which prevents future corrosion.\n\n5. **Common mistakes**\n\nStudents often attempt to use a **Former** that is the wrong size for the conduit, leading to poor-quality bends and material failure. Another frequent error is failing to account for the 'gain' or 'take-off' of the **Former**, resulting in bends that do not line up with the intended entry points of accessory boxes. Many also confuse the purpose of a **Conduit Bender** with that of a **Tray Bender**, incorrectly assuming one tool can perform the function of the other. Finally, neglecting to check that the **Former** is free of debris can lead to scoring or marking of the conduit surface, which ruins the professional finish.\n\n6. **Quick recap**\n\nSpecialized bending equipment, including the **Conduit Bender**, **Tray Bender**, and specific **Formers**, is used to shape electrical containment systems. These tools are identified by their ability to provide uniform support to the material, ensuring that the internal area of the conduit or tray remains unobstructed. Selecting the correct tool and matching the **Former** to the conduit size is essential for maintaining the integrity of the installation and providing a high-quality, professional finish that protects the cables within."
      }
    },
    {
      "id": "203-3E1111-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Bending Equipment and Formers",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1111-C1-L1-A",
            "questionText": "What is a Conduit Bender used for in electrical containment installation?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "to create precise shapes in steel or heavy-duty plastic conduit",
              "creating 90-degree bends, offsets, and saddles",
              "to manipulate the shape of metallic and plastic enclosures",
              "shaping steel and heavy-gauge PVC conduit"
            ],
            "hint": "Look at the 'What this is' and 'Why it matters' sections for the specific shapes it creates."
          },
          {
            "id": "203-3E1111-C1-L1-B",
            "questionText": "What is the purpose of selecting a Former that matches the outside diameter of the conduit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "prevents the material from kinking, flattening, or collapsing",
              "ensures that the conduit is supported",
              "maintaining the internal cross-sectional area",
              "ensures the conduit is supported during the bending action"
            ],
            "hint": "Consider what happens to the conduit material if it is not correctly supported."
          },
          {
            "id": "203-3E1111-C1-L1-C",
            "questionText": "Identify the specialized tool used to create uniform folds in perforated metal cable tray sections.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Tray Bender",
              "A Tray Bender",
              "the tray bender",
              "cable tray bender"
            ],
            "hint": "This tool is used specifically for cable tray, not conduit."
          },
          {
            "id": "203-3E1111-C1-L2",
            "questionText": "Using your answers to Q1 (Conduit Bender), Q2 (Former selection), and Q3 (Tray Bender), explain how these tools work together to ensure a professional installation.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "Conduit and tray benders allow the system to navigate building geometry, while the correct former prevents material collapse, ensuring the installation protects the cables within.",
              "The conduit bender and tray bender create the necessary shapes to bypass obstacles, while the former ensures the conduit does not kink or collapse, maintaining a professional finish.",
              "These tools ensure that conduit and tray can navigate a building while the former protects the internal area from collapsing, ensuring cable safety and aesthetics."
            ],
            "hint": "Think about how navigating obstacles (Q1/Q3) and maintaining material integrity (Q2) relate to the final quality of the job."
          }
        ]
      }
    },
    {
      "id": "203-3E1111-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Threading Equipment",
        "content": "1. **What this is**\n\nWhen installing steel conduit, the ends of the pipes must often be joined together or connected to metal boxes. **Stocks and Dies** are the specialized tools used to create these external screw threads on the ends of the conduit. The 'die' is the cutting component that forms the thread, while the 'stock' is the handle or frame that holds the die. To ensure the cutting action is efficient and the resulting threads are clean, **Cutting Compound** is used. This is a thick, oily lubricant specifically formulated for metal-cutting applications to manage heat and friction.\n\n2. **Why it matters**\n\nIn a steel conduit system, the mechanical joints are not just for structural support; they also provide the path for earth continuity. The use of **Stocks and Dies** allows the installer to create a bespoke, threaded connection that provides a low-resistance electrical path. This is vital for the safety of the installation, as the metallic containment often acts as part of the fault protection system. Without the application of **Cutting Compound**, the die would quickly become dull, and the threads would be ragged or torn. Poor-quality threads result in loose joints, which compromise both the mechanical strength and the electrical continuity of the entire containment run.\n\n3. **Key facts / rules**\n\n*   **LO3 Intended Use**: **Stocks and Dies** are used exclusively for creating external threads on steel conduit lengths.\n*   Standard Sizes: Dies are available in common UK conduit sizes, typically 20mm, 25mm, and 32mm.\n*   **Cutting Compound** Role: Its primary purpose is the reduction of heat and the preservation of the cutting edges on the die.\n*   Electrical Continuity: Threaded joints are the preferred method for ensuring a continuous metallic path for earthing.\n*   Bespoke Lengths: This equipment allows for the creation of custom conduit lengths on-site, rather than relying solely on pre-manufactured lengths.\n\n4. **When to choose it**\n\n**Stocks and Dies** are selected whenever a length of steel conduit has been cut to size and requires a new threaded end for connection to a coupler, a bend, or a circular box. This is a daily requirement in industrial installations where conduit must be tailored to fit specific architectural features. The selection of **Cutting Compound** is mandatory every time the **Stocks and Dies** are used; it is never an optional extra. Choosing the correct die size is straightforward, as it must match the diameter of the conduit being installed. This equipment is the only appropriate choice for creating the high-torque, vibration-resistant joints required in heavy-duty electrical environments.\n\n5. **Common mistakes**\n\nA very common mistake is the failure to use enough **Cutting Compound**, which leads to 'galled' or stripped threads that cannot be tightened. Students also frequently forget to clear the metal shavings from the die, which can cause the tool to jam or produce uneven threads. Another error is selecting the wrong die for the conduit size, which can permanently damage the end of the conduit. Finally, some installers fail to realize that the quality of the thread directly affects the earth fault loop impedance of the circuit; a poorly threaded joint is a significant safety hazard.\n\n6. **Quick recap**\n\n**Stocks and Dies** are the essential tools for creating external threads on steel conduit, enabling secure mechanical and electrical connections. The use of **Cutting Compound** is a critical part of this activity, as it protects the tools and ensures the threads are sharp and functional. By correctly identifying and using this equipment, an electrician ensures that the containment system is both structurally sound and capable of providing the necessary earth continuity for a safe installation."
      }
    },
    {
      "id": "203-3E1111-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Threading Equipment",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1111-C2-L1-A",
            "questionText": "What is the intended use of Stocks and Dies for steel conduit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "creating external screw threads",
              "to form external screw threads on the ends of the conduit",
              "creating bespoke threaded connections",
              "forming external screw threads"
            ],
            "hint": "Check the 'What this is' section for the specific type of connection these tools create."
          },
          {
            "id": "203-3E1111-C2-L1-B",
            "questionText": "State the primary purpose of Cutting Compound when used with stocks and dies.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "reduction of heat and the preservation of the cutting edges",
              "to manage heat and friction",
              "reduction of heat",
              "preserving the cutting edges",
              "preservation of the cutting edges on the die"
            ],
            "hint": "Look at the 'Key facts' section for the role of this oily lubricant."
          },
          {
            "id": "203-3E1111-C2-L1-C",
            "questionText": "What does a high-quality threaded joint provide for the safety of a metallic containment system?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "provide a low-resistance electrical path",
              "provide the path for earth continuity",
              "part of the fault protection system",
              "a low-resistance electrical path"
            ],
            "hint": "The metallic containment often acts as part of the fault protection system."
          },
          {
            "id": "203-3E1111-C2-L2",
            "questionText": "Using your answers to Q1 (Stocks and Dies), Q2 (Cutting Compound), and Q3 (Earth Continuity), explain how these elements combine to create a safe installation.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "Stocks and dies create the screw threads, while cutting compound ensures they are clean and sharp, which allows the joints to provide the necessary earth continuity for safety.",
              "The cutting compound preserves the dies used to create threads, resulting in high-quality joints that ensure a low-resistance electrical path for earth continuity.",
              "By using stocks, dies, and cutting compound to create clean threaded connections, the installer ensures the containment system has the mechanical strength and electrical continuity required for safety."
            ],
            "hint": "Connect the tool (Q1) and the lubricant (Q2) to the final electrical requirement (Q3)."
          }
        ]
      }
    },
    {
      "id": "203-3E1111-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "203-3E1111-P1",
            "questionText": "Which specialized tool is appropriate for creating uniform, professional folds in perforated cable tray sections?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Tray Bender",
              "The Tray Bender",
              "A Tray Bender",
              "Cable Tray Bender",
              "The Cable Tray Bender",
              "Cable Tray Benders"
            ],
            "hint": "A tool designed specifically for tray, not conduit."
          },
          {
            "id": "203-3E1111-P2",
            "questionText": "A conduit bender is being used for a commercial installation. If the steel conduit has an outside diameter of 25mm, what size Former must be selected for the task? (Round to the nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "25",
              "25.0"
            ],
            "hint": "The former size must match the outside diameter of the conduit (mm)."
          },
          {
            "id": "203-3E1111-P3",
            "questionText": "State the primary purpose of the Former within a conduit bending machine.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Prevent kinking",
              "Determine the radius",
              "Support the conduit",
              "Maintain the internal area",
              "Prevent flattening",
              "Control the bend radius",
              "Prevents kinking",
              "Supports the conduit"
            ],
            "hint": "Consider how the tool maintains the shape and safety of the conduit during a bend."
          },
          {
            "id": "203-3E1111-P4",
            "questionText": "Which equipment is required to create the external screw threads on steel conduit to ensure mechanical and electrical continuity?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Stocks and Dies",
              "Stock and Die",
              "The Stocks and Dies",
              "Conduit Stocks and Dies",
              "A Stock and Die",
              "Stocks and Die set"
            ],
            "hint": "A two-part tool set consisting of a cutting component and a frame/handle."
          },
          {
            "id": "203-3E1111-P5",
            "questionText": "Identify the substance required during the conduit threading process to reduce heat and preserve the cutting edges of the tools.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Cutting Compound",
              "The Cutting Compound",
              "A Cutting Compound",
              "Cutting Compounds",
              "Metal cutting compound",
              "Thread cutting compound"
            ],
            "hint": "This is a thick, oily lubricant specifically for metal-cutting."
          }
        ]
      }
    },
    {
      "id": "203-3E1111-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1111-INT-1",
            "questionText": "How do the roles of a conduit bender and a set of stocks and dies differ yet complement each other when preparing a run of heavy-gauge steel conduit? (2-3 sentences)",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "A conduit bender is used to physically manipulate the shape of the conduit to navigate the building's structure, while stocks and dies are used to create the threads necessary to join those shaped sections together. Together, they allow an installer to create a continuous, mechanically sound containment run that fits the specific environment.",
              "While the bender and former allow for the creation of precise angles and offsets, the stocks and dies provide the means to connect these custom-shaped pipes to boxes and other lengths of conduit. Both are essential because one provides the path of the run and the other provides the mechanical integrity of the joints."
            ],
            "hint": "Think about the difference between changing the shape of the pipe and preparing the ends for connection."
          },
          {
            "id": "203-3E1111-INT-2",
            "questionText": "Provide a comprehensive explanation of how specialized installation equipment, including benders, formers, and threading tools, are used together to create a complete and secure containment system. Describe how the former and the use of cutting compound specifically contribute to the integrity of the final installation. (3-4 sentences)",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": [
              "Installers use conduit and tray benders to route containment systems around obstacles, utilizing specialized formers to ensure the conduit maintains its structural integrity and circular profile throughout the bend. Once the path is formed, stocks and dies are used to cut external threads on conduit ends, a process requiring cutting compound to reduce friction and ensure the resulting threads are clean and burr-free. This integrated approach ensures that the entire system is precisely fitted to the building while maintaining the high-quality mechanical and electrical connections required for safety.",
              "The installation process relies on benders and formers to create accurate shapes without damaging the material, while stocks and dies are used to prepare the ends for secure mechanical coupling. Using the correct former prevents the conduit from kinking or flattening, and applying cutting compound during the threading process ensures the threads are sharp enough to create a tight, conductive joint. By combining these tools and techniques, an electrician ensures the containment system is both aesthetically professional and structurally sound according to industry standards."
            ],
            "hint": "Consider the full workflow from shaping the material to joining the sections, and why specific accessories like formers and compounds are vital for quality."
          }
        ]
      }
    },
    {
      "id": "203-3E1111-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Spaced Review (from prerequisites)",
        "questions": [],
        "notes": "No prerequisites for this foundational lesson"
      }
    }
  ],
  "metadata": {
    "created": "2026-02-04",
    "updated": "2026-02-04",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}