{
  "id": "203-3E1F",
  "title": "203.3E1F — Specialised Installing Equipment",
  "description": "Learn about Specialised Installing Equipment in Electrical Installations Technology",
  "layout": "split-vis",
  "unit": "Unit 203",
  "topic": "Specialised Installing Equipment",
  "learningOutcomes": [
    "Identify specialised equipment used for the installation of conduit and cable tray systems",
    "Describe the specific purpose of conduit benders, stocks and dies, and formers",
    "Relate specific installation tools to their corresponding containment materials"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "203-3E1F-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify specialised equipment used for the installation of conduit and cable tray systems",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the specific purpose of conduit benders, stocks and dies, and formers",
            "bloomLevel": "understand"
          },
          {
            "text": "Relate specific installation tools to their corresponding containment materials",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "203-3E1F-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Conduit Bender",
            "definition": "A mechanical tool used to create accurate bends and offsets in metallic or non-metallic conduit without collapsing the tube walls."
          },
          {
            "term": "Former",
            "definition": "A curved component within a bending machine that determines the radius of the bend while maintaining the conduit's circular profile."
          },
          {
            "term": "Stocks and Dies",
            "definition": "A tool set used to cut external screw threads onto the ends of heavy-gauge steel conduit to facilitate secure mechanical connections."
          },
          {
            "term": "Tray Bender",
            "definition": "A specialized tool designed to create uniform angles and precise offsets in cable tray sections without damaging the material's structural integrity."
          },
          {
            "term": "Pressure Block",
            "definition": "The part of a conduit bender that applies even force against the conduit to prevent rippling or flattening during the bending process."
          }
        ]
      }
    },
    {
      "id": "203-3E1F-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Specialised Installing Equipment Diagram",
        "description": "Visual representation of Specialised Installing Equipment",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "Conduit Bender",
          "Former",
          "Pressure Block",
          "Stocks and Dies",
          "Tray Bender"
        ],
        "placeholderText": "The diagram should feature five distinct illustrations of specialized installation equipment. 1. A floor-standing Conduit Bender showing the frame and leverage handle. 2. A close-up end-on view of a semi-circular Former, labeled to show how it matches the conduit's outside diameter. 3. A Pressure Block positioned as it would be against a section of conduit to show the support it provides. 4. A set of Stocks and Dies, showing the circular die held within the stock handles. 5. A Tray Bender showing its unique wide-jaw design used for shaping cable tray sections. All labels should use the vocabulary terms exactly, and the relationship between the Former and the conduit diameter should be highlighted."
      }
    },
    {
      "id": "203-3E1F-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Bending and Forming Equipment",
        "content": "1. **What this is**\n\nIn the context of electrical installation, bending and forming equipment consists of specialized mechanical tools designed to alter the shape of containment systems. A **Conduit Bender** is a floor-standing or portable mechanical tool used to create accurate bends and offsets in metallic or non-metallic conduit without collapsing the tube walls. Within this machine, the **Former** is a curved component that determines the radius of the bend while maintaining the conduit's circular profile. To ensure the conduit does not ripple or flatten, a **Pressure Block** is used to provide even force against the material. For wider containment systems, a **Tray Bender** is a specialized tool designed to create uniform angles and precise offsets in cable tray sections without damaging the material's structural integrity.\n\n2. **Why it matters**\n\nThe use of correct bending equipment is vital for the professional appearance and functional safety of an installation. When conduit or tray is shaped correctly, it allows for the smooth drawing-in of cables and ensures that the containment fits the contours of the building structure. Without a **Conduit Bender** and the appropriate **Former**, the internal diameter of the conduit might be reduced, which could damage cable insulation during installation. Furthermore, maintaining the structural integrity of a cable tray through a **Tray Bender** ensures the system can support the weight of the cables over its entire lifespan.\n\n3. **Key facts / rules**\n\n*   Common UK conduit sizes covered at this level are 16mm, 20mm, 25mm, and 32mm.\n*   A **Conduit Bender** typically utilizes interchangeable components to accommodate different tube diameters.\n*   The **Former** must match the outside diameter (OD) of the conduit to prevent deformation.\n*   A **Pressure Block** is essential for maintaining the circular cross-section of the conduit during the bending application.\n*   **Tray Benders** are specific to the gauge and width of the cable tray material.\n*   Metallic conduit systems rely on accurate bends to maintain the path for electrical continuity of the metallic containment system.\n\n4. **When to choose it**\n\nSelection of this equipment depends entirely on the containment material and the installation environment. A **Conduit Bender** is the appropriate choice when the installation design requires 20mm or 25mm steel or PVC conduit to navigate corners or obstacles. You would select a specific **Former** based on the size of the conduit; for example, a 20mm former is selected for 20mm conduit. A **Tray Bender** is chosen when the installation involves cable tray and requires a change in direction that cannot be achieved with standard pre-fabricated bends. These tools are preferred when a bespoke angle is necessary to avoid existing services or structural beams. Choosing the correct tool ensures the containment remains robust and suitable for the environment.\n\n5. **Common mistakes**\n\nStudents often identify the wrong size of **Former** for the conduit being used, which leads to the conduit flattening or kinking. Another frequent error is attempting to use a **Conduit Bender** on cable tray, or vice versa, which results in damage to both the tool and the material. There is also a tendency to overlook the importance of the **Pressure Block**, leading to ripples on the inner radius of the bend. In some cases, students may try to shape heavy-gauge steel conduit without a floor-standing bender, which is often unsuccessful due to the force required.\n\n6. **Quick recap**\n\nSpecialized bending equipment like the **Conduit Bender** and **Tray Bender** are essential for creating professional containment runs. By using the correct **Former** and **Pressure Block**, an electrician ensures that conduit maintains its shape and internal capacity. These tools are selected based on the material—whether steel, PVC, or cable tray—and the specific diameter of the containment. Proper identification and selection of this kit are the first steps in ensuring a high-quality installation that protects the cables within."
      }
    },
    {
      "id": "203-3E1F-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Bending and Forming Equipment",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1F-C1-L1-A",
            "questionText": "What is the purpose of a Conduit Bender in electrical installation?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "to create accurate bends and offsets",
              "create accurate bends and offsets in conduit",
              "create accurate bends and offsets without collapsing the tube walls"
            ],
            "hint": "Look at the description of the floor-standing or portable mechanical tool."
          },
          {
            "id": "203-3E1F-C1-L1-B",
            "questionText": "State the purpose of the Former within a bending machine.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "determines the radius of the bend",
              "determines the radius of the bend while maintaining the conduit's circular profile",
              "to determine the radius of the bend"
            ],
            "hint": "This is the curved component inside the machine."
          },
          {
            "id": "203-3E1F-C1-L1-C",
            "questionText": "Identify the component used to provide even force against the material to prevent it from rippling or flattening.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Pressure Block",
              "the Pressure Block",
              "a Pressure Block"
            ],
            "hint": "This part ensures the conduit does not ripple during the bending application."
          },
          {
            "id": "203-3E1F-C1-L2",
            "questionText": "Using your answers to Q1 (Conduit Bender), Q2 (the Former), and Q3 (the Pressure Block), explain how these three elements work together to maintain the conduit's integrity.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "the Conduit Bender uses the Former to set the radius and the Pressure Block to provide even force to prevent collapsing",
              "the Conduit Bender uses a Former to determine the radius and a Pressure Block to maintain the circular cross-section",
              "the Conduit Bender utilizes a Former for the radius and a Pressure Block to ensure the conduit does not ripple or flatten"
            ],
            "hint": "Think about how the machine uses its internal parts to achieve the goal mentioned in Q1."
          }
        ]
      }
    },
    {
      "id": "203-3E1F-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Threading Equipment",
        "content": "1. **What this is**\n\nThreading equipment is used to prepare the ends of heavy-gauge steel conduit for mechanical joining. The primary tool for this task is a set of **Stocks and Dies**. This is a tool set used to cut external screw threads onto the ends of heavy-gauge steel conduit to facilitate reliable mechanical connections. The 'die' is the cutting component that forms the thread, while the 'stock' is the handle assembly that holds the die and provides the necessary leverage. This equipment is specific to metallic systems where a simple push-fit or adhesive connection is insufficient for the environment or the required mechanical strength.\n\n2. **Why it matters**\n\nIn a heavy-gauge steel conduit system, the connections between lengths of conduit and their entry into switchgear or terminal boxes must be exceptionally strong. **Stocks and Dies** allow the installer to create threads that match the internal threads of couplings and boxes. Beyond physical strength, these threaded joints contribute to electrical continuity of the metallic containment system. In many installations, the metallic conduit itself forms part of the fault current path, so the quality of the threads created by the **Stocks and Dies** is critical for safety and the effective operation of protective devices.\n\n3. **Key facts / rules**\n\n*   **Stocks and Dies** are used exclusively with heavy-gauge steel conduit.\n*   The threads produced are typically compatible with standard 20mm, 25mm, or 32mm conduit fittings.\n*   Threaded joints are essential for maintaining the electrical continuity of the metallic containment system.\n*   The die must be the correct size for the conduit's outside diameter (OD).\n*   Industry guidance recommends that threads are cut cleanly to ensure a tight fit with accessories.\n*   Steel conduit systems are often selected for industrial environments where high mechanical protection is needed.\n\n4. **When to choose it**\n\n**Stocks and Dies** are selected when the installation specification calls for heavy-gauge steel conduit. This tool is the correct choice whenever a length of steel conduit has been cut to size and needs to be joined to another length using a coupling, or whenever it needs to enter a conduit box or distribution board. It is the appropriate kit for scenarios where a high level of ingress protection (IP rating) is required, as threaded joints are more effective at preventing the entry of dust and moisture than non-threaded alternatives. You would choose this equipment over PVC solvent-weld tools when the environment demands superior mechanical impact resistance.\n\n5. **Common mistakes**\n\nOne common error is the failure to recognize that **Stocks and Dies** are only for steel conduit and cannot be used on PVC. Students also frequently struggle with identifying the correct die size, attempting to use a 25mm die on 20mm conduit. Another mistake is using worn or damaged dies, which results in 'torn' threads that do not provide a reliable mechanical or electrical connection. Additionally, students sometimes forget that the purpose of the tool is to facilitate a connection that ensures the electrical continuity of the metallic containment system, focusing only on the physical joint rather than the electrical path.\n\n6. **Quick recap**\n\n**Stocks and Dies** are the specialized tools used for cutting external threads on heavy-gauge steel conduit. Their primary purpose is to enable strong mechanical connections and ensure the electrical continuity of the metallic containment system. This equipment is selected for industrial or high-protection environments where steel conduit is the preferred material. Proper selection of the die size to match the conduit diameter is essential for a high-quality installation that meets the requirements for both strength and safety."
      }
    },
    {
      "id": "203-3E1F-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Threading Equipment",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1F-C2-L1-A",
            "questionText": "What is the primary purpose of Stocks and Dies?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "to cut external screw threads",
              "cut external screw threads onto the ends of heavy-gauge steel conduit",
              "to cut external screw threads onto conduit"
            ],
            "hint": "Focus on what this tool set does to the ends of the conduit."
          },
          {
            "id": "203-3E1F-C2-L1-B",
            "questionText": "Identify the specific material that requires the use of Stocks and Dies for mechanical joining.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "heavy-gauge steel conduit",
              "heavy gauge steel conduit",
              "steel conduit"
            ],
            "hint": "This tool is used exclusively with this metallic material."
          },
          {
            "id": "203-3E1F-C2-L1-C",
            "questionText": "What does the use of threaded joints ensure regarding the safety of a metallic containment system?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "electrical continuity",
              "electrical continuity of the metallic containment system",
              "maintains electrical continuity"
            ],
            "hint": "Think about the fault current path mentioned in the text."
          },
          {
            "id": "203-3E1F-C2-L2",
            "questionText": "Using your answers to Q1 (Stocks and Dies), Q2 (heavy-gauge steel conduit), and Q3 (electrical continuity), explain how these aspects relate to the safety of an industrial installation.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "Stocks and Dies cut threads on heavy-gauge steel conduit to create joints that ensure electrical continuity",
              "Stocks and Dies enable threaded joints on heavy-gauge steel conduit which are critical for electrical continuity and safety",
              "using Stocks and Dies on heavy-gauge steel conduit ensures the electrical continuity of the metallic containment system"
            ],
            "hint": "Connect the tool, the material it is used on, and the safety requirement it fulfills."
          }
        ]
      }
    },
    {
      "id": "203-3E1F-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "203-3E1F-P1",
            "questionText": "A conduit bender is designed for several standard UK diameters. According to the text, what is the largest conduit diameter (in mm) typically used at this level? (Round to the nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "32",
              "32.0"
            ],
            "hint": "Answer in millimetres (mm)"
          },
          {
            "id": "203-3E1F-P2",
            "questionText": "An installer is preparing to bend 25mm steel conduit. What size former (in mm) must be selected to prevent the conduit from flattening or kinking? (Round to the nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "25",
              "25.0"
            ],
            "hint": "Answer in millimetres (mm)"
          },
          {
            "id": "203-3E1F-P3",
            "questionText": "Which specific component of a conduit bender is used to apply even force against the material to prevent rippling on the inner radius of the bend?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Pressure Block",
              "the Pressure Block",
              "a Pressure Block"
            ],
            "hint": "This part ensures the conduit does not ripple or flatten."
          },
          {
            "id": "203-3E1F-P4",
            "questionText": "Identify the equipment used to cut external screw threads onto heavy-gauge steel conduit to ensure both mechanical strength and electrical continuity.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Stocks and Dies",
              "Stock and Dies",
              "a set of Stocks and Dies",
              "Stocks & Dies"
            ],
            "hint": "A tool set consisting of a cutting component and a handle assembly."
          },
          {
            "id": "203-3E1F-P5",
            "questionText": "Which specialized tool is appropriate when an installation requires a bespoke angle in a cable tray section to avoid a structural obstacle?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Tray Bender",
              "the Tray Bender",
              "a Tray Bender",
              "Cable Tray Bender"
            ],
            "hint": "This tool is specific to cable tray rather than conduit."
          }
        ]
      }
    },
    {
      "id": "203-3E1F-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1F-INT-1",
            "questionText": "How does the material composition of heavy-gauge steel conduit necessitate the combined use of both conduit benders and stocks and dies during a professional installation? (2-3 sentences)",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "Heavy-gauge steel is a rigid material that requires a conduit bender to create precise angles without collapsing the tube walls. Because this material cannot be joined by simple push-fits, stocks and dies are also required to cut the external threads necessary for secure mechanical connections.",
              "The rigidity of steel conduit requires a mechanical bender to shape the containment and a set of stocks and dies to thread the ends. Together, these tools allow the installer to navigate obstacles and join lengths of conduit into a continuous, secure system."
            ],
            "hint": "Consider why steel requires mechanical force to shape and what specific method is used to join two rigid metal pipes together."
          },
          {
            "id": "203-3E1F-INT-2",
            "questionText": "Explain how the selection of specific formers, the operation of a conduit bender, and the application of stocks and dies work together to complete a professional installation of a steel conduit system. Please provide a comprehensive explanation in 3-4 sentences.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": [
              "A technician begins by selecting the correct former for the conduit bender to ensure the steel is shaped to the required radius without deforming or collapsing the pipe. Once the conduit is accurately formed to navigate the installation route, stocks and dies are used to cut external screw threads onto the ends of the pipe. This integrated process ensures that the heavy-gauge material is both physically routed correctly and mechanically secured to couplings or boxes, maintaining the integrity of the entire containment system.",
              "The installation process requires a conduit bender and a specific former to create accurate offsets and bends while maintaining the internal diameter of the steel tube. Following the bending process, stocks and dies are applied to create the threads needed for joining the rigid sections together. By combining these tools, the installer ensures the steel conduit follows the necessary path and is joined with the mechanical strength required for industrial electrical installations."
            ],
            "hint": "Think about the step-by-step workflow: how you shape the pipe first using the bender's internal components, and how you then prepare the ends for joining."
          }
        ]
      }
    },
    {
      "id": "203-3E1F-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Spaced Review (from prerequisites)",
        "questions": [],
        "notes": "No prerequisites for this foundational lesson"
      }
    }
  ],
  "metadata": {
    "created": "2026-02-04",
    "updated": "2026-02-04",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}