{
  "id": "203-3A123",
  "title": "203.3A123 — Circuit Types: What They Do",
  "description": "Learn about Circuit Types: What They Do in Electrical Installations Technology",
  "layout": "split-vis",
  "unit": "Unit 203",
  "topic": "Circuit Types: What They Do",
  "learningOutcomes": [
    "Identify the different functional categories of circuits used in installations.",
    "Describe the primary purpose and typical application for each circuit type.",
    "Explain the conceptual difference between radial and ring final circuit principles."
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "203-3A123-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the different functional categories of circuits used in installations.",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the primary purpose and typical application for each circuit type.",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the conceptual difference between radial and ring final circuit principles.",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "203-3A123-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Final Circuit",
            "definition": "A circuit connected directly to current-using equipment or socket-outlets, rather than one used to supply a distribution board."
          },
          {
            "term": "Circuit Topology",
            "definition": "The physical arrangement or configuration of wiring that defines how electrical components and points of use are interconnected within a system."
          },
          {
            "term": "Radial Circuit",
            "definition": "A wiring layout where conductors originate at the source and terminate at the last point of use in a single branch, not returning to the start."
          },
          {
            "term": "Ring Final Circuit",
            "definition": "A wiring layout where conductors start at the source and return to the same point to form a continuous loop, different from a radial circuit which has a defined end point."
          },
          {
            "term": "Control Circuit",
            "definition": "A circuit used specifically to manage the operation of other equipment or circuits, distinct from those providing primary power or lighting to a load."
          }
        ]
      }
    },
    {
      "id": "203-3A123-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Circuit Types: What They Do Diagram",
        "description": "Visual representation of Circuit Types: What They Do",
        "videoUrl": "",
        "diagramType": "circuit",
        "elementIds": [
          "source-point",
          "final-circuit-path",
          "load-connection",
          "return-path"
        ],
        "placeholderText": "The diagram should show two side-by-side comparisons of circuit topologies. On the left, a radial circuit originates at a source-point and follows a single final-circuit-path to several load-connection points, ending at the last one. On the right, a ring final circuit originates at the source-point, passes through several load-connection points, and follows a return-path back to the exact same source-point, forming a visible loop. Labels should clearly distinguish the two based on the return path."
      }
    },
    {
      "id": "203-3A123-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Circuit Categories and Applications",
        "content": "### In this lesson\nIn this lesson, you will learn how to identify the different functional categories of circuits used in installations. This knowledge is applied when planning an installation to ensure that different types of electrical loads are separated and managed correctly.\n\n*   Functional categories of circuits.\n*   The specific purposes of lighting, power, and control circuits.\n*   Criteria for selecting a circuit type based on its application.\n\n**What this is**\nIn any technical installation, we must **Identify the different functional categories of circuits used in installations**. These categories are defined by what the circuit does rather than just the wires used. A **Final Circuit** is the end of the line in a distribution system; it is a circuit connected directly to current-using equipment or socket-outlets, rather than one used to supply a distribution board. These circuits are grouped by their specific application, such as lighting, power, heating, or signaling.\n\n**Why it matters**\nSeparating circuits by their function ensures that a fault in one area, like a faulty toaster on a power circuit, does not leave the entire building in the dark by tripping a lighting circuit. It also allows for specific safety measures to be applied to sensitive equipment. For example, a **Control Circuit**—a circuit used specifically to manage the operation of other equipment or circuits—requires different handling than a high-power heating circuit because it carries signals rather than heavy current.\n\n**Key facts / rules**\n*   Lighting circuits are typically dedicated to fixed luminaires.\n*   Power circuits commonly supply socket-outlets for portable appliances.\n*   Heating circuits often serve high-demand fixed equipment like water heaters.\n*   Alarm and emergency circuits must remain functional during specific incidents.\n*   Data and communication circuits carry information rather than significant power.\n*   Control circuits operate switches or relays to trigger larger loads.\n\n**When to choose it**\nYou choose a specific circuit category based on the nature of the load and the required reliability. For instance, you would select a dedicated heating circuit for an electric oven because it requires a consistent, high-current supply that shouldn't be shared with sensitive electronics. Conversely, you would choose a **Control Circuit** when you need to operate a large motor from a remote push-button station safely.\n\n**Concrete Anchor:** Think of circuit categories like the different utility pipes entering a house. You have one pipe for fresh water, one for gas, and one for waste. While they are all \"pipes,\" you would never connect a gas heater to a water pipe. Similarly, you do not connect a high-power heater to a low-power data circuit.\n\n**Micro-scenario:** Consider a scenario where you have a 3,000W electric heater and a 10W emergency exit sign. If you put them on the same circuit, a fault in the heater could disable the exit sign; therefore, you must categorize them into separate power and emergency circuits.\n\n**Common mistakes**\nLearners often confuse a **Control Circuit** with a power circuit; a **Control Circuit** is used to send signals or operate switches, whereas a power circuit is used to deliver the actual energy to do work, such as turning a motor or heating an element.\n\nMisconceptions (targeted):\n*   Misconception: All circuits in a building are the same because they all use copper wire. | Correction: Circuits are categorized by their function and load type to ensure safety and reliability. | AC: AC1\n*   Misconception: A control circuit provides the main power to a machine. | Correction: A control circuit only manages the operation; a separate power circuit provides the energy for the load. | AC: AC2\n\n**Key Points**\n*   Circuits are categorized by function (lighting, power, control, etc.).\n*   A **Final Circuit** feeds the actual equipment or sockets.\n*   Separation of circuits prevents total system failure during a single fault.\n*   **Control Circuits** are for management, not primary power delivery.\n\n**Quick recap**\nTo correctly **Describe the primary purpose and typical application for each circuit type**, you must look at what the equipment needs. Lighting, power, and heating circuits provide energy for specific tasks, while data and control circuits manage information and operations. This separation is the foundation of a safe and functional installation.\n\n### Coming Up Next\nNow that we can identify circuit functions, we will look at **Circuit Topology** to understand how the physical arrangement of the wires changes how power is distributed."
      }
    },
    {
      "id": "203-3A123-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Circuit Categories and Applications",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3A123-C1-L1-A",
            "questionText": "What is the specific term for a circuit that is the end of the line in a distribution system?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Final Circuit",
              "Final circuits",
              "A final circuit"
            ],
            "hint": "This circuit connects directly to current-using equipment or socket-outlets."
          },
          {
            "id": "203-3A123-C1-L1-B",
            "questionText": "Which type of circuit is used specifically to manage the operation of other equipment or circuits?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Control Circuit",
              "Control circuits",
              "A control circuit"
            ],
            "hint": "These circuits carry signals rather than heavy current to do work."
          },
          {
            "id": "203-3A123-C1-L1-C",
            "questionText": "In terms of function, what is the primary purpose of a power circuit compared to a control circuit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Deliver actual energy",
              "Deliver energy",
              "Energy delivery",
              "Deliver energy to work"
            ],
            "hint": "Think about what the circuit actually provides to the equipment to make it function."
          },
          {
            "id": "203-3A123-C1-L2",
            "questionText": "Using your answers to Q1 (Final Circuits), Q2 (Control Circuits), and Q3 (Energy Delivery), explain how these facts connect. Why must we distinguish between signals and work when planning an installation?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Final circuits are categorized by their specific functional application",
              "Control circuits are used for management signals rather than heavy power",
              "Power circuits deliver the energy for work while control circuits trigger them",
              "Separation ensures that faults in energy delivery do not disable management or safety functions"
            ],
            "expectedAnswer": [
              "Final circuits must be categorized by function to ensure safety and reliability. A control circuit is identified specifically for sending signals or managing operations, whereas a power circuit is identified for delivering the actual energy to do work. We separate them so that a fault in a high-power circuit does not interrupt the sensitive signals required for control or emergency systems.",
              "Because final circuits are the end-points for equipment, they are grouped by purpose. Control circuits manage other equipment using signals, while power circuits provide the energy to do work. This relationship is important because it prevents heavy loads from interfering with management systems and ensures that faults are isolated to specific functional categories."
            ],
            "hint": "Consider how identifying the purpose of a final circuit helps in managing faults and choosing the right equipment."
          }
        ]
      }
    },
    {
      "id": "203-3A123-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Circuit Topologies: Radial and Ring",
        "content": "### In this lesson\nIn this lesson, you will learn to **Explain the conceptual difference between radial and ring final circuit principles**. This is essential for understanding how the physical layout of wiring affects the capacity and reliability of an electrical system.\n\n*   Definition of **Circuit Topology**.\n*   The structure of a **Radial Circuit**.\n*   The unique loop characteristics of a **Ring Final Circuit**.\n\n**What this is**\n**Circuit Topology** refers to the physical arrangement or configuration of wiring that defines how electrical components and points of use are interconnected within a system. In electrical installations, we primarily identify two shapes. A **Radial Circuit** is a wiring layout where conductors originate at the source and terminate at the last point of use in a single branch, not returning to the start. In contrast, a **Ring Final Circuit** is a wiring layout where conductors start at the source and return to the same point to form a continuous loop.\n\n**Why it matters**\nThe choice of topology changes how much current the wires can safely carry and how many points of use (like sockets) can be installed. A ring layout allows current to travel in two directions to reach a device, which can effectively increase the capacity of the circuit using thinner wires compared to a single long radial run. Understanding these principles helps in selecting the most efficient layout for a specific floor area or load requirement.\n\n**Key facts / rules**\n*   Radial circuits have a clear beginning and a defined end point.\n*   Ring final circuits must return to the original source to complete the loop.\n*   Radial circuits are commonly used for dedicated high-power loads.\n*   Ring circuits are often used to cover large floor areas with many low-power outlets.\n*   In a radial, if a wire breaks, everything after the break loses power.\n*   In a ring, if a wire breaks at one point, the devices may still receive power from the other side of the loop (though this is a fault condition).\n\n**When to choose it**\nYou should choose a **Radial Circuit** when supplying a single fixed appliance, such as a large oven or a dedicated water heater, because it provides a direct, simple path. You would typically choose a **Ring Final Circuit** when you need to provide power to many socket-outlets across a large room, as the loop allows for a more efficient distribution of current across the conductors.\n\n**Concrete Anchor:** Imagine a garden hose versus a circular irrigation pipe. A **Radial Circuit** is like a standard garden hose: the water goes in one end and comes out the other; if you kink the middle, the end goes dry. A **Ring Final Circuit** is like a circular track with two entrances for water; even if one path is blocked, the water can still reach the sprinklers from the other direction.\n\n**Micro-scenario:** If you have a circuit with 10 sockets spread over a 100-square-meter office, a ring topology might be chosen to share the load across two paths. If you have one single heavy-duty motor in a corner, a radial topology is more appropriate.\n\n**Common mistakes**\nLearners often confuse **Radial Circuit** with **Ring Final Circuit** by assuming any circuit with multiple sockets is a ring; a **Radial Circuit** is a single line that ends, whereas a **Ring Final Circuit** must form a complete, continuous loop back to the source.\n\nMisconceptions (targeted):\n*   Misconception: A ring circuit is just a radial circuit that happens to be long. | Correction: A ring circuit must physically return to its starting point to form a loop; a radial never returns. | AC: AC3\n*   Misconception: You can use any wire size for any topology. | Correction: Topology and conductor size are linked to the expected load and the way current splits in the circuit. | AC: AC3\n\n**Key Points**\n*   **Circuit Topology** is the physical shape of the wiring layout.\n*   Radials are \"point-to-point\" branches with a definite end.\n*   Rings are continuous loops that return to the source.\n*   Topology choice depends on floor area and the number of points of use.\n\n**Quick recap**\nUnderstanding the **Circuit Topology** allows you to **Describe the primary purpose and typical application for each circuit type**. While radials are simple and direct for single loads, rings provide a distributed loop for general-purpose areas. Both are used as a **Final Circuit** to deliver power safely to the end-user.\n\n### Coming Up Next\nNow that you understand the shapes and purposes of circuits, we will explore how to select the correct protection devices to keep these different topologies safe from overloads."
      }
    },
    {
      "id": "203-3A123-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Circuit Topologies: Radial and Ring",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3A123-C2-L1-A",
            "questionText": "Which wiring layout describes a circuit where conductors originate at the source and terminate at the last point of use?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Radial Circuit",
              "Radial",
              "A radial circuit"
            ],
            "hint": "This layout follows a single branch that does not return to the start."
          },
          {
            "id": "203-3A123-C2-L1-B",
            "questionText": "Which wiring layout involves conductors that start at the source and return to the same point to form a loop?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Ring Final Circuit",
              "Ring circuit",
              "Ring"
            ],
            "hint": "This topology allows current to travel in two directions to reach a device."
          },
          {
            "id": "203-3A123-C2-L1-C",
            "questionText": "Based on typical applications, how does the intended load or area influence the choice between a radial or ring circuit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Radials for high-power loads",
              "Rings for large floor areas",
              "Radial fixed loads ring area",
              "Load and floor area"
            ],
            "hint": "Consider whether you are supplying one heavy appliance or many outlets across a room."
          },
          {
            "id": "203-3A123-C2-L2",
            "questionText": "Using your answers to Q1 (Radial layout), Q2 (Ring layout), and Q3 (Typical applications), explain how these facts connect. How do we know which topology is required for a specific installation requirement?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Circuit topology is the physical arrangement that interconnects points of use",
              "Radials are point-to-point branches for dedicated high-power equipment",
              "Rings are continuous loops used for general-purpose outlets over large areas",
              "The choice is determined by whether the installation needs a simple path for one load or a distributed path for many"
            ],
            "expectedAnswer": [
              "We determine the required topology by looking at the load and area. A radial circuit terminates at the last point of use and is chosen for dedicated high-power loads like ovens. A ring final circuit returns to the source to form a loop and is chosen for supplying many outlets across large floor areas. We know which to use by matching the physical wiring shape to the capacity and distribution needs of the room.",
              "The physical arrangement of wiring, known as topology, dictates how power is delivered. If we need to supply a single high-demand appliance, a radial circuit is chosen for its direct branch. If we need to cover a large floor area with multiple sockets, a ring circuit is chosen because its loop configuration allows for more efficient current distribution. The selection depends on the number of points of use and the total power demand."
            ],
            "hint": "Relate the physical shape of the wire (branch vs loop) to the type of equipment or area it needs to serve."
          }
        ]
      }
    },
    {
      "id": "203-3A123-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "203-3A123-P1",
            "questionText": "Based on the micro-scenario provided, how many distinct functional circuit categories are required to ensure a fault in a 3,000W heater does not disable a 10W emergency sign?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2"
            ],
            "hint": "Number of separate circuits needed to isolate power loads from emergency loads."
          },
          {
            "id": "203-3A123-P2",
            "questionText": "How do we know a circuit is categorized as a control circuit rather than a power circuit?",
            "answerType": "short-text",
            "expectedAnswer": [
              "manages operation",
              "carries signals",
              "operates switches",
              "manages equipment"
            ],
            "hint": "Think about whether the circuit provides the primary energy or just the instructions for the load."
          },
          {
            "id": "203-3A123-P3",
            "questionText": "A fluid distribution system is designed where a pipe leaves a pump, visits four separate stations, and then reconnects to the pump intake to form a continuous loop. Which circuit topology does this mimic?",
            "answerType": "short-text",
            "expectedAnswer": [
              "ring final circuit",
              "ring",
              "ring circuit"
            ],
            "hint": "Consider the shape formed when the path returns to the starting source."
          },
          {
            "id": "203-3A123-P4",
            "questionText": "What is the specific term for a circuit that delivers energy directly to the points of use, such as socket-outlets or fixed equipment, rather than supplying a distribution board?",
            "answerType": "short-text",
            "expectedAnswer": [
              "final circuit",
              "final"
            ],
            "hint": "This is the 'end of the line' in a distribution system."
          },
          {
            "id": "203-3A123-P5",
            "questionText": "In a standard radial circuit feeding a single fixed appliance, how many defined end points (terminations) exist for that specific branch?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "Radials originate at a source and terminate at the last point of use without returning."
          }
        ]
      }
    },
    {
      "id": "203-3A123-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "203-3A123-INT-1",
            "questionText": "Analyze how the functional purpose of a circuit category dictates the selection of its physical topology. In your answer, include: (1) the specific requirements of a circuit category such as lighting or power, (2) the structural characteristics of a radial or ring topology, (3) how the chosen topology supports the category's application. Why must the physical layout be selected based on the circuit's functional application? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies a specific functional category and its operational requirements",
              "Describes the structural path of either a radial or ring topology",
              "Explains the connection between the category's load needs and the topology's capacity",
              "Reasons that topology selection ensures the circuit can handle specific application demands",
              "Concludes that misalignment between category and topology leads to system inefficiency"
            ],
            "expectedAnswer": [
              "A power circuit category often requires higher capacity, which may be supported by a ring topology that provides two paths for current. The ring's unique loop characteristics allow for greater load distribution compared to a radial circuit, which is often sufficient for lower-demand categories like lighting. This relationship holds because the physical arrangement must be engineered to sustain the specific electrical stressors and reliability requirements of the circuit's intended application.",
              "Lighting circuits typically utilize radial topologies because the load requirements are lower and the layout is simpler to install from point to point. In contrast, power circuits may use ring topologies to increase reliability and current-carrying capacity through a looped structure. The physical layout must match the functional application to ensure the installation is both cost-effective and capable of meeting the power demands of the connected equipment."
            ],
            "hint": "Think about how the number of paths for current in a ring versus a radial circuit affects its ability to serve different functional loads."
          },
          {
            "id": "203-3A123-INT-2",
            "questionText": "Evaluate how the integration of functional circuit categories, application criteria, and topology principles forms a complete installation strategy. In your answer, include: (1) the distinction between lighting, power, and control categories, (2) the application criteria used to separate these circuits, (3) the physical differences between radial and ring principles, (4) how these factors work together to provide a reliable system. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Differentiates between lighting, power, and control circuit categories",
              "Explains the criteria for separating loads into different functional circuits",
              "Defines radial topology as a linear path from source to last point",
              "Defines ring topology as a continuous loop returning to the source",
              "Synthesizes how category selection determines the appropriate topology for the load",
              "Discusses how separating categories prevents interference and improves system management",
              "Relates the physical layout (topology) to the overarching goal of installation reliability",
              "Maintains technical precision in describing the relationship between structure and function"
            ],
            "expectedAnswer": [
              "Effective installation planning requires separating loads into lighting, power, and control categories based on their specific application criteria and current demands. Once categorized, a topology is selected: radial circuits provide a simple linear path for lower loads, while ring circuits offer a looped structure for higher capacity power requirements. These elements work together to ensure that the physical wiring layout is optimized for the functional purpose, maximizing both safety and system reliability. This integrated approach allows for targeted maintenance and prevents a single fault from affecting all functional areas of the installation.",
              "• Circuit categories like lighting and power are separated based on their specific load requirements and application criteria to ensure system stability.\n• Radial topologies are used for linear distributions, whereas ring topologies create a loop that provides dual paths for current flow.\n• The integration of these concepts allows designers to match the physical circuit structure to the functional category's demand.\n• This synthesis ensures the installation is efficient, manageable, and capable of supporting the intended electrical loads without overloading the topology."
            ],
            "hint": "Consider how the choice of a 'loop' or 'line' structure depends on whether you are wiring a high-demand power circuit or a low-demand control circuit."
          }
        ]
      }
    },
    {
      "id": "203-3A123-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "203-3A123-SR-1",
            "questionText": "What term describes a complete path or closed loop designed for a specific flow or function within a system?",
            "expectedAnswer": [
              "Circuit",
              "A circuit",
              "Circuits"
            ],
            "hint": "Think of the path that allows a system to operate continuously.",
            "answerType": "short-text"
          },
          {
            "id": "203-3A123-SR-2",
            "questionText": "What word is used to describe the specific role, job, or reason why a component is used in a system?",
            "expectedAnswer": [
              "Purpose",
              "Function",
              "Application"
            ],
            "hint": "This refers to the 'why' or the intended use of the item.",
            "answerType": "short-text"
          },
          {
            "id": "203-3A123-SR-3",
            "questionText": "Which term refers to the process of setting up and fixing equipment into its required position for service?",
            "expectedAnswer": [
              "Installation",
              "Install",
              "Installing"
            ],
            "hint": "This term is used when equipment is being permanently placed for use.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Circuit Types: What They Do"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1"
  ],
  "metadata": {
    "created": "2026-02-11",
    "updated": "2026-02-11",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "203",
      "learningOutcome": "LO3",
      "coveredAC": [
        "AC1"
      ],
      "outOfScopeAC": [
        "AC2",
        "AC3",
        "AC4"
      ]
    },
    "scope": {
      "inScope": "Identification and functional purpose of lighting, power, alarm, data, and control circuits, including ring and radial principles.",
      "outOfScope": "Installation procedures, wiring diagrams for specific components, or cable sizing calculations.",
      "rationale": "This lesson establishes conceptual understanding of circuit applications before progressing to practical installation or design."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on functions and typical uses of circuit types and topologies, excluding physical installation methods or design calculations."
    },
    "misconceptions": [
      {
        "misconception": "All circuits in a building are the same because they all use copper wire.",
        "correction": "Circuits are categorized by their function and load type to ensure safety and reliability.",
        "relatedAC": "AC1"
      },
      {
        "misconception": "A control circuit provides the main power to a machine.",
        "correction": "A control circuit only manages the operation; a separate power circuit provides the energy for the load.",
        "relatedAC": "AC2"
      },
      {
        "misconception": "A ring circuit is just a radial circuit that happens to be long.",
        "correction": "A ring circuit must physically return to its starting point to form a loop; a radial never returns.",
        "relatedAC": "AC3"
      }
    ]
  }
}