{
  "id": "203-3E1A",
  "title": "203.3E1A — Specialised Installing Equipment",
  "description": "Learn about Specialised Installing Equipment in Electrical Installations Technology",
  "layout": "split-vis",
  "unit": "Unit 203",
  "topic": "Specialised Installing Equipment",
  "learningOutcomes": [
    "Identify specialised installation equipment including benders, stocks, dies, and formers",
    "Describe the specific purpose of each piece of equipment within electrical installation",
    "Select the appropriate tool required for specific containment preparation tasks based on its function"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "203-3E1A-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify specialised installation equipment including benders, stocks, dies, and formers",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the specific purpose of each piece of equipment within electrical installation",
            "bloomLevel": "understand"
          },
          {
            "text": "Select the appropriate tool required for specific containment preparation tasks based on its function",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "203-3E1A-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Conduit Bender",
            "definition": "A mechanical tool used to create accurate bends and offsets in electrical conduit while maintaining the internal diameter of the tube."
          },
          {
            "term": "Former",
            "definition": "A radius-shaped component of a bending machine that supports the conduit and determines the specific curve of the bend."
          },
          {
            "term": "Stocks and Dies",
            "definition": "A hand tool assembly used to cut external screw threads onto the ends of steel conduit for attachment to boxes and fittings."
          },
          {
            "term": "Tray Bender",
            "definition": "A specialised device used to form precise angles in cable tray sections to ensure a professional finish and maintain structural integrity."
          },
          {
            "term": "Pipe Vice",
            "definition": "A heavy-duty clamping tool used to provide a stable grip on conduit during cutting, threading, or de-burring operations."
          }
        ]
      }
    },
    {
      "id": "203-3E1A-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Specialised Installing Equipment Diagram",
        "description": "Visual representation of Specialised Installing Equipment",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "Conduit Bender",
          "Former",
          "Stocks and Dies",
          "Tray Bender",
          "Pipe Vice"
        ],
        "placeholderText": "A multi-part diagram showing the specialised equipment. Part A: A floor-standing Conduit Bender with a 20mm Former clearly labeled at the pivot point. Part B: A set of Stocks and Dies showing the circular die held within the stock handles. Part C: A Pipe Vice mounted on a tripod stand, shown with a section of conduit held firmly. Part D: A Tray Bender showing its specific jaw structure for gripping cable tray. All labels should use the exact vocabulary terms and highlight the relationship between the tool and the containment material (e.g., the former matching the conduit curve)."
      }
    },
    {
      "id": "203-3E1A-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Bending and Forming Equipment",
        "content": "1. **What this is**\n\nBending and forming equipment consists of specialised mechanical tools designed to alter the physical shape of electrical containment systems like conduit and cable tray. A **Conduit Bender** is a floor-standing or bench-mounted mechanical tool used to create accurate bends and offsets in electrical conduit while maintaining the internal diameter of the tube. A critical part of this machine is the **Former**, which is a radius-shaped component of a bending machine that supports the conduit and determines the specific curve of the bend. For different types of containment, a **Tray Bender** is a specialised device used to form precise angles in cable tray sections to ensure a professional finish and maintain structural integrity. These tools are essential for navigating the structural features of a building during an electrical installation.\n\n2. **Why it matters**\n\nIn most cases, electrical containment must follow the contours of a building's architecture. Without specialised bending equipment, installers would be unable to route conduit around corners or over obstacles while keeping the installation neat. Maintaining the internal diameter of the conduit is vital; if a conduit kinks or collapses during shaping, it restricts the available space for cables and can damage cable insulation during the drawing-in phase. Furthermore, for metallic systems, professional forming ensures that the containment remains robust and provides a reliable path for the cables it protects.\n\n3. **Key facts / rules**\n\n*   **Conduit Bender**: Used for creating offsets, 90-degree bends, and kick-sets in metallic and heavy-gauge plastic conduit.\n*   **Former**: Must match the specific outside diameter of the conduit being shaped (e.g., a 20mm former for 20mm conduit).\n*   **Tray Bender**: Specifically for cable tray, allowing for changes in level or direction without the need for multiple separate fittings.\n*   Common UK conduit sizes include 16mm, 20mm, 25mm, and 32mm.\n*   Industry guidance recommends that the internal radius of a bend should not cause damage to the cables being installed.\n\n4. **When to choose it**\n\nSelection of this equipment depends entirely on the material and the required outcome. A **Conduit Bender** is the appropriate choice when the installation plan requires a continuous run of steel conduit to change direction by 90 degrees or to navigate a small obstacle like a pillar. The selection of the **Former** is dictated by the conduit size; for instance, if the specification calls for 25mm heavy-gauge steel conduit, a 25mm former is necessary to prevent the tube from flattening. A **Tray Bender** is selected when the installer needs to create an internal or external riser in a run of cable tray, especially when a bespoke angle is required that standard factory-made fittings cannot provide. These tools are chosen when the goal is a high-quality, seamless containment run that avoids the excessive use of separate coupling fittings.\n\n5. **Common mistakes**\n\nStudents often mistake a standard pipe bender (used by plumbers) for an electrical **Conduit Bender**. While they look similar, the **Former** in an electrical bender has a specific radius designed for electrical conduit standards. Using the wrong size former is another frequent error, which results in a crushed or deformed conduit profile. Additionally, students sometimes overlook the use of a **Tray Bender**, opting instead to cut and bolt tray sections together, which can leave sharp edges and compromise the professional finish of the installation.\n\n6. **Quick recap**\n\nSpecialised bending equipment allows an electrician to shape containment systems to fit the environment. The **Conduit Bender** and its size-specific **Former** ensure that conduit is bent accurately without kinking, which protects the cables inside. The **Tray Bender** provides a similar function for cable tray, allowing for precise angular changes. Selecting the correct tool based on the material and diameter is essential for a high-quality, compliant installation."
      }
    },
    {
      "id": "203-3E1A-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Bending and Forming Equipment",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1A-C1-L1-A",
            "questionText": "What is the purpose of a Conduit Bender in electrical installation?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "create accurate bends and offsets",
              "create accurate bends",
              "form bends and offsets",
              "to create accurate bends and offsets"
            ],
            "hint": "Look at the section describing the mechanical tool used for conduit tube."
          },
          {
            "id": "203-3E1A-C1-L1-B",
            "questionText": "State the purpose of the component known as a Former.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "supports the conduit and determines the specific curve",
              "supports the conduit and determines the curve",
              "determines the specific curve of the bend",
              "support the conduit and determine the curve"
            ],
            "hint": "This is the radius-shaped part of the bending machine."
          },
          {
            "id": "203-3E1A-C1-L1-C",
            "questionText": "Identify the equipment used to form precise angles in cable tray sections.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Tray Bender",
              "a Tray Bender",
              "Cable Tray Bender"
            ],
            "hint": "This tool is used specifically for cable tray rather than conduit."
          },
          {
            "id": "203-3E1A-C1-L2",
            "questionText": "Using your answers to Q1 (Conduit Bender), Q2 (Former), and Q3 (Tray Bender), explain how these tools allow containment to follow building contours while protecting the cables inside.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "The Conduit Bender and its size-specific Former ensure conduit is bent accurately without kinking to protect cables, while the Tray Bender allows tray to navigate building features with precise angles.",
              "A Conduit Bender with a Former creates curves that prevent kinking to protect cables, and a Tray Bender allows tray to follow building architecture.",
              "These tools allow conduit and tray to be shaped to the building architecture while the Former prevents conduit damage that would restrict cable space."
            ],
            "hint": "Consider how maintaining the shape of the conduit and tray helps navigate building features without damaging the cables."
          }
        ]
      }
    },
    {
      "id": "203-3E1A-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Threading Equipment",
        "content": "1. **What this is**\n\nThreading equipment is used to prepare the ends of steel conduit so they can be mechanically joined to other components. The primary tool for this is the **Stocks and Dies** set. This is a hand tool assembly used to cut external screw threads onto the ends of steel conduit for attachment to boxes and fittings. To facilitate this work, a **Pipe Vice** is used; this is a heavy-duty clamping tool used to provide a stable grip on conduit during cutting, threading, or de-burring operations. Together, these tools allow the installer to create a secure, threaded connection between the conduit and various accessories like stop-end boxes or through-boxes.\n\n2. **Why it matters**\n\nSteel conduit systems are often used in industrial environments where mechanical protection is a priority. For these systems to be effective, every joint must be secure. Threaded joints contribute to electrical continuity of the metallic containment system, which is vital for safety. If the threads are not cut correctly using **Stocks and Dies**, the connection to the conduit box may be loose, potentially compromising the earthing path. The **Pipe Vice** is equally important as it ensures the conduit does not move while being worked on, allowing for the precise alignment of the threads.\n\n3. **Key facts / rules**\n\n*   **Stocks and Dies**: Essential for creating the male threads on the end of a cut piece of steel conduit.\n*   **Pipe Vice**: Provides the necessary stability for all preparation tasks involving steel conduit.\n*   Threaded joints: When properly installed, the threaded metallic path can provide earth continuity.\n*   Standard thread sizes: In the UK, these are typically metric (e.g., 20mm or 25mm) to match the conduit and box entries.\n*   IET On-Site Guide provides guidance on the selection and installation of metallic containment systems.\n\n4. **When to choose it**\n\n**Stocks and Dies** are selected whenever a length of steel conduit has been cut to size and needs to be connected to a threaded entry on a conduit box or a coupler. This tool is the only appropriate choice for creating the necessary external screw threads on-site. A **Pipe Vice** is selected as the primary support tool for any task involving the physical modification of conduit, such as when using a hacksaw for cutting or a reamer for removing sharp internal burrs. It is the go-to selection whenever a stable work platform is needed to ensure the conduit remains stationary. These tools are specifically for metallic systems; they are not typically selected for use with PVC conduit, which uses solvent welding or push-fit connections.\n\n5. **Common mistakes**\n\nA common error is failing to recognise that the **Stocks and Dies** must match the diameter of the conduit exactly; trying to use a 25mm die on 20mm conduit will not work. Students also sometimes forget the importance of the **Pipe Vice**, attempting to hold the conduit by hand or in a standard bench vice, which often results in the conduit slipping or the surface being damaged. Another mistake is underestimating the role of the threads in electrical safety, focusing only on the mechanical strength rather than the electrical continuity provided by a well-cut, tight-fitting thread.\n\n6. **Quick recap**\n\nThreading equipment is essential for the preparation of steel conduit systems. **Stocks and Dies** allow for the creation of external screw threads, enabling secure connections to boxes and fittings. The **Pipe Vice** provides the stability required to perform these preparation tasks accurately. Correct selection and use of these tools ensure that the containment system is mechanically sound and that the threaded joints contribute to the electrical continuity of the overall installation."
      }
    },
    {
      "id": "203-3E1A-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Threading Equipment",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1A-C2-L1-A",
            "questionText": "What is the purpose of a Stocks and Dies set?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "cut external screw threads",
              "create external screw threads",
              "cut threads onto the ends of steel conduit",
              "cut external threads"
            ],
            "hint": "This tool is used to prepare the ends of conduit for attachment to boxes."
          },
          {
            "id": "203-3E1A-C2-L1-B",
            "questionText": "State the purpose of a Pipe Vice during conduit preparation.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "provide a stable grip",
              "provide a stable grip on conduit",
              "ensure the conduit does not move",
              "provide stability"
            ],
            "hint": "Think about what is needed to keep the conduit stationary while working on it."
          },
          {
            "id": "203-3E1A-C2-L1-C",
            "questionText": "Besides mechanical strength, what do properly installed threaded joints provide for a metallic containment system?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "electrical continuity",
              "earth continuity",
              "electrical and earth continuity"
            ],
            "hint": "This is vital for safety in metallic systems."
          },
          {
            "id": "203-3E1A-C2-L2",
            "questionText": "Using your answers to Q1 (Stocks and Dies), Q2 (Pipe Vice), and Q3 (Electrical Continuity), explain how threading equipment contributes to the safety of a steel conduit system.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "Stocks and Dies create threads while the Pipe Vice provides the stability to cut them accurately, ensuring secure joints that provide essential electrical continuity.",
              "The Pipe Vice provides the stable grip needed for Stocks and Dies to cut precise threads, which creates the secure connection required for electrical continuity.",
              "By using a Pipe Vice for stability, Stocks and Dies can create the well-cut threads necessary to maintain the electrical continuity of the earthing path."
            ],
            "hint": "Connect the need for stability and precise cutting to the final electrical safety requirement."
          }
        ]
      }
    },
    {
      "id": "203-3E1A-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "203-3E1A-P1",
            "questionText": "Which component of a conduit bending machine determines the specific curve of the bend and must match the conduit's outside diameter?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Former",
              "the Former",
              "a Former"
            ],
            "hint": "This radius-shaped component supports the conduit during the bending process."
          },
          {
            "id": "203-3E1A-P2",
            "questionText": "Which tool is selected to create external screw threads on steel conduit for attachment to boxes and fittings?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Stocks and Dies",
              "Stock and Dies",
              "Stocks and Die"
            ],
            "hint": "This is a hand tool assembly used specifically for metallic conduit preparation."
          },
          {
            "id": "203-3E1A-P3",
            "questionText": "If an installer is working with 20mm steel conduit, what size former is required to prevent the conduit from kinking or flattening? (Round to nearest whole number)",
            "answerType": "numeric",
            "expectedAnswer": [
              "20",
              "20.0"
            ],
            "hint": "The former size must match the outside diameter of the conduit in millimetres (mm)."
          },
          {
            "id": "203-3E1A-P4",
            "questionText": "Identify the specialised device used to form precise angles and risers in cable tray sections.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Tray Bender",
              "the Tray Bender",
              "a Tray Bender"
            ],
            "hint": "This tool is used for cable tray instead of conduit."
          },
          {
            "id": "203-3E1A-P5",
            "questionText": "What is the primary purpose of a Pipe Vice during the preparation of metallic conduit?",
            "answerType": "short-text",
            "expectedAnswer": [
              "provide a stable grip",
              "provide stability",
              "to provide stability"
            ],
            "hint": "It is a heavy-duty tool used to keep the conduit stationary during work."
          }
        ]
      }
    },
    {
      "id": "203-3E1A-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "203-3E1A-INT-1",
            "questionText": "How does the use of a pipe vice support the subsequent use of stocks and dies when preparing a length of steel conduit for installation? Please explain the relationship between these two pieces of equipment in 2-3 sentences.",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": [
              "A pipe vice provides the heavy-duty clamping required to keep the conduit stationary and prevent rotation during the high-torque process of threading. This stability allows the stocks and dies to cut clean, straight external threads onto the conduit end, ensuring a secure mechanical connection to fittings.",
              "The pipe vice acts as a stable platform that prevents the conduit from moving while the stocks and dies are rotated to cut threads. Without the grip of the vice, it would be impossible to apply the necessary force to the threading equipment to create a professional finish."
            ],
            "hint": "Think about the physical force required to cut steel and what would happen if the conduit wasn't held firmly."
          },
          {
            "id": "203-3E1A-INT-2",
            "questionText": "Explain how the selection of the correct former within a conduit bender, combined with the proper use of threading equipment, ensures the integrity of a completed electrical containment system. Provide a comprehensive explanation in 3-4 sentences.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": [
              "Selecting the correct former ensures that the conduit bender maintains the internal diameter and structural integrity of the tube during shaping, preventing kinks that could damage cables. Once shaped, the conduit must be secured in a pipe vice so that stocks and dies can cut precise threads for mechanical attachment to boxes. Together, these tools ensure the run follows the required path while remaining electrically continuous and mechanically sound at every joint.",
              "To create a professional installation, the installer must use a specific former to produce accurate bends without collapsing the conduit walls, allowing for easy cable drawing. This is integrated with the threading process, where a pipe vice and stocks and dies create the necessary screw threads for secure termination into enclosures. This combined workflow ensures the containment system is robust, fits the installation environment perfectly, and meets safety standards for mechanical protection."
            ],
            "hint": "Consider how the former protects the 'path' for the cables while the threading equipment provides the 'strength' of the connections."
          }
        ]
      }
    },
    {
      "id": "203-3E1A-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Spaced Review (from prerequisites)",
        "questions": [],
        "notes": "No prerequisites for this foundational lesson"
      }
    }
  ],
  "metadata": {
    "created": "2026-02-04",
    "updated": "2026-02-04",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}