{
  "id": "204-13A",
  "title": "204.13A — One-way lighting (3-plate ceiling rose): plan + wire journey (rig-safe)",
  "description": "Master the wire journey and termination map for a 3-plate ceiling rose circuit before beginning practical rig installation.",
  "layout": "split-vis",
  "unit": "Unit 204",
  "topic": "One-way lighting",
  "learningOutcomes": [
    "Define what a one-way lighting circuit is in a training-rig context.",
    "Explain the wire journey including permanent live, switched live, neutral, and CPC paths.",
    "Identify where each conductor terminates at the ceiling rose and the switch.",
    "Apply a pre-flight inspection checklist for dead installations."
  ],
  "prerequisites": [
    "204-11A",
    "204-11B",
    "204-12A",
    "204-12B"
  ],
  "blocks": [
    {
      "id": "204-13A-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Define a one-way lighting circuit and its components.",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the complete wire journey from consumer unit to lamp.",
            "bloomLevel": "understand"
          },
          {
            "text": "Map conductors to specific terminals in a 3-plate rose and switch.",
            "bloomLevel": "apply"
          },
          {
            "text": "Perform a pre-flight quality inspection on a dead circuit.",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "204-13A-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "One-way switching",
            "definition": "A configuration where a single switch controls one lamp from one location."
          },
          {
            "term": "Ceiling rose (3-plate)",
            "definition": "An accessory containing loop (permanent live), neutral, and switched live terminals."
          },
          {
            "term": "Permanent live (loop)",
            "definition": "The live feed from the supply that remains live regardless of switch position."
          },
          {
            "term": "Switched live",
            "definition": "The conductor returning from the switch that only becomes live when the switch is closed."
          },
          {
            "term": "CPC",
            "definition": "Circuit Protective Conductor; the earth path ensuring safety throughout the installation."
          },
          {
            "term": "Sleeving/ID",
            "definition": "Coloured markers used to identify the function of a conductor, such as brown on a switched live."
          }
        ]
      }
    },
    {
      "id": "204-13A-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "One-way Lighting (3-plate rose) Wire Journey",
        "description": "A map showing the flow of Line, Neutral, and CPC between the Consumer Unit, Ceiling Rose, and Switch.",
        "videoUrl": "",
        "diagramType": "circuit",
        "elementIds": [
          "CU",
          "Rose",
          "Switch",
          "Lamp"
        ],
        "placeholderText": "Diagram showing: CU Line to Rose Loop; Rose Loop to Switch COM; Switch L1 to Rose Switched Live terminal; Rose Switched Live to Lamp; CU Neutral to Rose Neutral group; Rose Neutral group to Lamp; CPC connecting all points."
      }
    },
    {
      "id": "204-13A-explain-wire-journey",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Path of the Current",
        "content": "A **one-way lighting circuit** using a 3-plate ceiling rose is the standard method for wiring lights in the UK. The fundamental rule to remember is that the **switch breaks the Line (live) conductor**, never the Neutral. This ensures that when the switch is off, there is no potential at the lamp holder.\n\n### 1. The Permanent Live Path (The Loop)\nThe journey begins at the **Consumer Unit (CU)**. The Line conductor travels to the ceiling rose and terminates in the **Loop terminals**. This is a permanent live group. From this same group, a conductor (the switch feed) travels down to the **COM (Common)** terminal of the switch. This part of the circuit is always live as long as the breaker is on.\n\n### 2. The Switched Live Path (The Return)\nWhen the switch is toggled to the 'ON' position, it creates a bridge between the **COM** and **L1** terminals. The conductor connected to L1 is the **switched live**. It travels back up to the ceiling rose and terminates in the third, separate terminal (the switched live terminal). This terminal is then connected directly to the lamp live. It only becomes live when the switch is closed.\n\n### 3. The Neutral Path\nThe Neutral conductor from the CU goes directly to the **Neutral group** in the ceiling rose. The lamp&apos;s neutral wire also connects to this group. Unlike the live wire, the neutral is not interrupted by the switch; it provides the continuous return path for the current from the lamp back to the supply.\n\n### 4. The CPC (Earth) Path\nThe **Circuit Protective Conductor (CPC)** must be continuous throughout. It runs from the CU to the ceiling rose and then to the switch box. Even if you are using plastic accessories, the CPC must be terminated into the provided earth terminals or a connector block to maintain the earth path for the entire circuit. \n\n### 5. Termination Map Summary\nIn a 3-plate rose, you have three distinct blocks:\n1. **Loop:** CU Live and Switch Feed (COM).\n2. **Neutral:** CU Neutral and Lamp Neutral.\n3. **Switched Live:** Switch Return (L1) and Lamp Live.\n\n### 6. Pre-flight Inspection\nBefore any testing with meters, you must perform a visual **dead inspection**. Look for 'Stop-and-Fix' issues: **exposed copper** outside of terminals, **loose terminations** (the 'tug test'), and **missing CPC** connections. Ensure the cable sheath enters the accessory box and that all switched lives are correctly identified with **brown sleeving**."
      }
    },
    {
      "id": "204-13A-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Wire Journeys",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "204-13A-C1-L1-A",
            "questionText": "In a one-way lighting circuit, which conductor must the switch break?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Line",
            "hint": "Think about which wire carries the potential to the switch."
          },
          {
            "id": "204-13A-C1-L1-B",
            "questionText": "Where do the neutral conductors from the CU and the lamp join together?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Ceiling rose",
            "hint": "It is the central hub for the 3-plate system."
          },
          {
            "id": "204-13A-C1-L1-C",
            "questionText": "Which terminal on the switch receives the permanent live feed from the rose loop?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "COM",
            "hint": "It stands for 'Common'."
          },
          {
            "id": "204-13A-C1-L2",
            "questionText": "Why is the lamp live connected to the 'Switched Live' terminal instead of the 'Loop' terminal?",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": "To allow the switch to control the lamp",
            "hint": "If it were in the loop, would the switch do anything?"
          }
        ]
      }
    },
    {
      "id": "204-13A-practice",
      "type": "practice",
      "order": 7,
      "content": {
        "title": "Your Turn: Termination & Inspection",
        "questions": [
          {
            "id": "204-13A-P1",
            "questionText": "What colour sleeving should be applied to a blue conductor used as a switched live return?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Brown",
              "Brown sleeving"
            ],
            "hint": "It must be identified as a live conductor."
          },
          {
            "id": "204-13A-P2",
            "questionText": "The return feed from the switch to the rose comes from which terminal?",
            "answerType": "short-text",
            "expectedAnswer": [
              "L1"
            ],
            "hint": "It is the output terminal of a 1-way switch."
          },
          {
            "id": "204-13A-P3",
            "questionText": "Identify one 'Stop-and-Fix' issue related to copper visible at a terminal.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Exposed copper",
              "Exposed conductor",
              "Copper outside terminal"
            ],
            "hint": "Think about what happens if bare wire is visible outside the plastic."
          }
        ]
      }
    },
    {
      "id": "204-13A-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "questions": [
          {
            "id": "204-13A-INT-1",
            "questionText": "Trace the path of the Line conductor starting from the Consumer Unit, through the ceiling rose and switch, until it reaches the lamp. Specify the terminal names used at each point.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": "CU Line to Rose Loop, Rose Loop to Switch COM, Switch L1 to Rose Switched Live terminal, Rose Switched Live to Lamp Live.",
            "hint": "Follow the 'Loop' down and the 'Return' back up."
          }
        ]
      }
    },
    {
      "id": "204-13A-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Spaced Review",
        "questions": [
          "What is the standard colour for a Neutral conductor in a modern UK installation?",
          "What does the abbreviation CPC stand for?",
          "True or False: A switch should be placed in the Neutral conductor to ensure safety.",
          "What is the primary purpose of a Circuit Protective Conductor?"
        ],
        "notes": "Reviewing conductor identification and basic circuit safety from 204-11 and 204-12."
      }
    }
  ],
  "metadata": {
    "created": "2026-01-28",
    "updated": "2026-01-28",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}