{
  "id": "204-13A",
  "title": "204.13A — Ceiling Rose Anatomy (3-plate): what it is + how to &quot;read&quot; it",
  "description": "Learn to identify and map the three terminal groups of a 3-plate ceiling rose, treating it as a junction hub for lighting circuits.",
  "layout": "split-vis",
  "unit": "Unit 204",
  "topic": "Ceiling Rose Anatomy",
  "learningOutcomes": [
    "Name the three terminal groups in a 3-plate ceiling rose.",
    "Explain what each group is &quot;proving/doing&quot; in the circuit.",
    "Match common conductors to the correct terminal group (feed, switch drop, lamp flex, CPC).",
    "Perform a quick &quot;rose-read&quot; check to confirm correct wiring before testing."
  ],
  "prerequisites": [
    "204-11A",
    "204-11B",
    "204-12A",
    "204-12B"
  ],
  "blocks": [
    {
      "id": "204-13A-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Name the three terminal groups in a 3-plate ceiling rose.",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the function of the Loop, Neutral, and Switched Live terminals.",
            "bloomLevel": "understand"
          },
          {
            "text": "Correctly assign conductors to terminal groups in a standard lighting circuit.",
            "bloomLevel": "apply"
          },
          {
            "text": "Verify terminal mapping using a visual inspection checklist.",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "204-13A-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Ceiling rose (3-plate)",
            "definition": "A lighting junction accessory with separate terminal groups for Loop, Neutral, and Switched Live."
          },
          {
            "term": "Loop / Permanent live",
            "definition": "The terminal group holding the live supply path that stays energized regardless of switch position."
          },
          {
            "term": "Neutral group",
            "definition": "The terminal block where all neutral return conductors and the lamp neutral are connected."
          },
          {
            "term": "Switched live",
            "definition": "The terminal that receives power only when the light switch is closed, feeding the lamp."
          },
          {
            "term": "Lamp flex",
            "definition": "The flexible cable connecting the ceiling rose terminals to the actual lampholder."
          },
          {
            "term": "CPC",
            "definition": "Circuit Protective Conductor; the earth path that must be terminated and sleeved at the rose."
          }
        ]
      }
    },
    {
      "id": "204-13A-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "3-Plate Ceiling Rose Internal Layout",
        "description": "Visual mapping of the Loop, Neutral, and Switched Live terminal blocks within a standard rose.",
        "videoUrl": "",
        "diagramType": "circuit",
        "elementIds": [
          "loop-terminals",
          "neutral-terminals",
          "switched-live-terminals",
          "cpc-terminal"
        ],
        "placeholderText": "Diagram showing three distinct terminal blocks in the center (Loop, Neutral, Switched Live) and a separate earth terminal (CPC) on the base."
      }
    },
    {
      "id": "204-13A-explain-anatomy",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Rose as a Junction Hub",
        "content": "Before you begin wiring a one-way lighting circuit, you must master the anatomy of the **3-plate ceiling rose**. In modern domestic wiring, the rose is not just a connection point for a light bulb; it is a **junction hub**. It serves as the primary location where cables from the consumer unit, the switch, and the next lighting point all meet.\n\nTo work safely and effectively, you must develop a **&quot;Rose Mindset&quot;**. Instead of seeing a confusing mess of wires, you should see three distinct jobs being performed simultaneously: looping the permanent live, grouping the neutrals, and feeding the lamp via the switch return. If you can &quot;read&quot; these three jobs, you can wire any standard lighting circuit with confidence.\n\n### 1. The LOOP Terminal Group (Permanent Live)\nThis is the heart of the circuit&apos;s power path. The Loop terminals hold the live conductors that must stay together to ensure power reaches the rest of the installation. Typically, you will find three conductors here: the **Live Feed In** from the supply, the **Live Feed Out** going to the next room, and the **Switch Feed** (the wire going down to the switch &quot;Common&quot; terminal). Crucially, the lamp itself is **not** connected here, otherwise the light would never turn off!\n\n### 2. The NEUTRAL Terminal Group\nThis group provides the return path for the current. It keeps the neutral connection continuous throughout the circuit. In this block, you will find the **Neutral Feed In**, the **Neutral Feed Out**, and the **Lamp Neutral** from the flex. All these blues (or black in older cables) must be securely joined to complete the circuit back to the consumer unit.\n\n### 3. The SWITCHED LIVE Terminal Group\nThis is the &quot;controlled&quot; terminal. It only becomes live when the wall switch is flipped to the &quot;ON&quot; position. This block usually contains only two wires: the **Switch Return** (coming back from the switch L1 terminal) and the **Lamp Live** (from the lamp flex). By isolating the lamp live to this specific block, we ensure the switch has total control over the light.\n\n### The CPC (Earth) Terminal\nThe Circuit Protective Conductor (CPC) is technically not one of the &quot;three plates,&quot; but it is vital for safety. It is usually a separate terminal or a &quot;parking&quot; block on the rose base. Every CPC entering the rose must be **terminated together**, properly **sleeved** in green/yellow insulation, and tightened securely. Even if the light fitting is plastic, the CPC must be maintained to ensure earth continuity for the rest of the circuit.\n\n### The Rose-Read Checklist\nBefore you ever pick up a meter to test, perform a visual &quot;Rose-Read&quot; to catch common mistakes:\n1. **Loop Check**: Are only permanent lives and the switch feed present?\n2. **Neutral Check**: Are the supply neutrals and the lamp neutral grouped together?\n3. **Switched Live Check**: Does the switch return meet the lamp live here?\n4. **CPC Check**: Are all earths sleeved and terminated in the correct block?\n5. **Mechanical Check**: Is the cable sheath inside the accessory? Are there any &quot;plastic-in&quot; errors? Is the copper exposed outside the terminal?"
      }
    },
    {
      "id": "204-13A-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Rose Anatomy",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "204-13A-C1-L1-A",
            "questionText": "What are the three main terminal groups found in a 3-plate ceiling rose?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Loop, Neutral, and Switched Live",
            "hint": "Think of the permanent live, the return path, and the one controlled by the switch."
          },
          {
            "id": "204-13A-C1-L1-B",
            "questionText": "Which terminal group usually contains the switch feed that goes down to the switch &quot;Common&quot; terminal?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Loop",
            "hint": "This group stays live all the time to provide power to the switch."
          },
          {
            "id": "204-13A-C1-L1-C",
            "questionText": "In which terminal group would you connect the blue wire coming from the lamp flex?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Neutral",
            "hint": "The lamp needs a return path to work."
          },
          {
            "id": "204-13A-C1-L2",
            "questionText": "Why is the brown wire of the lamp flex connected to the Switched Live group rather than the Loop group?",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": "To allow the switch to control the light; if connected to Loop, the light would stay on permanently.",
            "hint": "Consider what happens if the lamp is connected to a &quot;permanent&quot; live source."
          }
        ]
      }
    },
    {
      "id": "204-13A-practice",
      "type": "practice",
      "order": 7,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "204-13A-P1",
            "questionText": "Sort these conductors into their correct groups in order (Loop / Neutral / Switched Live): 1. CU Line Feed, 2. CU Neutral Feed, 3. Switch Return, 4. Lamp Live.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Loop / Neutral / Switched Live / Switched Live"
            ],
            "hint": "CU Line is permanent; CU Neutral is return; Switch Return and Lamp Live go together."
          },
          {
            "id": "204-13A-P2",
            "questionText": "True or False: A ceiling rose is only used to connect the lamp flex and is not considered a junction point for the circuit.",
            "answerType": "short-text",
            "expectedAnswer": [
              "False"
            ],
            "hint": "Think about the 'Rose Mindset' section."
          },
          {
            "id": "204-13A-P3",
            "questionText": "You find a lamp live connected to the Loop group. Is this 'pass' or 'stop-and-fix'?",
            "answerType": "short-text",
            "expectedAnswer": [
              "stop-and-fix"
            ],
            "hint": "Will the switch work in this configuration?"
          }
        ]
      }
    },
    {
      "id": "204-13A-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "questions": [
          {
            "id": "204-13A-INT-1",
            "questionText": "Explain the structure and purpose of a 3-plate ceiling rose in one short paragraph, identifying the roles of the three main terminal groups.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": "A 3-plate rose is a junction hub for lighting circuits. The Loop group maintains permanent live continuity and feeds the switch. The Neutral group provides a return path for both the supply and the lamp. The Switched Live group connects the switch return to the lamp to allow control.",
            "hint": "Use the structure: 'A 3-plate rose is... The Loop group does... The Neutral group does... The Switched live group does...'"
          }
        ]
      }
    },
    {
      "id": "204-13A-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Spaced Review (from prerequisites)",
        "questions": [
          {
            "id": "204-13A-SR-1",
            "questionText": "What does CPC stand for, and what is its primary role in a circuit?",
            "expectedAnswer": "Circuit Protective Conductor; it provides a path to earth for fault currents.",
            "hint": "It's the green and yellow wire."
          },
          {
            "id": "204-13A-SR-2",
            "questionText": "Why is it essential to ensure mechanical tightness in all terminal connections?",
            "expectedAnswer": "To prevent high resistance, arcing, and potential fire hazards.",
            "hint": "Think about what happens if a connection is loose and generates heat."
          },
          {
            "id": "204-13A-SR-3",
            "questionText": "What does the term &quot;plastic-in&quot; refer to in terminal terminations?",
            "expectedAnswer": "When the cable insulation is accidentally trapped inside the terminal screw, preventing a good electrical contact.",
            "hint": "It involves the outer coating of the wire getting in the way."
          },
          {
            "id": "204-13A-SR-4",
            "attText": "Why must we always perform a visual inspection before conducting electrical meter tests?",
            "expectedAnswer": "To identify obvious faults, missing connections, or safety issues that could make testing dangerous or inaccurate.",
            "hint": "Think about 'dead work' safety and efficiency."
          }
        ],
        "notes": "Reviewing grounding concepts from 204-11 and basic termination standards from 204-12."
      }
    }
  ],
  "metadata": {
    "created": "2026-01-28",
    "updated": "2026-01-28",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}