{
  "id": "204-11B",
  "title": "204.11B — Proving your tester works: The Dead-Testing Mindset",
  "description": "Learn how to verify instrument reliability before and after testing to ensure accurate results and safe working practices on training rigs.",
  "layout": "split-vis",
  "unit": "Unit 204",
  "topic": "Electrical Installations Technology",
  "learningOutcomes": [
    "State the purpose of proving a tester before use",
    "Describe a standard proving routine for dead-testing",
    "Identify indicators of a healthy tester function for continuity and insulation resistance",
    "Determine when an instrument requires re-proving during a testing session"
  ],
  "prerequisites": [
    "204-10A",
    "204-10B",
    "204-11A"
  ],
  "blocks": [
    {
      "id": "204-11B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "State the purpose of proving a tester before use",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe a standard proving routine for dead-testing",
            "bloomLevel": "understand"
          },
          {
            "text": "Identify indicators of a healthy tester function for continuity and insulation resistance",
            "bloomLevel": "understand"
          },
          {
            "text": "Determine when an instrument requires re-proving during a testing session",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "204-11B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Proving",
            "definition": "Verifying an instrument is functioning correctly by checking it against a known reference condition before relying on any circuit readings."
          },
          {
            "term": "Known Reference",
            "definition": "A predictable condition used to confirm the tester is behaving correctly (e.g., a designed proving unit, a deliberate short for continuity, or an open condition for insulation resistance)."
          },
          {
            "term": "Instrument Leads",
            "definition": "The detachable cables used to connect the tester to the circuit; poor contact or damaged leads are a common cause of false readings."
          },
          {
            "term": "Dead-Testing",
            "definition": "Electrical tests performed on circuits that have been safely isolated from the electrical supply."
          },
          {
            "term": "Nulling",
            "definition": "Removing the resistance of test leads from low-ohms measurements so the displayed value better represents the circuit under test."
          }
        ]
      }
    },
    {
      "id": "204-11B-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Proving Continuity vs Insulation Resistance",
        "description": "Visualizing the two primary proving states for dead-testing instruments.",
        "videoUrl": "",
        "diagramType": "circuit",
        "elementIds": [
          "tester",
          "leads_shorted",
          "leads_open"
        ],
        "placeholderText": "Diagram showing a multi-function tester. Figure A shows leads shorted together for a continuity prove (stable very low Ω). Figure B shows leads held apart for an IR prove (over-range / very high MΩ, e.g., OL, O.C, or >max depending on the meter)."
      }
    },
    {
      "id": "204-11B-explain-proving-logic",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Dead-Testing Mindset: Prove, Test, Re-prove",
        "content": "Before an electrician can trust a reading on a circuit, they must first trust the instrument in their hands. **Proving the tester** is the first reliability check: it confirms the tester is responding correctly to a known condition, and that your leads and contacts are not introducing misleading results.\n\nFor dead-testing on training rigs, use this routine every time: **Prove → Test → Re-prove**.\n\n1. **Proving Continuity (low-ohms):** Set the tester to continuity/low-ohms. Apply the probes to a **known low-resistance condition** (for example, touching the probe tips together or using an approved training proving point). A healthy setup shows a **stable very low resistance** (close to zero) and, if the buzzer is enabled, a consistent beep. If the reading is unstable or unexpectedly high, suspect poor contact, wrong ports/function, or lead/probe issues.\n\n2. **Proving Insulation Resistance (IR):** Set the tester to the IR function appropriate for the training task. Confirm the probes are not touching anything conductive (or use an approved proving unit/open condition). A healthy IR prove shows **very high resistance / over-range** (displayed as OL, O.C, or >max depending on the meter). This confirms the tester correctly recognises separation between the probes.\n\n**When to Re-prove:** Do not assume the tester stays reliable throughout a session. Re-prove if:\n1. You change leads or settings (including range/function).\n2. You get an unexpected result that doesn’t match your circuit map.\n3. You drop/bump the instrument or the probes are pulled/yanked.\n4. You have an interruption (e.g., leaving the bench) before finishing.\n\nA common misconception is: “If the screen turns on, it must be fine.” In reality, many errors come from **leads, probe contact, ports, and settings**. Proving removes the tester as the hidden cause of a strange reading.\n\n**Remember:** Proving is about the tester; testing is about the circuit. If something looks wrong, re-prove before you conclude the circuit is wrong."
      }
    },
    {
      "id": "204-11B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Proving Routines",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "204-11B-C1-L1-A",
            "questionText": "What should you do with your test leads (or probes) to prove the continuity/low-ohms function of a tester?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Apply them to a known low-resistance condition (e.g., touch probe tips together)",
            "hint": "Think about how you create a path of very low resistance."
          },
          {
            "id": "204-11B-C1-L1-B",
            "questionText": "What kind of result should you expect when proving the Insulation Resistance function with the probes held apart (not touching anything conductive)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Very high / over-range (e.g., OL, O.C, or >max depending on the meter)",
            "hint": "It should indicate 'no connection' between the probes."
          },
          {
            "id": "204-11B-C1-L1-C",
            "questionText": "Apart from the tester itself, what is the most common part of the setup to fail and give false readings?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Test leads / probes / poor contact",
            "hint": "These connect the meter to the circuit."
          },
          {
            "id": "204-11B-C1-L2",
            "questionText": "Why is it necessary to re-prove a tester after receiving an 'unexpected' result on a circuit?",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": "To confirm the tester/leads/settings are reliable before concluding the circuit is at fault",
            "hint": "Consider whether the error could be coming from the tool rather than the circuit."
          }
        ]
      }
    },
    {
      "id": "204-11B-practice",
      "type": "practice",
      "order": 7,
      "content": {
        "title": "Your Turn: Proving Scenarios",
        "questions": [
          {
            "id": "204-11B-P1",
            "questionText": "You are about to start dead-testing a lighting circuit. You prove continuity and the tester displays 15.5Ω on the proving condition. Is this a healthy proving result?",
            "answerType": "short-text",
            "expectedAnswer": [
              "No",
              "Incorrect",
              "No — it should be a stable very low resistance"
            ],
            "hint": "A proving short should be very low and stable, not high."
          },
          {
            "id": "204-11B-P2",
            "questionText": "Which of the following is the correct order for a professional proving-based testing sequence?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Prove Test Reprove",
              "Prove, Test, Re-prove",
              "Prove → Test → Re-prove"
            ],
            "hint": "It starts and ends with confirming the tester."
          },
          {
            "id": "204-11B-P3",
            "questionText": "If you change your test leads during a testing session, what must you do before continuing?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Re-prove",
              "Re-prove the tester",
              "Prove the tester again"
            ],
            "hint": "New leads can change contact and reliability, so confirm the tester response again."
          },
          {
            "id": "204-11B-P4",
            "questionText": "You get an unexpectedly low insulation resistance result on a circuit that you believe should be well-separated. What should you do before concluding the circuit is faulty?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Re-prove the tester (IR function) and re-check leads/settings",
              "Re-prove and verify the tester and leads",
              "Re-prove, check the setup, then re-test"
            ],
            "hint": "Apply the Prove → Test → Re-prove logic when a result doesn’t match your circuit map."
          }
        ]
      }
    },
    {
      "id": "204-11B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "questions": [
          {
            "id": "204-11B-INT-1",
            "questionText": "You are testing a training rig. You prove continuity and get a stable very low Ω result. You then test the circuit and get 'Open Circuit' (O.C). While moving to the next point, you accidentally drop your tester. Explain the steps you must take before you can trust and record the 'Open Circuit' reading you just saw.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": "Re-prove the tester immediately (starting with the continuity proving condition) because the drop could damage the tester, leads, or probe connections. If the prove is healthy and stable again, then re-test the circuit point to confirm the Open Circuit result and then record it. If the prove is not healthy, fix/replace leads or tester before trusting any circuit readings.",
            "hint": "Use the Prove → Test → Re-prove logic and consider what a drop could change."
          }
        ]
      }
    },
    {
      "id": "204-11B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Spaced Review",
        "questions": [
          "What is the unit of measurement for Insulation Resistance? (from 204-10A)",
          "Define 'Continuity' in the context of an electrical circuit. (from 204-10B)",
          "Why must we isolate a circuit before performing dead tests? (from 204-11A)",
          "With probes touched together (or after nulling), what kind of reading would you expect on a continuity/ohms test? (General Principles)"
        ],
        "notes": "Reviewing units of resistance, basic definitions, and safe testing prerequisites."
      }
    }
  ],
  "metadata": {
    "created": "2026-01-28",
    "updated": "2026-01-28",
    "version": "1.0",
    "author": "C&G 2365 Learning Team"
  }
}
