{
  "id": "210-1A",
  "title": "210.1A — Site Management and Trade Roles",
  "description": "Learn about Site Management and Trade Roles in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Management and Trade Roles",
  "learningOutcomes": [
    "Identify the key professional roles that constitute a site management team.",
    "Describe the primary purpose and responsibilities of design-phase roles such as the Architect and Structural Engineer.",
    "Explain the distinct functions of site-based management roles including the Clerk of Works and Contracts Manager.",
    "Distinguish between the financial and procurement responsibilities of the Quantity Surveyor, Estimator, and Buyer."
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "210-1A-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the key professional roles that constitute a site management team.",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the primary purpose and responsibilities of design-phase roles such as the Architect and Structural Engineer.",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the distinct functions of site-based management roles including the Clerk of Works and Contracts Manager.",
            "bloomLevel": "understand"
          },
          {
            "text": "Distinguish between the financial and procurement responsibilities of the Quantity Surveyor, Estimator, and Buyer.",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1A-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Quantity Surveyor",
            "definition": "A professional responsible for managing all financial and contractual aspects of a project to ensure it stays within budget."
          },
          {
            "term": "Estimator",
            "definition": "A specialist who calculates the projected costs of materials, labor, and equipment for a tender, focusing on the pre-construction phase rather than ongoing financial management."
          },
          {
            "term": "Clerk of Works",
            "definition": "A site-based inspector who ensures that work is carried out to the required quality and specification, acting as the client's representative on-site."
          },
          {
            "term": "Contracts Manager",
            "definition": "An individual who manages the legal and administrative requirements of one or more projects, focusing on high-level coordination rather than day-to-day site supervision."
          },
          {
            "term": "Buyer",
            "definition": "A procurement officer responsible for sourcing and ordering the materials and plant equipment needed for a project at the best possible value."
          }
        ]
      }
    },
    {
      "id": "210-1A-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Site Management and Trade Roles Diagram",
        "description": "Visual representation of Site Management and Trade Roles",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "architect-design",
          "structural-engineer-integrity",
          "quantity-surveyor-budget",
          "clerk-of-works-quality",
          "contracts-manager-admin"
        ],
        "placeholderText": "A hierarchical flowchart showing the relationship between roles. At the top are the Architect and Structural Engineer (Design). Below them, the Quantity Surveyor and Contracts Manager bridge the gap between office and site. At the site level, the Project Manager and Clerk of Works are shown overseeing the physical progress and quality, with arrows indicating the flow of information and quality reporting."
      }
    },
    {
      "id": "210-1A-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Design and Financial Control Roles",
        "content": "### In this lesson\nYou will learn to identify the professional roles responsible for the planning and financial health of a technical project. This knowledge is essential for understanding how a project moves from a concept to a costed reality. \n\n* The specific functions of the Architect and Structural Engineer in the design phase.\n* The distinction between the pre-construction work of an Estimator and the ongoing management of a Quantity Surveyor.\n* The procurement role of the Buyer in securing resources.\n\n**What this is**\nThe professional roles in the site management team are divided into those who design the project and those who control the resources required to build it. An **Architect** provides the primary design and aesthetic vision, while a **Structural Engineer** ensures the design is physically viable and safe. Supporting them is the **Surveyor**, who maps the physical environment to provide accurate data for the design. On the financial side, the **Estimator**, **Quantity Surveyor**, and **Buyer** form a chain of cost control that ensures the project is profitable and stays within its budget.\n\n**Why it matters**\nWithout these roles, projects would lack a clear plan or financial boundaries. A design that looks good but cannot support its own weight is useless, just as a project that runs out of money halfway through is a failure. Understanding who manages the money and who manages the drawings allows technical staff to know exactly where to direct queries regarding changes or material availability.\n\n**Key facts / rules**\n* The Architect is the lead designer and often the first point of contact for the client.\n* A Structural Engineer focuses on the internal strength and load-bearing capacity of the project.\n* An **Estimator** works primarily before the project starts to win the contract.\n* A **Quantity Surveyor** manages the budget and legal contracts throughout the entire duration of the build.\n* A **Buyer** is responsible for the actual procurement of physical items and equipment.\n\n**When to choose it**\nSelection of these roles depends on the project lifecycle stage. You look to the Architect and Structural Engineer during the \"vision\" stage to define what is being built. In many cases, you rely on the **Estimator** during the bidding stage to determine if a project is financially feasible. Once the project is live, you turn to the **Quantity Surveyor** to handle financial disputes or variations and the **Buyer** when specific materials are needed on-site. \n\nTypically, if a project requires a complex physical skeleton, a Structural Engineer is mandatory. If the project involves thousands of individual components, a **Buyer** is essential to manage the supply chain efficiently.\n\n**Common mistakes**\nLearners often confuse the **Estimator** with the **Quantity Surveyor**; an **Estimator** is focused on the initial price to win a job, whereas a **Quantity Surveyor** is a professional responsible for managing all financial and contractual aspects of a project to ensure it stays within budget once it has started.\n\nMisconceptions (targeted):\n* Misconception: The Architect is responsible for making sure the structure doesn't fall down. | Correction: While the Architect designs the shape, the Structural Engineer is specifically responsible for the load-bearing integrity. | AC: 210.LO1.AC1.1\n* Misconception: The Buyer decides what materials are needed. | Correction: The design team specifies the materials; the Buyer's role is to source and order them at the best value. | AC: 210.LO1.AC1.2\n\n**Key Points**\n* Architects and Structural Engineers translate ideas into technical drawings.\n* The **Estimator** provides the initial price; the **Quantity Surveyor** manages the actual spend.\n* The **Buyer** acts as the procurement officer for the project.\n* Surveyors provide the physical data that all other designers rely on.\n\n**Quick recap**\nThe design and financial team ensures a project is both physically possible and financially sound. The Architect and Structural Engineer handle the \"how it looks and stands,\" while the **Estimator**, **Quantity Surveyor**, and **Buyer** manage the \"how much it costs and where it comes from.\"\n\n### Coming Up Next\nWe will examine the site-based management roles that turn these designs and budgets into a physical reality on the ground."
      }
    },
    {
      "id": "210-1A-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Design and Financial Control Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1A-C1-L1-A",
            "questionText": "Which professional role focuses specifically on the internal strength and load-bearing capacity of the project?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Structural Engineer",
              "A Structural Engineer",
              "The Structural Engineer"
            ],
            "hint": "This role ensures the design is physically viable and safe."
          },
          {
            "id": "210-1A-C1-L1-B",
            "questionText": "At what stage of the project does an Estimator primarily work to win the contract?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Before the project starts",
              "Pre-construction",
              "Initial stage",
              "The bidding stage"
            ],
            "hint": "They determine if a project is financially feasible before it begins."
          },
          {
            "id": "210-1A-C1-L1-C",
            "questionText": "While an Estimator sets the initial price, which professional manages all financial and contractual aspects once the project has started?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quantity Surveyor",
              "A Quantity Surveyor",
              "The Quantity Surveyor"
            ],
            "hint": "This role manages the budget throughout the entire duration of the build."
          },
          {
            "id": "210-1A-C1-L2",
            "questionText": "Using your answers to Q1 (Structural Engineer), Q2 (Estimator timing), and Q3 (Quantity Surveyor), explain how these roles work together to ensure a project's success. Why must the financial roles coordinate with the structural design?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The Structural Engineer ensures the project is physically viable and safe",
              "The Estimator and Quantity Surveyor provide the financial boundaries for the design",
              "The project moves from a costed bid (Estimator) to a managed reality (Quantity Surveyor)",
              "Financial roles ensure the structural requirements stay within budget to avoid project failure"
            ],
            "expectedAnswer": [
              "The Structural Engineer defines the internal strength needed for the project, while the Estimator sets the initial price to win the job and the Quantity Surveyor manages that budget during construction. This coordination matters because a safe design is useless if the project runs out of money halfway through.",
              "A project requires the Structural Engineer to ensure it is physically possible, but it also needs the Estimator to price it before starting and the Quantity Surveyor to manage the spend once live. These roles connect because the financial team manages the resources that the structural team requires to build a safe structure."
            ],
            "hint": "Consider how the physical design and the money management prevent the project from failing."
          }
        ]
      }
    },
    {
      "id": "210-1A-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Site Operations and Management Roles",
        "content": "### In this lesson\nYou will learn to distinguish between the various roles responsible for the day-to-day execution and quality control of a project. This clarifies who is in charge of the physical site versus who handles the high-level administration.\n\n* The role of the Project Manager in overall site coordination.\n* The specific quality-assurance function of the **Clerk of Works**.\n* The administrative and legal focus of the **Contracts Manager**.\n\n**What this is**\nSite operations involve the practical management of labor, quality, and safety. The Project Manager is the central figure who oversees the entire site's progress. They are supported by the **Clerk of Works**, a site-based inspector who ensures that work is carried out to the required quality and specification, acting as the client's representative. Meanwhile, the **Contracts Manager** is an individual who manages the legal and administrative requirements of one or more projects, focusing on high-level coordination rather than day-to-day site supervision. Specialist input is provided by the **Building Services Engineer**, who integrates complex systems like power, water, and ventilation into the build.\n\n**Why it matters**\nOn a busy site, clear lines of authority prevent errors. If a technician is unsure if a specific installation meets the client's standards, they must know that the **Clerk of Works** is the person to ask. If there is a dispute about the scope of work defined in the legal agreement, the **Contracts Manager** is the appropriate contact. Identifying these roles prevents delays and ensures the final product is safe and compliant.\n\n**Key facts / rules**\n* The Project Manager has overall responsibility for site safety and deadlines.\n* The **Clerk of Works** focuses purely on quality and adherence to the original plans.\n* A **Contracts Manager** often looks after multiple sites simultaneously from an office.\n* **Building Services Engineers** focus on the \"life support\" systems of a building (e.g., heating, lighting).\n* The **Clerk of Works** reports directly to the client or architect, not the site contractor.\n\n**When to choose it**\nYou identify the Project Manager as the primary contact for daily site issues or scheduling. You look to the **Clerk of Works** when a specific quality check is required before a section of work is covered up. The **Contracts Manager** is chosen when high-level resource issues arise, such as a need for more staff across several projects or a legal clarification of the contract terms. \n\nIn a scenario where a technician installs 50 meters of cabling, the Project Manager ensures they have the time to do it, while the **Clerk of Works** inspects the work to ensure it matches the technical specification exactly.\n\n**Common mistakes**\nLearners often confuse the **Clerk of Works** with the **Contracts Manager**; the **Clerk of Works** is a site-based inspector focusing on quality, whereas the **Contracts Manager** is an individual who manages the legal and administrative requirements, often from off-site.\n\nMisconceptions (targeted):\n* Misconception: The Project Manager is responsible for checking every single screw for quality. | Correction: The Project Manager manages the timeline and resources; the Clerk of Works is the specialist dedicated to quality inspection. | AC: 210.LO1.AC1.1\n* Misconception: Building Services Engineers only work on repairs. | Correction: They are involved in the design and installation phase of all essential internal systems. | AC: 210.LO1.AC1.2\n\n**Key Points**\n* The Project Manager coordinates the daily workflow and safety.\n* The **Clerk of Works** acts as the client's \"eyes and ears\" for quality.\n* The **Contracts Manager** handles the high-level legal and business side of the project.\n* **Building Services Engineers** manage the integration of technical systems.\n\n**Quick recap**\nSite management is a balance between production and protection. The Project Manager drives the production (speed and safety), while the **Clerk of Works** provides protection for the client (quality and specs). The **Contracts Manager** ensures the entire operation stays within the legal and administrative boundaries of the agreement.\n\n### Coming Up Next\nNow that you can identify the management team, we will look at the communication methods they use to keep the project moving."
      }
    },
    {
      "id": "210-1A-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Site Operations and Management Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1A-C2-L1-A",
            "questionText": "Which site-based role focuses purely on quality and adherence to the original plans?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Clerk of Works",
              "A Clerk of Works",
              "The Clerk of Works"
            ],
            "hint": "This person acts as the client's representative for inspection."
          },
          {
            "id": "210-1A-C2-L1-B",
            "questionText": "To whom does the Clerk of Works report directly to ensure independent quality assurance?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Client or architect",
              "The client",
              "The architect"
            ],
            "hint": "They do not report to the site contractor."
          },
          {
            "id": "210-1A-C2-L1-C",
            "questionText": "Where does a Contracts Manager typically perform their role of managing multiple sites simultaneously?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "From an office",
              "An office",
              "Off-site"
            ],
            "hint": "They focus on high-level administration rather than day-to-day site supervision."
          },
          {
            "id": "210-1A-C2-L2",
            "questionText": "Using your answers to Q1 (Clerk of Works focus), Q2 (Clerk of Works reporting), and Q3 (Contracts Manager location), explain how quality and administration are managed. How do we know the Clerk of Works provides an independent check on the project?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The Clerk of Works inspects the physical site for quality and plan adherence",
              "The Contracts Manager handles legal and administrative tasks from an office",
              "Independent quality is ensured because the Clerk of Works reports to the client or architect instead of the contractor",
              "This separation prevents the site contractor from bypassing quality standards for speed or profit"
            ],
            "expectedAnswer": [
              "The Clerk of Works ensures quality on-site while the Contracts Manager handles the legal side from an office. We know the Clerk of Works is independent because they report to the client or architect rather than the contractor, ensuring that quality is checked against the original plans without contractor influence.",
              "Quality is managed by the Clerk of Works reporting to the client, while administration is handled off-site by the Contracts Manager. This relationship ensures that the client's interests are protected through independent site inspections that are separate from the contractor's management team."
            ],
            "hint": "Think about how the reporting structure of the quality inspector differs from the administrative manager."
          }
        ]
      }
    },
    {
      "id": "210-1A-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1A-P1",
            "questionText": "Which professional is primarily responsible for calculating the projected costs to win a contract before any physical work begins?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Estimator",
              "The Estimator"
            ],
            "hint": "This role is focused on the bidding and pre-construction phase."
          },
          {
            "id": "210-1A-P2",
            "questionText": "What must be true about the reporting line of a Clerk of Works to ensure they provide an unbiased assessment of project quality?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Report to client",
              "Reports to client"
            ],
            "hint": "This person acts as the client's representative and does not report to the site contractor."
          },
          {
            "id": "210-1A-P3",
            "questionText": "A project requires 5,000 specialized components to be sourced from multiple international suppliers at the best possible price. Which role is responsible for the actual procurement and ordering of these items?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Buyer",
              "The Buyer"
            ],
            "hint": "This person acts as the procurement officer for the project."
          },
          {
            "id": "210-1A-P4",
            "questionText": "In a project team consisting of an Architect, a Structural Engineer, an Estimator, and a Quantity Surveyor, how many of these roles are specifically responsible for the ongoing management of the budget once construction has started?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "Identify the role that manages financial and contractual aspects throughout the build duration."
          },
          {
            "id": "210-1A-P5",
            "questionText": "If a technician is concerned that the load-bearing capacity of a support frame is insufficient for the planned equipment weight, which professional's drawings should they consult?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Structural Engineer",
              "The Structural Engineer"
            ],
            "hint": "This role focuses on the internal strength and physical integrity of the project."
          }
        ]
      }
    },
    {
      "id": "210-1A-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1A-INT-1",
            "questionText": "Explain the relationship between the pre-construction financial planning and the ongoing quality control during the project execution phase. In your answer, include: (1) the role of the Estimator in setting project parameters, (2) the function of the Clerk of Works in monitoring site output, and (3) how the Quantity Surveyor bridges these two areas. Why must the financial management team rely on site-based quality reports to maintain project viability? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies the Estimator’s role in establishing the initial cost baseline and resource requirements.",
              "Describes the Clerk of Works’ responsibility for ensuring physical work matches technical specifications.",
              "Explains how the Quantity Surveyor uses site data to manage the budget and authorize payments.",
              "Reasons that financial viability depends on quality reports because substandard work leads to unbudgeted remedial costs.",
              "Demonstrates understanding of the feedback loop between site inspections and financial control."
            ],
            "expectedAnswer": [
              "The Estimator establishes the initial budget based on design specifications, which the Clerk of Works then uses as a benchmark to ensure site quality meets standards. The Quantity Surveyor bridges these roles by comparing the physical progress and quality reported on-site against the financial forecast to manage cash flow. This relationship holds because if quality is not verified by the Clerk of Works, the Quantity Surveyor cannot accurately value the work, leading to potential financial loss through rework or overpayment.",
              "Initial cost parameters set by the Estimator define the resources available for the Clerk of Works to monitor during the construction phase. The Quantity Surveyor relies on these quality checks to ensure that the project remains within the financial boundaries established during pre-construction. This is essential because any deviation from the quality standards identified by the Clerk of Works directly impacts the financial valuations and budget stability managed by the Quantity Surveyor."
            ],
            "hint": "Think about how the initial budget is protected by ensuring the work is done correctly the first time."
          },
          {
            "id": "210-1A-INT-2",
            "questionText": "Analyze how the integration of design, procurement, and site management roles ensures that a technical project is completed to specification. In your answer, include: (1) the impact of the Architect’s and Engineer’s specifications on the Buyer’s activities, (2) the coordination between the Project Manager and the Contracts Manager, (3) the verification role of the Clerk of Works, and (4) how the Quantity Surveyor synthesizes this information for financial control. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Connects design specifications (Architect/Engineer) to the procurement of correct materials (Buyer).",
              "Explains the synergy between operational execution (Project Manager) and legal/administrative compliance (Contracts Manager).",
              "Identifies the Clerk of Works as the primary agent for quality assurance and specification adherence.",
              "Describes the Quantity Surveyor’s role in aggregating data from all roles to manage project costs.",
              "Evaluates the necessity of inter-departmental communication for risk mitigation.",
              "Recognizes that procurement depends on technical design accuracy to avoid resource waste.",
              "Demonstrates how site management roles ensure that the physical build reflects the contractual and financial plan."
            ],
            "expectedAnswer": [
              "Project success is achieved when the Architect’s technical designs dictate the Buyer’s procurement, ensuring all materials meet the engineering requirements. The Project Manager then coordinates these resources on-site while the Contracts Manager ensures all actions comply with legal obligations. Finally, the Clerk of Works verifies that the execution matches the design, providing the Quantity Surveyor with the necessary data to control costs and approve payments based on verified progress.",
              "The integration of roles ensures project viability through the following: \n- The Architect and Engineer provide the technical blueprints that guide the Buyer’s procurement of specific resources.\n- The Project Manager handles daily site operations while the Contracts Manager oversees the legal and administrative framework.\n- The Clerk of Works monitors quality against the design, which allows the Quantity Surveyor to accurately manage the budget and financial reporting.",
              "Effective project delivery relies on the Architect’s design setting the standard for the Buyer’s procurement and the Project Manager’s site coordination. The Contracts Manager and Clerk of Works provide the necessary oversight to ensure that work is performed legally and to the required quality. This collective data allows the Quantity Surveyor to maintain financial control, ensuring that every expense aligns with the physical and technical progress of the site."
            ],
            "hint": "Consider how information flows from the design office to the procurement department and finally to the physical site."
          }
        ]
      }
    },
    {
      "id": "210-1A-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1A-SR-1",
            "questionText": "What term describes the group of professional roles responsible for the overall coordination and leadership of a project site?",
            "expectedAnswer": [
              "Site management team",
              "Management team",
              "Project management team"
            ],
            "hint": "This group oversees the daily operations and management of the site.",
            "answerType": "short-text"
          },
          {
            "id": "210-1A-SR-2",
            "questionText": "What is the term for the mandatory legal acts and official regulations that must be followed within a professional environment?",
            "expectedAnswer": [
              "Statutory legislation",
              "Legislation",
              "Statutory laws"
            ],
            "hint": "These are legal requirements set by the government.",
            "answerType": "short-text"
          },
          {
            "id": "210-1A-SR-3",
            "questionText": "What term refers to the different techniques and systems used to exchange information between team members on a project?",
            "expectedAnswer": [
              "Communication methods",
              "Communication",
              "Communication types"
            ],
            "hint": "This involves how data and instructions are shared effectively.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Site Management and Trade Roles"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1"
      ],
      "outOfScopeAC": [
        "AC2",
        "AC3",
        "AC4"
      ]
    },
    "scope": {
      "inScope": "Definitions and key responsibilities of specific professional roles within the site management hierarchy.",
      "outOfScope": "Practical communication methods, site documentation procedures, or technical trade-specific tasks.",
      "rationale": "Establishing a clear understanding of 'who is who' is a prerequisite for understanding organizational communication and site hierarchy."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus exclusively on the definitions and purposes of the listed site management personnel."
    },
    "misconceptions": [
      {
        "misconception": "The Architect is responsible for making sure the structure doesn't fall down.",
        "correction": "While the Architect designs the shape, the Structural Engineer is specifically responsible for the load-bearing integrity.",
        "relatedAC": "210.LO1.AC1.1"
      },
      {
        "misconception": "The Project Manager is responsible for checking every single screw for quality.",
        "correction": "The Project Manager manages the timeline and resources; the Clerk of Works is the specialist dedicated to quality inspection.",
        "relatedAC": "210.LO1.AC1.1"
      },
      {
        "misconception": "The Buyer decides what materials are needed.",
        "correction": "The design team specifies the materials; the Buyer's role is to source and order them at the best value.",
        "relatedAC": "210.LO1.AC1.2"
      }
    ]
  }
}