{
  "id": "210-1B",
  "title": "210.1B — Site Management Team and Reporting Roles",
  "description": "Learn about the key roles within a site management team and the reporting lines for individuals on a construction site.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Management and Reporting",
  "learningOutcomes": [
    "Identify key roles of the site management team (Project Manager, Site Manager)",
    "Identify key roles of individuals reporting to site management (Supervisors, Admin)",
    "Explain the chain of command and responsibilities on a construction site"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify key roles of the site management team (Project Manager, Site Manager)",
            "bloomLevel": "remember"
          },
          {
            "text": "Identify key roles of individuals reporting to site management (Supervisors, Admin)",
            "bloomLevel": "remember"
          },
          {
            "text": "Explain the chain of command and responsibilities on a construction site",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Project Manager (PM)",
            "definition": "The senior leader responsible for the overall success of the project, focusing on budget, client relations, and long-term scheduling."
          },
          {
            "term": "Site Manager",
            "definition": "The manager responsible for daily site operations, including safety enforcement, logistics, and coordinating work gangs."
          },
          {
            "term": "Chain of Command",
            "definition": "The formal line of authority along which orders are passed down and reports are passed up (e.g., Operative → Supervisor → Site Manager)."
          },
          {
            "term": "Supervisor",
            "definition": "A team leader who directs the work of specific operatives or trades and acts as the first point of contact for technical issues."
          },
          {
            "term": "Quantity Surveyor (QS)",
            "definition": "A professional responsible for managing all costs, contracts, and material quantities on a construction project."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Site Management Team",
        "content": "### In this lesson\nYou will learn the difference between strategic and operational roles on a site. This ensures you know who is responsible for the overall budget versus who handles daily safety and logistics.\n\n*   Identify the **Project Manager** as the strategic lead.\n*   Identify the **Site Manager** as the operational lead.\n*   Understand the role of the **Contract Manager**.\n\n**What this is**\nThe Site Management Team is the group of senior professionals who run the construction project. The two most critical roles to distinguish are the **Project Manager (PM)** and the **Site Manager**.\n\n*   **Project Manager (PM):** Think of the PM as the \"Architect of the Plan.\" They focus on the big picture: the budget, the client relationship, and the master schedule. They are often office-based or split their time between multiple sites.\n*   **Site Manager:** Think of the Site Manager as the \"Captain of the Ship.\" They are permanently on-site, ensuring that the work planned by the PM actually happens safely and correctly today. They manage site access, safety inductions, and material deliveries.\n*   **Contract Manager:** A senior role often overseeing multiple projects, dealing specifically with the legal and commercial terms of the construction contracts.\n\n**Why it matters**\nKnowing the difference prevents communication failures. If you have a question about the daily work plan or a safety hazard, you go to the Site Manager. If you have a question about the overall contract budget or a major design change request from the client, that is a Project Manager issue. Confusing these roles can lead to delays or safety breaches.\n\n**Key facts / rules**\n*   **Project Managers** handle money, clients, and long-term timelines.\n*   **Site Managers** handle daily logistics, health & safety enforcement, and sub-contractor coordination.\n*   **Contract Managers** handle legal agreements and commercial viability across projects.\n*   The Site Manager usually reports to the Project Manager or Contract Manager.\n\n**When to choose it**\n*   **Scenario A:** The client wants to change the type of flooring in the entire building. This affects cost and contracts. **Action:** Refer to the **Project Manager**.\n*   **Scenario B:** A delivery truck has arrived and blocked the fire exit. This is an immediate safety and logistics issue. **Action:** Refer to the **Site Manager**.\n\n**Common mistakes**\nLearners often confuse the Project Manager with the Site Manager. Remember: The **Project Manager** looks at the *spreadsheet* (money/time), while the **Site Manager** looks at the *site* (mud/safety).\n\n**Misconceptions (targeted):**\n*   *Misconception:* The Project Manager is always on site directing traffic. | *Correction:* The PM is often office-based; the Site Manager directs daily traffic and operations. | *AC: 210.LO1.AC1*\n*   *Misconception:* Site Managers negotiate the contract price with the client. | *Correction:* Contract negotiation is for the Project Manager or Quantity Surveyor; Site Managers execute the work. | *AC: 210.LO1.AC1*"
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Management Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "Which role is primarily responsible for the project budget and client relationship?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Project Manager",
              "PM",
              "The Project Manager"
            ],
            "hint": "Think of the person who manages the money and the long-term plan."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Which role is responsible for daily site safety, logistics, and operations?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Manager",
              "Site Agent",
              "The Site Manager"
            ],
            "hint": "Think of the person who is on site every day ensuring work happens safely."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "What is the term for the manager who oversees legal and commercial aspects across multiple projects?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Contract Manager",
              "Contracts Manager"
            ],
            "hint": "This person deals with the contracts and commercial terms."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Explain the primary difference between a Project Manager and a Site Manager in terms of their focus.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Project Manager focuses on strategy, budget, and client relations.",
              "Site Manager focuses on daily operations, safety, and logistics.",
              "PM is often office-based; SM is site-based."
            ],
            "expectedAnswer": [
              "The Project Manager focuses on the strategic aspects like budget and client relations, whereas the Site Manager focuses on the operational aspects like daily safety and logistics.",
              "A Project Manager deals with the long-term plan and money, while the Site Manager deals with the immediate work and safety on the ground."
            ],
            "hint": "Compare 'strategy/money' with 'daily operations/safety'."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Reporting Lines and Supervision",
        "content": "### In this lesson\nYou will learn about the roles that report to the site management team. This clarifies the **Chain of Command**, ensuring you know who to speak to first when you have an issue.\n\n*   Identify the role of the **Supervisor** or **Foreman**.\n*   Understand the function of **Site Administration**.\n*   Recognise the **Quantity Surveyor's** role in cost tracking.\n\n**What this is**\nBelow the senior management, there are specific roles that ensure the work gets done. This structure is called the **Chain of Command**.\n\n*   **Supervisor / Foreman:** These are the \"boots on the ground\" leaders. They direct specific gangs (e.g., the electrical team) and are the first point of contact for operatives. They ensure the quality of work matches the drawings.\n*   **Site Administrator:** Responsible for the paperwork, such as filing timesheets, ordering stationery, and maintaining induction records. They report to the Site Manager.\n*   **Quantity Surveyor (QS):** They count (\"survey\") materials and manage costs. They ensure the company gets paid for the work done. They often report to the Commercial/Contract Manager but work closely with the Site Manager.\n*   **Operatives:** The skilled tradespeople (electricians, plumbers) who report to their Supervisor.\n\n**Why it matters**\nThe Chain of Command ensures efficiency. A Project Manager cannot solve every missing screwdriver issue; that is for the Supervisor. Following the chain ensures that problems are solved at the right level.\n\n**Key facts / rules**\n*   **Operatives** report to **Supervisors**.\n*   **Supervisors** report to the **Site Manager**.\n*   **Site Administrators** support the management team with documentation.\n*   **Quantity Surveyors** manage the financial measurement of the work.\n\n**When to choose it**\n*   **Scenario A:** You are an apprentice and you need a new pair of gloves. **Action:** Ask your **Supervisor**.\n*   **Scenario B:** You need to check if your timesheet was submitted correctly. **Action:** Ask the **Site Administrator**.\n*   **Scenario C:** You need to measure how much cable was installed to bill the client. **Action:** This is a task for the **Quantity Surveyor**.\n\n**Common mistakes**\nLearners often think they should take every problem straight to the Site Manager. In reality, the **Supervisor** is the correct first contact for technical or equipment issues.\n\n**Misconceptions (targeted):**\n*   *Misconception:* The Quantity Surveyor is responsible for checking the safety of the wiring. | *Correction:* The QS checks the *cost* and *quantity*; the Supervisor or Site Manager checks safety and quality. | *AC: 210.LO1.AC2*\n*   *Misconception:* An operative reports directly to the Project Manager. | *Correction:* An operative reports to a Supervisor, who then reports to the Site Manager, following the Chain of Command. | *AC: 210.LO1.AC2*"
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Reporting Lines",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Who is the first point of contact for an operative regarding a daily work issue?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Supervisor",
              "Foreman",
              "The Supervisor"
            ],
            "hint": "This person leads the specific work gang."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which role is responsible for filing timesheets and maintaining site records?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Administrator",
              "Administrator",
              "Admin"
            ],
            "hint": "This person handles the office paperwork on site."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "Which role focuses on measuring materials and managing costs for the work done?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS"
            ],
            "hint": "This person surveys the quantity of work to calculate costs."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Why is it important to follow the Chain of Command (e.g., Operative -> Supervisor -> Site Manager)?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Ensures problems are solved at the correct level.",
              "Prevents senior management from being overwhelmed by minor issues.",
              "Maintains clear communication and efficiency."
            ],
            "expectedAnswer": [
              "Following the Chain of Command ensures that problems are solved at the appropriate level, preventing senior managers from being overwhelmed with minor issues.",
              "It improves efficiency by ensuring that supervisors handle technical tasks while managers focus on site-wide operations."
            ],
            "hint": "Think about efficiency and not wasting the Site Manager's time with minor tool issues."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A site has 4 supervisors. Each supervisor manages a team of 6 operatives. How many total operatives are on the site?",
            "answerType": "numeric",
            "expectedAnswer": [
              "24"
            ],
            "hint": "Multiply the number of supervisors by the number of operatives per team."
          },
          {
            "id": "210-1B-P2",
            "questionText": "State the job role responsible for the overall financial budget and client relationship.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Project Manager",
              "PM"
            ],
            "hint": "This is the strategic lead, not the daily site lead."
          },
          {
            "id": "210-1B-P3",
            "questionText": "An operative notices a safety hazard in their work area. According to the chain of command, who should they report this to first?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Supervisor",
              "Foreman"
            ],
            "hint": "The immediate leader of their work gang."
          },
          {
            "id": "210-1B-P4",
            "questionText": "Which specialist role would a Site Manager consult to confirm the exact volume of concrete required for a bill of quantities?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS"
            ],
            "hint": "The person responsible for measuring quantities and costs."
          },
          {
            "id": "210-1B-P5",
            "questionText": "A project meeting includes 1 Project Manager, 1 Site Manager, 1 Contract Manager, and 4 Supervisors. How many people in this meeting are part of the 'Site Management Team' (excluding the supervisors)?",
            "answerType": "numeric",
            "expectedAnswer": [
              "3"
            ],
            "hint": "Count the managers (PM, SM, CM) but exclude the reporting supervisors."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain the relationship between the Project Manager and the Site Manager. In your answer, include: (1) the primary focus of each role, (2) how they support each other, and (3) why both are needed for a successful project. (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Project Manager focuses on strategy/budget; Site Manager focuses on operations/safety.",
              "PM plans the work; SM executes the work on the ground.",
              "Both are needed to ensure the project is both profitable (PM) and safe/buildable (SM)."
            ],
            "expectedAnswer": [
              "The Project Manager focuses on the strategic budget and client needs, while the Site Manager focuses on daily operational safety and logistics. They support each other because the PM provides the plan and resources, which the SM then executes on the ground. Both are needed to ensure the project stays on budget while being built safely and to quality standards."
            ],
            "hint": "Think 'Strategy vs. Execution'. One plans the war, the other leads the battle."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Describe the flow of information in a Chain of Command when a design error is found by an operative. Trace the path from the Operative up to the Project Manager. Why is this path effective?",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Operative reports to Supervisor.",
              "Supervisor verifies and reports to Site Manager.",
              "Site Manager assesses impact and reports to Project Manager.",
              "Effective because it filters issues: Supervisor handles technical details, PM handles cost/client impact."
            ],
            "expectedAnswer": [
              "The operative reports the error to their Supervisor, who verifies it and escalates it to the Site Manager. The Site Manager then reports the issue to the Project Manager if it affects the budget or timeline. This path is effective because it ensures technical details are checked at the lower levels before the strategic impact is assessed by senior management."
            ],
            "hint": "Start at the bottom (Operative) and move up step-by-step to the top (PM)."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check: Communication Principles",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "What is the first stage of the communication cycle where the sender creates the message?",
            "expectedAnswer": [
              "Encoding",
              "Encode"
            ],
            "hint": "Turning thoughts into words or symbols.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "Identify one form of formal written communication used on site.",
            "expectedAnswer": [
              "Email",
              "Letter",
              "Report",
              "Site Diary",
              "Memo"
            ],
            "hint": "A method that leaves a permanent record.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "State one common barrier to effective communication on a noisy construction site.",
            "expectedAnswer": [
              "Noise",
              "Background noise",
              "Distraction"
            ],
            "hint": "Physical sound that prevents hearing.",
            "answerType": "short-text"
          }
        ],
        "notes": "Review of Unit 210-1A Communication Principles."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1",
        "AC2"
      ],
      "outOfScopeAC": [
        "AC3",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Roles and responsibilities of the Site Management Team (PM, SM) and reporting lines (Supervisors, Admin).",
      "outOfScope": "Specific visitor procedures (AC3) or inspection checklists.",
      "rationale": "The lesson focuses on the internal hierarchy and management structure of the construction team."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": false,
      "specificScope": "Focus on the 'who' and 'why' of management roles."
    },
    "misconceptions": [
      {
        "misconception": "The Project Manager is always on site directing traffic.",
        "correction": "The PM is often office-based; the Site Manager directs daily traffic and operations.",
        "relatedAC": "210.LO1.AC1"
      },
      {
        "misconception": "Site Managers negotiate the contract price with the client.",
        "correction": "Contract negotiation is for the Project Manager or Quantity Surveyor; Site Managers execute the work.",
        "relatedAC": "210.LO1.AC1"
      },
      {
        "misconception": "An operative reports directly to the Project Manager.",
        "correction": "An operative reports to a Supervisor, who then reports to the Site Manager, following the Chain of Command.",
        "relatedAC": "210.LO1.AC2"
      }
    ]
  }
}