{
  "id": "210-1B",
  "title": "210.1B — Site Management and Reporting Roles",
  "description": "Learn about the hierarchy of a construction team, including the roles of the site management team and reporting lines.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Construction team members and roles",
  "learningOutcomes": [
    "Identify key roles of the site management team (AC1.1)",
    "Identify key roles of individuals reporting to site management (AC1.2)",
    "Explain the difference between strategic off-site management and operational on-site management"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify key roles of the site management team (e.g., Contracts Manager, Project Manager)",
            "bloomLevel": "remember"
          },
          {
            "text": "Identify key roles of individuals reporting to site management (e.g., Site Foreman, Quantity Surveyor)",
            "bloomLevel": "remember"
          },
          {
            "text": "Explain the reporting lines and chain of command on a technical site",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Contracts Manager",
            "definition": "A senior manager who oversees multiple projects at a strategic level, focusing on client contracts, budgets, and schedules rather than daily site presence."
          },
          {
            "term": "Project Manager (PM)",
            "definition": "The senior leader permanently based on a specific site, responsible for the day-to-day delivery, safety, and logistics of that single project."
          },
          {
            "term": "Site Foreman",
            "definition": "A supervisor who directs the hands-on work of trade gangs, acting as the link between the management team and the operatives."
          },
          {
            "term": "Quantity Surveyor (QS)",
            "definition": "A professional responsible for managing costs, material orders, and financial contracts, ensuring the project stays within budget."
          },
          {
            "term": "Chain of Command",
            "definition": "The formal line of authority through which instructions pass down (from manager to worker) and information passes up (from worker to manager)."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Site Management Team",
        "content": "### In this lesson\nThis lesson covers the structure of a construction site team. You will learn who is in charge, who handles the money, and who you should talk to if you have a problem.\n\n*   Identify the **Contracts Manager** and **Project Manager**.\n*   Understand the difference between strategic (off-site) and operational (on-site) roles.\n*   Learn why the \"boss\" isn't always the person you see every day.\n\n**What this is**\nThe site management team is the group of professionals responsible for planning and running the project. This is split into two levels: **Strategic** (High-level planning) and **Operational** (Day-to-day running).\n\n1.  **Contracts Manager (Strategic/Off-site)**: This person is like the \"Regional Manager\" of a retail chain. They look after 3 or 4 different sites at once. They visit your site occasionally (e.g., once a week) to check if the project is making money and keeping the client happy. They do not manage the daily work.\n2.  **Project Manager (PM) (Operational/On-site)**: This person is like the \"Store Manager\". They are on your site every single day. They hold the keys, run the morning briefings, and are legally responsible for site safety and progress. If the crane is late or the site is messy, it is the PM's problem.\n\n**Why it matters**\nKnowing who does what prevents confusion. If you have a question about the daily work schedule, asking the visiting Contracts Manager is wrong—they won't know the details. You need the Project Manager. Conversely, if there is a major issue with the client's contract, the Project Manager will escalate it to the Contracts Manager.\n\n**Key facts / rules**\n*   **Contracts Manager**: Multi-site responsibility, focuses on budget and client relations.\n*   **Project Manager**: Single-site responsibility, focuses on safety, logistics, and hitting deadlines.\n*   **Site Agent**: On very large sites, a Site Agent supports the PM by managing specific sections of the work.\n\n**Micro-Scenario**\nImagine a football club. The **Contracts Manager** is the Club Owner/Board—they set the budget and hire the staff but don't play the game. The **Project Manager** is the Head Coach—they are on the sideline every match (day), making decisions to win that specific game.\n\n**Common mistakes**\nLearners often think the Contracts Manager is \"below\" the Project Manager because they aren't on site. In reality, the Contracts Manager is usually senior to the PM and manages the PM's performance.\n\nMisconceptions (targeted):\n*   Misconception: The Project Manager does the physical work. | Correction: The PM manages people and processes; they rarely use tools themselves. | AC: AC1.1\n*   Misconception: You can report problems to anyone in a suit. | Correction: You must follow the chain of command to ensure the right person gets the information. | AC: AC1.2"
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Management Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "Which management role is typically responsible for overseeing multiple projects at once and focuses on client contracts?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Contracts Manager",
              "Contracts mgr",
              "Contract Manager"
            ],
            "hint": "Think of the person who visits occasionally and deals with the business side."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Which manager is permanently based on a single site and is responsible for daily safety and delivery?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Project Manager",
              "PM",
              "Site Project Manager"
            ],
            "hint": "This person is the daily leader on the site, often called the 'Captain of the ship'."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Is the Project Manager's role primarily 'strategic' (off-site planning) or 'operational' (on-site running)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Operational",
              "Operational role",
              "On-site running"
            ],
            "hint": "They deal with the day-to-day operations of the site."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Explain why a large construction company needs both a Contracts Manager and a Project Manager. Why can't one person do both roles?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The Project Manager needs to be on-site daily to manage safety and logistics.",
              "The Contracts Manager needs to oversee the business aspects of multiple sites.",
              "One person cannot physically be in multiple places at once nor handle the workload of daily site running plus high-level client negotiation."
            ],
            "expectedAnswer": [
              "A Project Manager is needed on-site every day to ensure safety and progress, while a Contracts Manager looks after the budgets and contracts for multiple sites. One person cannot do both because they cannot be on a specific site full-time while also travelling to manage other projects and clients.",
              "The roles are split because the Project Manager focuses on the physical build and safety of one site, while the Contracts Manager focuses on the financial success of several sites. Doing both would be too much work and physically impossible."
            ],
            "hint": "Consider the physical location requirements: one needs to be everywhere, the other needs to be right here."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Reporting Lines and Supervision",
        "content": "### In this lesson\nYou will learn about the people who report to the site management team. These are the individuals who bridge the gap between the managers and the trade operatives.\n\n*   Identify the role of the **Site Foreman** and **Quantity Surveyor (QS)**.\n*   Understand the **Chain of Command**.\n*   Learn who to report to for materials, safety, or daily tasks.\n\n**What this is**\nThe Project Manager cannot speak to every single worker individually. Instead, they use a **Chain of Command**. This is a structure where instructions flow down and information flows up.\n\n1.  **Site Foreman / Supervisor**: This is the direct supervisor of the workforce. If you are a plumber or electrician, the Foreman is your boss. They assign your daily tasks, check you are wearing PPE, and solve immediate problems. They report to the Project Manager.\n2.  **Quantity Surveyor (QS)**: The \"Accountant\" of the site. They count materials (quantities) and manage payments. If you need to order 10,000 bricks, the QS checks if it's in the budget. They report to the PM regarding site costs but often have a line to the Commercial team.\n3.  **Ganger**: On larger sites, a \"gang\" of workers (e.g., bricklayers) has a lead hand called a Ganger. The Ganger reports to the Foreman.\n\n**Why it matters**\nFollowing the chain of command is critical for safety and order. If you have a safety concern, you tell your Foreman immediately. If you bypass them and go straight to the Contracts Manager, the immediate hazard might not get fixed quickly, and you undermine the site team's authority.\n\n**Key facts / rules**\n*   **Operative reports to -> Foreman/Ganger**.\n*   **Foreman reports to -> Project Manager**.\n*   **Project Manager reports to -> Contracts Manager**.\n*   **Quantity Surveyor** handles costs, measurements, and payments.\n*   **Admin/Site Secretary** handles paperwork, inductions, and filing.\n\n**Scenario**\nYou are a carpenter. You notice you are running out of timber. You do not call the timber yard yourself, and you do not call the Project Manager. You tell your **Foreman**. The Foreman confirms the need and asks the **Quantity Surveyor** or **Site Agent** to place the order. This ensures the correct amount is ordered and paid for correctly.\n\n**Common mistakes**\nConfusing the **Foreman** with the **Project Manager**. The Foreman is usually outside with the team all day, directing work. The PM is often in the office planning the next week's work and managing legal duties."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Reporting Lines",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Who does a trade operative (e.g., electrician, bricklayer) typically report to directly for daily tasks?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Foreman",
              "Foreman",
              "Supervisor",
              "Ganger"
            ],
            "hint": "This is the person who directly supervises the workforce."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which role is responsible for managing costs, measuring materials, and handling payments?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS",
              "The QS"
            ],
            "hint": "Think of the 'accountant' of the construction site."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "What is the term for the formal line of authority where instructions flow down from manager to worker?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Chain of Command",
              "The chain of command",
              "Reporting line"
            ],
            "hint": "It starts with 'Chain of...'."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Why is it important to follow the chain of command when reporting a non-emergency issue, rather than going straight to the Project Manager?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The Project Manager focuses on the whole site and may be too busy for minor issues.",
              "The Foreman is best placed to solve immediate daily problems quickly.",
              "Bypassing the chain undermines the Foreman's authority and causes confusion."
            ],
            "expectedAnswer": [
              "Following the chain of command ensures that issues are handled by the person most able to fix them quickly, like the Foreman. If everyone went straight to the Project Manager, the PM would be overwhelmed and unable to manage the overall site safety and progress.",
              "It keeps communication organized. The Foreman handles daily tasks and minor issues, allowing the Project Manager to focus on major site responsibilities. Skipping the Foreman can lead to delays and confusion."
            ],
            "hint": "Think about efficiency—what would happen if 50 workers all tried to talk to the Project Manager at the same time?"
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A Contracts Manager oversees 4 different construction sites. Each site has exactly 1 Project Manager. How many Project Managers report to this Contracts Manager?",
            "answerType": "numeric",
            "expectedAnswer": [
              "4"
            ],
            "hint": "One PM per site."
          },
          {
            "id": "210-1B-P2",
            "questionText": "You are working on site and need to check if the correct amount of pipe has been delivered for the budget. Which specific role should you consult?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS"
            ],
            "hint": "This person manages the quantities and costs."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A visitor arrives in a suit. They do not work on site daily but are asking the Project Manager about the overall profit margin of the project. Who is this most likely to be?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Contracts Manager",
              "Commercial Manager"
            ],
            "hint": "The senior manager responsible for the business/contract side."
          },
          {
            "id": "210-1B-P4",
            "questionText": "A Site Foreman supervises 3 separate gangs. Each gang consists of 5 operatives. How many total operatives are under the Foreman's supervision?",
            "answerType": "numeric",
            "expectedAnswer": [
              "15"
            ],
            "hint": "Multiply the number of gangs by the number of workers in each gang."
          },
          {
            "id": "210-1B-P5",
            "questionText": "Who has the ultimate legal responsibility for health and safety on a specific site on a day-to-day basis?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Project Manager",
              "PM",
              "Site Manager"
            ],
            "hint": "The person in charge of the site daily."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Describe the relationship between the Contracts Manager, Project Manager, and Site Foreman. How does an instruction about a budget cut flow down this chain? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Contracts Manager decides the budget cut (Strategic).",
              "Communicates it to the Project Manager (Operational lead).",
              "PM instructs the Foreman to reduce waste or hours (Direct supervision).",
              "Foreman ensures operatives follow the new rule."
            ],
            "expectedAnswer": [
              "The Contracts Manager decides on the budget cut and informs the Project Manager. The Project Manager then plans how to save money on site and instructs the Site Foreman to carry out these changes with the workforce. This ensures the strategic decision is turned into practical action on the ground.",
              "The instruction flows from the top down: The Contracts Manager sets the new budget limit, the Project Manager decides what work to adjust, and the Site Foreman tells the workers what to do differently. Each role translates the instruction for the level below them."
            ],
            "hint": "Start at the top (Strategic) and move down to the bottom (Workforce)."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Imagine a scenario where a Site Foreman is absent. Why might this cause problems for both the Project Manager and the Operatives? Explain the impact on the 'Chain of Command'.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Missing link in the chain.",
              "PM becomes overwhelmed with minor questions from operatives.",
              "Operatives lack direction and supervision.",
              "Safety checks might be missed."
            ],
            "expectedAnswer": [
              "Without the Foreman, the link between management and workers is broken. The Operatives would not have anyone to assign daily tasks or check their work, and the Project Manager would be overwhelmed by minor questions that the Foreman usually handles. This disrupts the chain of command and reduces efficiency and safety.",
              "The Foreman acts as the bridge; without them, the Project Manager has to step down to supervise directly, distracting them from their own duties. Meanwhile, operatives might lack clear instruction or safety supervision, leading to mistakes."
            ],
            "hint": "Think about the gap left in the middle of the hierarchy."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "What term is used to describe legislation that is mandatory and required by law?",
            "expectedAnswer": [
              "Statutory",
              "Statutory legislation",
              "Statute"
            ],
            "hint": "It is a type of legislation identified in your previous lesson.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "Which group is responsible for the day-to-day coordination and oversight of roles on a technical site?",
            "expectedAnswer": [
              "Site management team",
              "Site management",
              "Management team"
            ],
            "hint": "Think of the team that manages the trade roles.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What is the general term for the various ways information is shared and exchanged between people on a site?",
            "expectedAnswer": [
              "Communication methods",
              "Communication",
              "Methods of communication"
            ],
            "hint": "This includes verbal, written, or electronic exchange.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Site Management Roles"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1",
        "AC2"
      ],
      "outOfScopeAC": [
        "AC3",
        "AC4"
      ]
    },
    "scope": {
      "inScope": "Identification of site management roles (Contracts Manager, Project Manager) and reporting lines (Foreman, QS).",
      "outOfScope": "Specific duties of site visitors (AC3) or detailed contract law.",
      "rationale": "Focusing on the management hierarchy ensures learners understand who to report to before learning about external visitors."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": false,
      "specificScope": "Focus on internal site hierarchy"
    },
    "misconceptions": [
      {
        "misconception": "The Project Manager does the physical work.",
        "correction": "The PM manages people and processes; they rarely use tools themselves.",
        "relatedAC": "AC1"
      },
      {
        "misconception": "You can report problems to anyone in a suit.",
        "correction": "You must follow the chain of command to ensure the right person gets the information.",
        "relatedAC": "AC2"
      }
    ]
  }
}