{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn to identify and communicate with regulatory and specialist site visitors.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify the key roles and responsibilities of common site visitors and inspectors",
    "Explain the purpose and authority of HSE and Building Control inspectors on a site",
    "Distinguish between the specific inspection requirements of water and electrical services inspectors"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the key roles and responsibilities of common site visitors and inspectors",
            "bloomLevel": "remember"
          },
          {
            "text": "Explain the purpose and authority of HSE and Building Control inspectors on a site",
            "bloomLevel": "understand"
          },
          {
            "text": "Distinguish between the specific inspection requirements of water and electrical services inspectors",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Health and Safety Executive (HSE)",
            "definition": "The national regulator for workplace health and safety, with the power to inspect sites and stop dangerous work."
          },
          {
            "term": "Building Control Inspector",
            "definition": "A professional who ensures the physical building meets Building Regulations (structural safety, fire safety, insulation)."
          },
          {
            "term": "Statutory Inspection",
            "definition": "A mandatory check required by law. Unlike a client visit, you cannot refuse or reschedule this based on convenience."
          },
          {
            "term": "Enforcement Notice",
            "definition": "A legal order issued by an inspector to force a site to fix a hazard or stop work immediately."
          },
          {
            "term": "Prohibition Notice",
            "definition": "A specific type of enforcement notice that requires an activity to stop immediately due to serious risk."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Regulatory Inspectors: HSE and Building Control",
        "content": "### In this lesson\nYou will learn to identify the two main government-backed inspectors who visit sites. These are not customers; they are regulators with the power to shut you down.\n\n**1. The Health and Safety Executive (HSE)**\nThe HSE is the \"police force\" for workplace safety. Their focus is on the **people** and the **process**. They check if you are working safely (e.g., wearing PPE, using guards on saws).\n*   **Authority:** They can enter any workplace at any reasonable time **without an appointment**.\n*   **Power:** If they see immediate danger, they issue a **Prohibition Notice**. This means work must stop **immediately** (0 minutes delay allowed).\n\n**2. Building Control Inspector**\nBuilding Control focuses on the **product** and the **structure**. They check if the building itself is safe for future users (e.g., are the foundations deep enough? Is the insulation correct?).\n*   **Authority:** They visit at specific **key stages** (e.g., foundation poured, roof complete). You usually call them to arrange these visits.\n*   **Power:** They can order you to tear down work that doesn't meet Building Regulations.\n\n**What is a Statutory Inspection?**\nBoth of these visits are **Statutory Inspections**. \"Statutory\" means \"required by law\". You cannot treat them like a client visit. If a client wants to visit, you can say \"not today.\" If the HSE arrives, you must let them in.\n\n**Concrete Anchor: The Football Match**\n*   Think of the **HSE** as the **Referee**: They watch the players (workers) to make sure they don't hurt each other during the game (the work process).\n*   Think of **Building Control** as the **Stadium Inspector**: They check if the stands (the building) are built strongly enough so they don't collapse on the fans later.\n\n**Micro-Scenario: The Deep Hole**\nImagine you are digging a trench. \n*   If the **HSE** visits, they look at the **shoring** to ensure the walls won't collapse on *you* while you dig.\n*   If **Building Control** visits, they measure the **depth** to ensure the foundation will support the *house* that will be built on top."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Regulatory Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "When is the Health and Safety Executive (HSE) legally permitted to enter a workplace?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Any reasonable time",
              "Without appointment",
              "At any time"
            ],
            "hint": "They do not need to book an appointment."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Which aspect of the project does a Building Control Inspector primarily check?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "The physical structure",
              "Building Regulations",
              "The building",
              "The product"
            ],
            "hint": "Do they check the worker's safety or the building's stability?"
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "What does the term 'Statutory Inspection' imply about a site visit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "It is mandatory",
              "Required by law",
              "Legal requirement",
              "Not optional"
            ],
            "hint": "Is this visit a choice or a legal obligation?"
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Based on the roles defined above, why would a site manager prioritize an unannounced HSE visit over a scheduled client meeting?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE has legal authority to enter without appointment",
              "HSE visits are statutory (mandatory by law)",
              "HSE can issue Prohibition Notices to stop work immediately",
              "Clients do not have legal enforcement powers"
            ],
            "expectedAnswer": [
              "The site manager must prioritize the HSE because they are a statutory regulator with the legal power to enter without appointment and stop work immediately if they find danger. A client meeting is a commercial arrangement, whereas the HSE visit is a legal obligation that carries the risk of prosecution or site closure.",
              "HSE visits are mandatory legal inspections that cannot be refused, unlike client meetings. Since the HSE focuses on immediate safety and has the power to issue enforcement notices, their presence takes precedence over commercial interests."
            ],
            "hint": "Compare the legal power of a regulator to the commercial influence of a client."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Specialist Service Inspectors (Utilities)",
        "content": "### In this lesson\nYou will learn about inspectors who represent utility companies (Water, Gas, Electricity). They are not government officials, but they hold the keys to your project's completion.\n\n**What is a Specialist Service Inspector?**\nThese inspectors verify that your specific installation (pipes, cables) meets the technical standards required to connect to the public network. They protect the **public network**, not your site.\n\n**1. Water Inspector**\n*   **Focus:** Preventing **contamination**. They want to ensure dirty site water cannot flow back into the clean public water mains.\n*   **Key Check:** **Backflow prevention** (valves that stop water reversing) and pipe depth (to prevent freezing).\n\n**2. Electrical Services Inspector**\n*   **Focus:** **Safety and Load**. They ensure your system won't blow the substation fuse or electrocute someone outside.\n*   **Key Check:** **Earthing** (providing a safe path for electricity to the ground) and the intake equipment.\n\n**The 'Gatekeeper' Concept**\nThink of these inspectors as **Passport Control** at an airport. They don't fly the plane (build the site), but they decide if you are allowed to enter the country (connect to the network). If your paperwork (technical standard) isn't perfect, the gate stays closed.\n\n**Why it matters**\nIf you fail these inspections, the utility company will **refuse connection**. You might have a finished building, but without water or power, it is useless. \n\n**Micro-Scenario: The Wrong Pipe**\nA plumber installs a water pipe 500mm deep. The Water Inspector checks the code and sees the requirement is 750mm to prevent frost. The inspector refuses the connection. The plumber must dig it up and start again. The inspector does not fix it for them; they only pass or fail the work."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Specialist Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "What is the primary risk a Water Inspector looks for to protect the public mains?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Backflow",
              "Contamination",
              "Backflow risk"
            ],
            "hint": "The flow of dirty water back into the clean supply."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Who does a Specialist Service Inspector represent?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "The utility provider",
              "The utility company",
              "The service provider",
              "Water or electric company"
            ],
            "hint": "Do they work for the government or the company supplying the resource?"
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "What is the consequence of failing a specialist inspection?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Refusal of connection",
              "No connection",
              "Cannot connect",
              "Delay in connection"
            ],
            "hint": "What will the utility company refuse to do?"
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Using the 'Passport Control' analogy, explain why a Specialist Service Inspector has the authority to stop a project from operating even if the building structure is perfect.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "They control access to the essential resource (network/country)",
              "Without the resource (water/power), the building cannot function",
              "They protect the external network, so they can deny entry to risky sites",
              "Building structural safety does not guarantee utility safety"
            ],
            "expectedAnswer": [
              "Just as passport control can deny entry to a person regardless of how well-dressed they are, a specialist inspector can deny connection to the network regardless of how well-built the structure is. Without the 'visa' (approval) to connect to water or power, the building cannot function, effectively stopping the project from operating.",
              "The inspector controls the connection to the essential utility network. Even if the building is structurally perfect, if the utility installation risks the public network (like a fake passport risks a country), the inspector will refuse connection, rendering the building unusable."
            ],
            "hint": "Focus on what the inspector controls (the connection) versus what the builder controls (the structure)."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "How many primary regulatory bodies (excluding utility providers) were identified as having the legal authority to perform statutory site inspections?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2"
            ],
            "hint": "Count the Health and Safety Executive and the Building Control department."
          },
          {
            "id": "210-1B-P2",
            "questionText": "What two-word legal term describes an inspection that is mandatory by law and cannot be treated as optional?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Statutory inspection",
              "Statutory visit"
            ],
            "hint": "It starts with 'S' and means 'required by statute'."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A site manager is preparing for a final water connection. Which specific type of inspector must approve the installation to prevent backflow?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Water Inspector",
              "Specialist Service Inspector",
              "Water specialist"
            ],
            "hint": "This visitor represents the water utility provider."
          },
          {
            "id": "210-1B-P4",
            "questionText": "If an HSE inspector issues a 'Prohibition Notice' due to immediate danger, how many hours is the site allowed to continue that specific work before stopping?",
            "answerType": "numeric",
            "expectedAnswer": [
              "0"
            ],
            "hint": "Prohibition means 'stop immediately'."
          },
          {
            "id": "210-1B-P5",
            "questionText": "What is the primary focus of a Building Control inspector: the safety of the workers or the compliance of the finished structure?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Compliance of the finished structure",
              "Finished structure",
              "Structure",
              "The structure"
            ],
            "hint": "Think: Product vs. Process."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain the relationship between HSE safety enforcement and the ability of Specialist Inspectors to perform their duties. Why might a utility inspector refuse to enter a site that has failed an HSE check? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE ensures the general site environment is safe for people to walk and work in.",
              "Specialist inspectors are visitors who need a safe environment to perform their checks.",
              "If a site is unsafe (HSE failure), utility companies will not send their staff in.",
              "Therefore, HSE compliance is a prerequisite for getting utility approval."
            ],
            "expectedAnswer": [
              "The HSE ensures the site is safe for people to work on. Specialist inspectors are visitors who require a safe environment to conduct their technical checks. If a site fails HSE safety standards, utility providers will refuse to send their inspectors onto the site to avoid putting their staff at risk, effectively blocking the utility connection.",
              "Utility inspectors cannot perform their duties if the site is dangerous. Because the HSE regulates site safety, a site must meet HSE standards before specialist inspectors will agree to visit. An unsafe site prevents the specialist inspection from happening."
            ],
            "hint": "Think about the utility inspector as a person who needs to be kept safe while they visit."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Analyze how the three main inspectors (HSE, Building Control, Specialist) cover different risks. Match each inspector to the specific group they are primarily protecting: (1) The Site Workers, (2) The Future Building Users, (3) The Public Utility Network.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "HSE protects the Site Workers (Process safety).",
              "Building Control protects the Future Building Users (Structural integrity).",
              "Specialist Inspector protects the Public Utility Network (Contamination/Faults).",
              "Together they ensure total safety across the project lifecycle."
            ],
            "expectedAnswer": [
              "1. The HSE protects the Site Workers by enforcing safe working practices during construction.\n2. Building Control protects the Future Building Users by ensuring the structure is built to regulations.\n3. The Specialist Inspector protects the Public Utility Network by ensuring site connections do not cause backflow or electrical faults.",
              "HSE = Site Workers (Safety during work).\nBuilding Control = Future Users (Safety of the finished building).\nSpecialist Inspector = Public Network (Safety of the external supply)."
            ],
            "hint": "Who gets hurt if the HSE fails? Who gets hurt if the building collapses later? Who gets hurt if dirty water flows back into the mains?"
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "What role is typically responsible for the overall day-to-day management of the site team?",
            "expectedAnswer": [
              "Site Manager",
              "Project Manager",
              "Site Supervisor"
            ],
            "hint": "The person in charge of operations.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What term describes mandatory laws that must be followed?",
            "expectedAnswer": [
              "Statutory legislation",
              "Legislation",
              "Statutes"
            ],
            "hint": "Laws passed by parliament.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "Which communication method provides a permanent legal record?",
            "expectedAnswer": [
              "Written",
              "Email",
              "Formal report"
            ],
            "hint": "Not verbal.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Site Visitors and Inspectors"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC3"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2"
      ]
    },
    "scope": {
      "inScope": "Identification and purpose of AC3 site inspectors (HSE, Building Control, Utility Specialists).",
      "outOfScope": "AC1 and AC2 roles (Site Manager, Project Manager) are covered in previous lessons.",
      "rationale": "This lesson focuses exclusively on external visitors to avoid confusion with internal management roles."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus exclusively on the identification and role description of the specific visitor types mentioned."
    },
    "misconceptions": [
      {
        "misconception": "The HSE is only there to help and give advice.",
        "correction": "While they provide guidance, the HSE is a regulatory body with the legal authority to prosecute and shut down sites.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "Building Control only cares about the final finished building.",
        "correction": "Building Control must perform a Statutory Inspection at multiple key stages during the build, not just at the end.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "A water inspector is responsible for fixing leaks on your site.",
        "correction": "Their role is only to inspect and verify that your installation meets standards; they do not carry out repair work for you.",
        "relatedAC": "AC3"
      }
    ]
  }
}