{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn to identify site visitors and inspectors, understand their legal authority, and follow entry protocols.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify the key types of inspectors and visitors common to a technical work site",
    "Describe the primary purpose and authority of different regulatory inspectors",
    "Distinguish between the roles of utility inspectors and safety enforcement officers"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the key types of inspectors and visitors common to a technical work site",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the primary purpose and authority of different regulatory inspectors",
            "bloomLevel": "understand"
          },
          {
            "text": "Distinguish between the roles of utility inspectors and safety enforcement officers",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Authority",
            "definition": "An official with legal powers granted by law to enter a site and enforce regulations (like a police officer), unlike a general visitor who needs permission."
          },
          {
            "term": "Building Control",
            "definition": "The regulatory body that checks if the permanent structure meets national building standards (focuses on the 'product')."
          },
          {
            "term": "Health and Safety Executive (HSE)",
            "definition": "The national regulator that enforces workplace safety laws and protects workers (focuses on the 'process' and 'people')."
          },
          {
            "term": "Utility Inspector",
            "definition": "A representative from a service provider (e.g., water, gas, electric) who checks if an installation is safe to connect to the public network."
          },
          {
            "term": "Compliance",
            "definition": "The state of meeting all rules and standards, often proven by a certificate or passing an inspection."
          },
          {
            "term": "Site Access Protocol",
            "definition": "The formal strict procedure (signing in, ID check, safety briefing) that every person must complete before entering a site."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "General Visitors vs. Statutory Authorities",
        "content": "### Who is allowed on site?\nNot everyone on a construction site is there to build. You will often see people who are visiting. It is critical to know *why* they are there and *what rights* they have.\n\n**1. General Visitors**\nThese are people invited to the site, such as clients, delivery drivers, or architects. They have **no legal right** to be there without permission. They must follow all rules and be escorted if necessary.\n\n**2. Statutory Authorities**\nThese are officials with **legal power** (granted by statute/law). Examples include HSE inspectors or Building Control officers. Unlike general visitors, they often have the legal right to enter the site to enforce laws, sometimes without warning.\n\n> **Analogy:** Think of your home. A friend is a **General Visitor**—you invite them in. The Police with a warrant are a **Statutory Authority**—they have a legal right to enter to enforce the law.\n\n### The Gatekeeper: Site Access Protocol\nRegardless of who they are, **everyone** must go through the **Site Access Protocol**. This is the 'check-in' process at the site office.\n\n**The Protocol Steps:**\n1.  **Report to Office:** Do not walk onto the site.\n2.  **Verify Identity:** Show ID. Are they who they say they are?\n3.  **Log In:** Sign the visitor book (for fire safety counts).\n4.  **Induction:** Receive a safety briefing about specific site hazards.\n\n**Why it matters**\nIf a fire alarm sounds, the Site Manager grabs the visitor book. If a visitor didn't sign in, no one knows they are inside burning. This protocol ensures **accountability** and **security**.\n\n**Key Rule:** Never assume someone in high-visibility clothing is authorized. Always check their ID and ensure they have followed the protocol."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Visitors and Access",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "What term describes an official with legal powers of entry that a general visitor does not have?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Statutory Authority",
              "A Statutory Authority",
              "Statutory Authorities"
            ],
            "hint": "This person has legal power granted by legislation (statute)."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "What is the formal procedure called that involves signing in, checking ID, and receiving a briefing?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Access Protocol",
              "Site Access Protocols",
              "access protocol"
            ],
            "hint": "It is the protocol for accessing the site."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "What mandatory briefing must every visitor receive to learn about site hazards?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "safety induction",
              "site induction",
              "site-specific safety induction",
              "induction"
            ],
            "hint": "A short training session or briefing given upon arrival."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Why must a Statutory Authority (like an inspector) still follow the Site Access Protocol even though they have a legal right to enter?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "To ensure they are accounted for in case of emergency (fire roll call)",
              "To verify their identity and credentials (security)",
              "To receive information about current specific hazards (safety)",
              "Legal right to enter does not bypass safety management systems"
            ],
            "expectedAnswer": [
              "Even with legal rights, they must follow the protocol so the site manager knows they are present for emergency roll calls (fire safety). It also allows the manager to verify their ID to ensure they are a genuine official and provide them with a safety induction regarding current site hazards.",
              "They must sign in for safety and security reasons. The site manager needs to know exactly who is on site in case of an emergency evacuation. Also, the manager needs to check their ID to confirm they really are a Statutory Authority."
            ],
            "hint": "Think about fire safety (knowing who is inside) and security (checking they are who they claim to be)."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Types of Inspectors: Who does what?",
        "content": "### The Three Key Inspectors\nDifferent inspectors look for different things. Confusing them can lead to dangerous mistakes or failed projects.\n\n**1. Building Control (The Product)**\n*   **Role:** Checks the **permanent structure**. Is the foundation deep enough? Is the insulation correct? Is the fire exit wide enough?\n*   **Focus:** They care about the **building** itself and whether it meets national standards.\n*   **When:** Structural phases (foundations, walls, completion).\n\n**2. Health and Safety Executive - HSE (The People/Process)**\n*   **Role:** Checks the **safety of workers**. Are people wearing hard hats? Is the scaffolding safe? are chemicals stored correctly?\n*   **Authority:** They have the power to **stop work immediately** if they see danger.\n*   **Focus:** They care about the **people** and the working conditions.\n\n**3. Utility Inspector (The Connection)**\n*   **Role:** Represents companies like Water, Gas, or Electric. They check your installation before connecting it to their mains supply.\n*   **Focus:** They care about **standards of supply**. They won't turn the water on if your pipes leak.\n\n> **Comparison:**\n> *   **Building Control** checks if the *wall* is strong.\n> *   **HSE** checks if the *ladder* you are standing on to build the wall is safe.\n> *   **Utility Inspector** checks if the *pipe* inside the wall is ready for water.\n\n**Compliance**\nCompliance means passing these checks. You achieve compliance when the Building Control officer signs off your certificate, or the Utility Inspector installs the meter. If the HSE visits and finds no issues, you are compliant with safety law."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Inspector Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which regulator focuses on the permanent quality and safety of the building structure?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Building Control",
              "Building Control Body"
            ],
            "hint": "They check if the building meets national construction standards."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which regulator focuses on the safety of the people working on the site and can stop dangerous work?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "HSE",
              "Health and Safety Executive",
              "The HSE"
            ],
            "hint": "They enforce health and safety laws for workers."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "Who must approve an installation before it can be connected to the public mains supply (water/gas/electric)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Utility Inspector",
              "A Utility Inspector",
              "Utility Inspectors"
            ],
            "hint": "A representative from the service provider."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "If an inspector stops work because a trench is not supported properly, which body do they likely represent, and why?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "They represent the HSE (Health and Safety Executive)",
              "The issue is an immediate danger to workers (unsupported trench)",
              "HSE focuses on the safety of the process/people",
              "HSE has the authority to issue stop work orders"
            ],
            "expectedAnswer": [
              "They likely represent the HSE (Health and Safety Executive). This is because an unsupported trench is an immediate safety hazard to the workers inside it. The HSE is responsible for worker safety and has the legal power to stop work if they find dangerous practices.",
              "This would be the HSE. Their role is to ensure the safety of the workforce. Since a collapsing trench could hurt people, the HSE inspector exercises their authority to stop the job until it is made safe."
            ],
            "hint": "Is the issue about the quality of the finished building, or the immediate safety of the workers?"
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "What formal procedure must be completed to verify a visitor's identity and safety awareness before they enter the site?",
            "answerType": "short-text",
            "expectedAnswer": [
              "site access protocol",
              "access protocol",
              "site induction",
              "induction"
            ],
            "hint": "The name of the checking-in process or the safety briefing."
          },
          {
            "id": "210-1B-P2",
            "questionText": "An official arrives to check if a new electrical system meets the standards required to connect to the power grid. What is the title of this inspector?",
            "answerType": "short-text",
            "expectedAnswer": [
              "utility inspector",
              "a utility inspector"
            ],
            "hint": "They work for the power company."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A site log lists: 3 Delivery Drivers, 2 Clients, and 1 HSE Inspector. How many of these people are classified as a 'Statutory Authority'?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "Only the one with legal powers to enforce law is a Statutory Authority. Drivers and clients are general visitors."
          },
          {
            "id": "210-1B-P4",
            "questionText": "An inspector arrives to check the fire rating of a newly built wall. Which regulatory body do they represent?",
            "answerType": "short-text",
            "expectedAnswer": [
              "building control",
              "building control officer"
            ],
            "hint": "They are checking the permanent structure's compliance with building standards."
          },
          {
            "id": "210-1B-P5",
            "questionText": "A site has 10 permanent staff. Today, 5 delivery drivers and 2 inspectors arrive. How many people on site are classified as 'visitors'?",
            "answerType": "numeric",
            "expectedAnswer": [
              "7"
            ],
            "hint": "Visitors are anyone not on the permanent staff (5 drivers + 2 inspectors)."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain the relationship between Site Access Protocols and Statutory Authorities. Why must an HSE inspector show ID and sign in, even if they have the legal right to enter? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Site Access Protocols ensure security and safety for everyone.",
              "Signing in ensures the inspector is accounted for during emergencies (fire roll call).",
              "ID checks prevent imposters from entering sensitive areas.",
              "Statutory Authority gives the right to enter, but protocols manage *how* they enter safely."
            ],
            "expectedAnswer": [
              "The Site Access Protocol manages the safety and security of the site. Even though an HSE inspector has the legal right (Statutory Authority) to enter, they must sign in so the Site Manager knows they are present in case of a fire or emergency evacuation. Checking ID also confirms they are a genuine official and not an unauthorized person posing as one.",
              "Protocols are necessary to verify the identity of the Statutory Authority and ensure they are logged for emergency purposes. If they didn't sign in, the site manager wouldn't know to look for them during a fire alarm. Therefore, the protocol supports the safe exercise of their legal authority."
            ],
            "hint": "Focus on emergency accountability (fire) and verifying that the person is truly who they say they are."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Compare the roles of Building Control, the HSE, and Utility Inspectors. How does the 'focus' of each inspector differ regarding what they look at on site?",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Building Control focuses on the permanent structure (product quality/standards).",
              "HSE focuses on the safety of the workers and processes (people/law).",
              "Utility Inspectors focus on the connection point to public networks (supply standards).",
              "Building Control looks at the building; HSE looks at the way it is built; Utility looks at services."
            ],
            "expectedAnswer": [
              "Building Control focuses on the finished product, ensuring the permanent structure meets building regulations. The HSE focuses on the process and people, ensuring workers are safe and laws are followed during construction. Utility Inspectors focus specifically on the connection to public services, ensuring the installation won't damage the mains supply.",
              "• Building Control: Checks the building's structural integrity and fire safety.\n• HSE: Checks the safety of the workforce and working methods.\n• Utility Inspector: Checks the technical standards for connecting water, gas, or power."
            ],
            "hint": "Think: Structure vs. Worker Safety vs. Grid Connection."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "Who is responsible for the day-to-day running of the site?",
            "expectedAnswer": [
              "site manager",
              "site management",
              "project manager"
            ],
            "hint": "The person in charge of operations.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What do we call the mandatory laws that govern site work?",
            "expectedAnswer": [
              "legislation",
              "statutory legislation",
              "regulations"
            ],
            "hint": "Legal rules created by the government.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What is the general term for passing information between team members?",
            "expectedAnswer": [
              "communication",
              "site communication"
            ],
            "hint": "Speaking, writing, or signaling to others.",
            "answerType": "short-text"
          }
        ],
        "notes": "Review of previous topic: Site Management Roles."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC3"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification and roles of site visitors (AC3) including Building Control, Utility Inspectors, and HSE.",
      "outOfScope": "Detailed inspection procedures, specific regulatory standards (e.g., BS 7671 details), or site management roles (AC1).",
      "rationale": "The lesson focuses on AC3 (Site Visitors) specifically. AC1 and AC2 are covered in separate lessons."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on role identification and purpose of inspectors only"
    },
    "misconceptions": [
      {
        "misconception": "Any person wearing high-visibility clothing has the right to enter a work site.",
        "correction": "Only those who have followed the Site Access Protocol and have a valid reason or legal authority may enter.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "A Utility Inspector can shut down a whole site for safety reasons.",
        "correction": "Only the HSE has the broad legal authority to stop all site work for safety violations; utility inspectors focus on supply standards.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "Building Control is the same as planning permission.",
        "correction": "Building Control is concerned with technical safety and standards, whereas planning permission is concerned with aesthetics and land use.",
        "relatedAC": "AC3"
      }
    ]
  }
}