{
  "id": "210-210-2A1",
  "title": "210.210-2A1 — 1 Identify types of statutory legislation and guidance info:",
  "description": "Learn about 1 Identify types of statutory legislation and guidance info: in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "1 Identify types of statutory legislation and guidance info:",
  "learningOutcomes": [
    "Identify different types of statutory legislation and supporting guidance information.",
    "Explain the purpose of workplace and customer-specific information in a technical environment.",
    "State the importance of following company policies and procedures regarding working relationships."
  ],
  "prerequisites": [
    "210-210-1A1"
  ],
  "blocks": [
    {
      "id": "210-210-2A1-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify different types of statutory legislation and supporting guidance information.",
            "bloomLevel": "remember"
          },
          {
            "text": "Explain the purpose of workplace and customer-specific information in a technical environment.",
            "bloomLevel": "understand"
          },
          {
            "text": "State the importance of following company policies and procedures regarding working relationships.",
            "bloomLevel": "remember"
          }
        ]
      }
    },
    {
      "id": "210-210-2A1-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Legislation",
            "definition": "Mandatory rules of law passed by a legislative body that must be followed to avoid legal penalties, not just optional advice."
          },
          {
            "term": "Guidance Information",
            "definition": "Technical documents that provide advice on how to achieve compliance with legislation, different from law because they offer recommendations rather than mandatory requirements."
          },
          {
            "term": "Approved Code of Practice (ACOP)",
            "definition": "A specialized document that provides practical, step-by-step instructions on how to meet legal duties, where following the code is usually evidence of compliance with the law."
          },
          {
            "term": "Company Policy",
            "definition": "A formal statement of an organization's intent and rules regarding specific workplace issues, behaviors, or safety standards."
          },
          {
            "term": "Procedure",
            "definition": "An established, step-by-step method for performing a task to ensure consistency and safety within a technical environment."
          },
          {
            "term": "Customer Specification",
            "definition": "A detailed document outlining the specific technical requirements, standards, and expectations requested by a client for a particular project or service."
          }
        ]
      }
    },
    {
      "id": "210-210-2A1-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Statutory Legislation and Guidance Information",
        "content": "### In this lesson\nYou will learn how to distinguish between mandatory legal requirements and the advisory documents that support them. This knowledge is essential for ensuring that technical work remains within the boundaries of the law while following best practices. You will identify different types of statutory legislation and supporting guidance information.\n\n**What this is**\nIn any technical field, there is a hierarchy of rules. At the top is **Statutory Legislation**. These are mandatory rules of law passed by a legislative body that must be followed to avoid legal penalties, such as fines or imprisonment. Below this is **Guidance Information**, which consists of technical documents that provide advice on how to achieve compliance with legislation. While guidance is highly recommended, it is different from law because it offers recommendations rather than mandatory requirements. A specific type of guidance is the **Approved Code of Practice (ACOP)**. This is a specialized document providing practical, step-by-step instructions on how to meet legal duties. Following an ACOP is usually considered evidence of compliance with the law in a court setting.\n\n**Why it matters**\nUnderstanding these distinctions (AC2.1) ensures that you do not treat optional advice as law, nor ignore mandatory legal duties. Legislation sets the minimum safety and performance standards that protect the public and workers. Guidance and ACOPs bridge the gap between abstract law and daily tasks, providing a proven way to work safely without having to interpret complex legal jargon yourself.\n\n**Key facts / rules**\n* **Statutory Legislation** is non-negotiable and applies to everyone within the jurisdiction.\n* Failure to follow legislation can result in criminal prosecution.\n* **Guidance Information** is often published by regulatory bodies to explain \"best practice.\"\n* An **Approved Code of Practice (ACOP)** has a special legal status; if you are prosecuted, you must prove you did something at least as good as the ACOP.\n* Always verify the current edition or version of a document, as laws and guidance are frequently updated.\n* Legislation often uses words like \"must\" or \"shall,\" whereas guidance uses \"should\" or \"may.\"\n\n**How to recognise it**\nTo identify these documents, look for specific markers. **Statutory Legislation** will usually have a year and a formal title (e.g., \"The Health and Safety at Work etc. Act\"). It is written in a formal, legalistic tone. **Guidance Information** is often identified by titles like \"Notes for Guidance\" or \"Best Practice Guide\" and usually contains more diagrams and helpful explanations. An **Approved Code of Practice (ACOP)** will be explicitly labeled as such on the cover and often references the specific piece of legislation it supports.\n\nAn everyday anchor for this is the rules of the road. The requirement to stop at a red light is like **Statutory Legislation** (it is the law). A handbook on how to drive fuel-efficiently is like **Guidance Information** (it is good advice, but you won't be arrested for ignoring it).\n\n*Micro-scenario: Consider two technicians. Technician A ignores a mandatory safety law, while Technician B ignores a guidance note on tool maintenance. Technician A is liable for legal prosecution, whereas Technician B is likely only failing to follow best practice.*\n\n**Common mistakes**\nLearners often confuse **Statutory Legislation** with **Guidance Information**; **Statutory Legislation** is a mandatory legal requirement that carries penalties for non-compliance, whereas **Guidance Information** is advisory material designed to help you meet those legal goals. \n\nMisconceptions (targeted):\n* Misconception: Guidance documents are just optional suggestions that can be ignored without consequence. | Correction: While not law, following guidance is the standard way to prove you are working safely; ignoring it makes you legally vulnerable. | AC: AC2.1\n* Misconception: An ACOP is exactly the same as a standard guidance note. | Correction: An ACOP has a higher legal status and can be used in court as evidence of whether a law was broken. | AC: AC2.1\n\n**Key Points**\n* Legislation is mandatory; guidance is advisory.\n* ACOPs provide a \"safe harbor\" for meeting legal duties.\n* Always check for the most recent version of any regulatory document.\n* Identifying the type of document determines the level of legal obligation.\n\n**Quick recap**\nTechnical work is governed by a mix of mandatory laws and helpful advice. **Statutory Legislation** provides the legal framework that must be followed. **Guidance Information** and **Approved Codes of Practice (ACOP)** provide the practical roadmap to help you stay compliant and work to a high standard.\n\n### Coming Up Next\nWe will look at how internal company documents and specific customer requirements direct your daily professional activities."
      }
    },
    {
      "id": "210-210-2A1-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Statutory Legislation and Guidance Information",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-210-2A1-C1-L1-A",
            "questionText": "What are the mandatory rules of law passed by a legislative body called?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Statutory Legislation",
              "Legislation",
              "Statutory law"
            ],
            "hint": "These are the non-negotiable rules at the top of the hierarchy."
          },
          {
            "id": "210-210-2A1-C1-L1-B",
            "questionText": "Which type of document offers recommendations rather than mandatory requirements?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Guidance Information",
              "Guidance",
              "Guidance documents"
            ],
            "hint": "This information provides advice on how to achieve compliance."
          },
          {
            "id": "210-210-2A1-C1-L1-C",
            "questionText": "What document provides practical step-by-step instructions on how to meet legal duties?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Approved Code of Practice",
              "ACOP",
              "Approved Codes of Practice"
            ],
            "hint": "This is a specialized document used as evidence of compliance in court."
          },
          {
            "id": "210-210-2A1-C1-L2",
            "questionText": "Using your answers to Q1 (Statutory Legislation), Q2 (Guidance Information), and Q3 (Approved Code of Practice), why must a technician understand the relationship between these three document types to work safely?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Legislation sets the mandatory legal boundaries and penalties",
              "Guidance and ACOPs provide the practical methods to reach those legal standards",
              "Understanding the hierarchy ensures mandatory duties are not ignored while following best practice",
              "Following an ACOP is the specific way to prove compliance with legislation in court"
            ],
            "expectedAnswer": [
              "A technician needs all three because Statutory Legislation sets the mandatory law, while Guidance Information and ACOPs provide the practical, step-by-step instructions to meet those laws. Why this matters is that ignoring legislation leads to prosecution, but following the advisory guidance or ACOPs provides a safe way to prove you have met your legal duties.",
              "Technicians must identify these because legislation is mandatory law, whereas guidance and ACOPs are advisory documents that show how to comply. This relationship ensures that the technician follows the law by using proven technical advice and practical instructions to avoid legal penalties."
            ],
            "hint": "Think about how the law sets the goal and the guidance provides the roadmap to get there."
          }
        ]
      }
    },
    {
      "id": "210-210-2A1-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Workplace and Customer Information",
        "content": "### In this lesson\nYou will learn how to identify the purpose of internal workplace documents and customer-specific requirements. You will also state the importance of following company policies and procedures regarding working relationships.\n\n**What this is**\nWorkplace information consists of documents created by an employer to manage operations. A **Company Policy** is a formal statement of an organization's intent and rules regarding specific workplace issues, such as safety or conduct. To put these policies into action, an organization uses a **Procedure**, which is an established, step-by-step method for performing a task. Outside of internal rules, you must also follow the **Customer Specification**. This is a detailed document outlining the specific technical requirements and expectations requested by a client for a particular project.\n\n**Why it matters**\nIdentifying the purpose of workplace information (AC2.2) ensures that the organization operates consistently and safely. Following a **Customer Specification** (AC2.3) is vital for meeting the contract requirements and ensuring the client is satisfied with the final result. Furthermore, following company policies and procedures regarding working relationships (AC2.4) prevents conflict and ensures a professional environment where everyone knows their responsibilities.\n\n**Key facts / rules**\n* A **Company Policy** explains *why* something is done (e.g., \"We value safety\").\n* A **Procedure** explains *how* something is done (e.g., \"Step 1: Isolate power\").\n* A **Customer Specification** takes priority for the specific details of a unique job.\n* Policies and procedures create a predictable environment for all team members.\n* Ignoring a procedure can lead to disciplinary action, even if no accident occurs.\n* Customer specifications often include dimensions, materials, or performance targets.\n\n**When to choose it**\nYou should refer to a **Company Policy** when you need to understand the organization's stance on a broad issue like equality or environmental impact. You choose a **Procedure** when you are about to perform a task and need to ensure it is done the \"company way\" every time. You must consult the **Customer Specification** at the start of every new project to ensure the work matches the client's unique needs rather than just a standard template.\n\nA physical-world analogy is a restaurant. The \"Hygiene Policy\" is the intent to keep food safe. The \"Handwashing Procedure\" is the specific steps the chef must follow. The \"Customer Specification\" is the diner's request for a steak to be cooked \"medium-well\" rather than the standard way.\n\n*Micro-scenario: A technician follows the standard company procedure for painting a wall, but ignores the customer specification that requested a specific shade of blue. The technician has followed the correct internal process but failed the project requirements.*\n\n**Common mistakes**\nLearners often confuse a **Company Policy** with a **Procedure**; a **Company Policy** is a high-level statement of intent or rules, whereas a **Procedure** is the specific step-by-step instruction used to carry out that intent.\n\nMisconceptions (targeted):\n* Misconception: Customer specifications are just suggestions and the technician can choose a better way. | Correction: Specifications are often part of a legal contract and must be followed exactly to satisfy the client. | AC: AC2.3\n* Misconception: Workplace procedures are only for beginners. | Correction: Procedures ensure consistency and safety for all staff, regardless of experience level. | AC: AC2.4\n\n**Key Points**\n* Policies set the rules; procedures provide the steps.\n* Customer specifications define the unique requirements of a job.\n* Following internal rules maintains professional working relationships.\n* Consistency in following procedures reduces errors and workplace accidents.\n\n**Quick recap**\nInternal workplace documents like policies and procedures provide the structure for how a business functions and how staff interact. Customer specifications ensure that the final technical output meets the client’s exact needs. Together, these documents ensure that work is professional, safe, and correct.\n\n### Coming Up Next\nIn the next lesson, we will explore how to communicate technical information effectively to different audiences."
      }
    },
    {
      "id": "210-210-2A1-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Workplace and Customer Information",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-210-2A1-C2-L1-A",
            "questionText": "What is the name for a formal statement of an organization's intent and rules?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Company Policy",
              "Policy",
              "Company Policies"
            ],
            "hint": "This document explains the high-level 'why' behind workplace rules."
          },
          {
            "id": "210-210-2A1-C2-L1-B",
            "questionText": "What is the term for an established step-by-step method for performing a task?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Procedure",
              "Workplace Procedure",
              "Procedures"
            ],
            "hint": "This document provides the 'how-to' for specific daily activities."
          },
          {
            "id": "210-210-2A1-C2-L1-C",
            "questionText": "Which document takes priority for the specific details of a unique job?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Customer Specification",
              "Specification",
              "Client Specification"
            ],
            "hint": "This document outlines the unique technical requirements for a specific client."
          },
          {
            "id": "210-210-2A1-C2-L2",
            "questionText": "Using your answers to Q1 (Company Policy), Q2 (Procedure), and Q3 (Customer Specification), why must a technician identify all three before starting a specialized contract?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Policies provide the rules and intent of the employer",
              "Procedures provide the consistent steps for safety and quality",
              "Customer Specifications override standard ways of working for unique project details",
              "How we know this is necessary is that ignoring any one of these can lead to disciplinary action or contract failure"
            ],
            "expectedAnswer": [
              "A technician must identify all three because the Company Policy sets the general rules, the Procedure provides the steps to work safely, and the Customer Specification provides the unique details that take priority for that specific job. Why this matters is that you could follow company rules perfectly but still fail the project if the customer's specific requirements are ignored.",
              "These documents connect to ensure work is professional and correct. The policy and procedure ensure the technician follows company rules and standard steps, but the customer specification is needed because it takes priority for the unique details of the job. We know this is valid because following only internal procedures might result in a product that does not meet the client's specific needs."
            ],
            "hint": "Consider what happens if you follow company rules but miss the client's specific technical requests."
          }
        ]
      }
    },
    {
      "id": "210-210-2A1-worked-example",
      "type": "worked-example",
      "order": 6,
      "content": {
        "title": "Worked Example: Identifying Mandatory Legal Documents",
        "given": "A technician is presented with a document titled 'The Health and Safety at Work etc. Act 1974'. The text contains formal language and frequently uses the word 'must' regarding safety duties.",
        "steps": [
          {
            "stepNumber": 1,
            "description": "Identify context and constraints",
            "formula": null,
            "calculation": null,
            "result": "The document has a formal title, a specific year (1974), and uses mandatory language ('must')."
          },
          {
            "stepNumber": 2,
            "description": "Select appropriate option",
            "formula": null,
            "calculation": null,
            "result": "Statutory Legislation"
          },
          {
            "stepNumber": 3,
            "description": "State purpose/result",
            "formula": null,
            "calculation": null,
            "result": "To set mandatory legal requirements that must be followed to avoid criminal prosecution or fines."
          },
          {
            "stepNumber": 4,
            "description": "State common wrong choice and why",
            "formula": null,
            "calculation": null,
            "result": "This is not Guidance Information because guidance is advisory ('should') rather than a non-negotiable legal requirement."
          }
        ],
        "notes": "Always verify the current edition or version of the document to ensure compliance with the latest legal standards."
      }
    },
    {
      "id": "210-210-2A1-guided",
      "type": "guided-practice",
      "order": 7,
      "content": {
        "title": "Guided Practice: Identifying Advisory Documents",
        "problem": "A technician finds a booklet titled 'Notes for Guidance: Best Practice for Tool Maintenance'. It contains helpful diagrams and uses the word 'should' when describing how to clean equipment.",
        "steps": [
          {
            "stepNumber": 1,
            "prompt": "Identify the context and constraints of this document based on its title and language.",
            "expectedAnswer": [
              "Advisory title and uses 'should'",
              "Contains diagrams and best practice advice"
            ],
            "hint": "Look at the specific title and whether the language is mandatory or advisory."
          },
          {
            "stepNumber": 2,
            "prompt": "Select the appropriate category for this document.",
            "expectedAnswer": [
              "Guidance Information",
              "Guidance"
            ],
            "hint": "Recall which category provides 'best practice' recommendations."
          },
          {
            "stepNumber": 3,
            "prompt": "State the purpose of this type of document.",
            "expectedAnswer": [
              "To provide advice on achieving compliance",
              "To provide best practice recommendations"
            ],
            "hint": "Think about whether this document is a law or a helpful roadmap."
          },
          {
            "stepNumber": 4,
            "prompt": "State the common wrong choice (the other main category) and explain why it does not apply here.",
            "expectedAnswer": [
              "Statutory Legislation because it is not mandatory",
              "Statutory Legislation"
            ],
            "hint": "Identify the type of document that uses 'must' and carries legal penalties for failure to follow."
          }
        ]
      }
    },
    {
      "id": "210-210-2A1-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-210-2A1-P1",
            "questionText": "How do we know if a document is Statutory Legislation rather than Guidance Information based on its title and language?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Formal title and year",
              "Mandatory language",
              "Uses must or shall",
              "Legalistic tone"
            ],
            "hint": "Look for markers like the year of enactment or the specific words used to describe obligations."
          },
          {
            "id": "210-210-2A1-P2",
            "questionText": "A technician is reviewing a folder containing: 2 National Acts, 1 Approved Code of Practice (ACOP), and 2 Best Practice Guides. How many of these documents are classified as Statutory Legislation?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2"
            ],
            "hint": "Only mandatory rules passed by a legislative body count as Statutory Legislation; others are guidance."
          },
          {
            "id": "210-210-2A1-P3",
            "questionText": "A technician follows the standard company method for assembly perfectly, but the client rejects the work because they wanted a specific high-grade finish not used in standard jobs. Which document did the technician likely fail to consult?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Customer Specification",
              "Customer Specifications",
              "Specification",
              "The Specification"
            ],
            "hint": "This document outlines unique requirements requested by a client for a particular project."
          },
          {
            "id": "210-210-2A1-P4",
            "questionText": "An organization has a document explaining the importance of environmental protection (Document A) and a document listing the 10 steps to safely dispose of chemical waste (Document B). What is the technical term for Document B?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Procedure",
              "Procedures",
              "Company Procedure",
              "Workplace Procedure"
            ],
            "hint": "This term refers to the established, step-by-step method for performing a specific task."
          },
          {
            "id": "210-210-2A1-P5",
            "questionText": "If a technician ignores one 'must' requirement found in a legal act and one 'should' recommendation found in a guidance note, how many of these specific actions can lead directly to criminal prosecution?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "Only the failure to follow mandatory legal duties results in criminal penalties like fines or imprisonment."
          }
        ]
      }
    },
    {
      "id": "210-210-2A1-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-210-2A1-INT-1",
            "questionText": "Explain the relationship between mandatory statutory legislation and internal company policies when managing technical operations. In your answer, include: (1) the mandatory nature of statutory legislation, (2) the role of company policies in directing workplace conduct, and (3) how these two types of information interact to maintain legal standards. Why must an organization's internal procedures be mapped against statutory requirements? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies statutory legislation as non-negotiable legal requirements.",
              "Describes company policies as internal rules for managing operations and conduct.",
              "Explains that policies translate broad legal mandates into specific workplace actions.",
              "Reasons that misalignment between policy and law leads to legal liability or safety failures.",
              "Recognizes that legislation provides the minimum framework for policy development."
            ],
            "expectedAnswer": [
              "Statutory legislation sets the mandatory legal framework that all technical work must follow, while company policies provide specific internal rules for employees. These relate because policies are designed to implement legislation within the specific context of the workplace. This relationship must hold because failing to align internal procedures with the law would result in legal non-compliance and increased operational risk.",
              "Legislation acts as the non-negotiable standard, whereas company policies define the expected conduct and operations for an employer. They interact by ensuring that every staff member follows a consistent method that meets legal obligations. This alignment is necessary because workplace policies serve as the practical mechanism for upholding the law in day-to-day tasks."
            ],
            "hint": "Consider how a general law becomes a specific rule you follow at your desk or on-site."
          },
          {
            "id": "210-210-2A1-INT-2",
            "questionText": "Synthesize the use of legal, organizational, and client-specific information when performing technical tasks. In your answer, include: (1) the distinction between mandatory statutory legislation and advisory guidance, (2) the purpose of internal workplace policies, (3) the significance of customer-specific requirements, and (4) how these layers of information integrate to ensure safe and professional delivery. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Distinguishes between mandatory laws and advisory best-practice guidance.",
              "Explains how workplace policies standardize internal operations and working relationships.",
              "Identifies customer-specific information as the driver for unique project outcomes.",
              "Demonstrates how guidance supports the practical application of legislation.",
              "Explains that policies ensure working relationships remain professional and compliant.",
              "Shows that customer needs must be met without violating legal or company standards.",
              "Concludes that integration minimizes risk while meeting quality expectations.",
              "Recognizes the hierarchy of information from law down to specific task instructions."
            ],
            "expectedAnswer": [
              "Technical delivery requires balancing mandatory statutory legislation with advisory guidance to ensure legal and safe performance. This is further supported by workplace policies that govern internal conduct and customer-specific information that defines the unique requirements of the task. By integrating these, a professional ensures that the work meets legal standards, follows best practices, adheres to company rules, and satisfies the client’s specific needs.",
              "Professionals must follow mandatory legislation while using advisory guidance to apply best practices effectively. Internal workplace policies then provide the framework for professional conduct and operational consistency, while customer-specific information ensures the final output meets the client's expectations. Integrating these four elements ensures that technical work is legally compliant, safe, professionally managed, and fit for purpose."
            ],
            "hint": "Think about the hierarchy of information, starting from the law and ending with the specific needs of the person paying for the work."
          }
        ]
      }
    },
    {
      "id": "210-210-2A1-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-210-2A1-SR-1",
            "questionText": "What term is used to describe the laws passed by a governing body that must be followed in a professional setting?",
            "expectedAnswer": [
              "legislation",
              "statutory legislation",
              "laws",
              "statutes"
            ],
            "hint": "Think of the legal term for rules that are mandatory by law.",
            "answerType": "short-text"
          },
          {
            "id": "210-210-2A1-SR-2",
            "questionText": "What is the term for a set of rules or instructions provided by an employer to guide how tasks should be completed?",
            "expectedAnswer": [
              "policy",
              "procedure",
              "policies",
              "procedures"
            ],
            "hint": "These are internal company documents that define how staff should behave or work.",
            "answerType": "short-text"
          },
          {
            "id": "210-210-2A1-SR-3",
            "questionText": "In a professional context, what term describes the individual or organization that receives a service or product from a business?",
            "expectedAnswer": [
              "customer",
              "client",
              "the customer",
              "the client"
            ],
            "hint": "This is the person or entity the technical work is being completed for.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting 1 Identify types of statutory legislation and guidance info:"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2",
    "AC3",
    "AC4"
  ],
  "metadata": {
    "created": "2026-02-15",
    "updated": "2026-02-15",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO2",
      "coveredAC": [
        "AC1",
        "AC2",
        "AC3",
        "AC4"
      ],
      "outOfScopeAC": [
        "AC5",
        "AC6",
        "AC7"
      ]
    },
    "scope": {
      "inScope": "Identification and purpose of statutory, guidance, workplace, and customer documentation.",
      "outOfScope": "Detailed interpretation of specific regulations or procedures for completing workplace documentation.",
      "rationale": "The lesson aims to build foundational awareness of information types and their intent before moving to practical application."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on identifying information types and stating their importance rather than procedural use."
    },
    "misconceptions": [
      {
        "misconception": "Guidance documents are just optional suggestions that can be ignored without consequence.",
        "correction": "While not law, following guidance is the standard way to prove you are working safely; ignoring it makes you legally vulnerable.",
        "relatedAC": "AC2.1"
      },
      {
        "misconception": "An ACOP is exactly the same as a standard guidance note.",
        "correction": "An ACOP has a higher legal status and can be used in court as evidence of whether a law was broken.",
        "relatedAC": "AC2.1"
      },
      {
        "misconception": "Customer specifications are just suggestions and the technician can choose a better way.",
        "correction": "Specifications are often part of a legal contract and must be followed exactly to satisfy the client.",
        "relatedAC": "AC2.3"
      }
    ]
  }
}