{
  "id": "210-1B",
  "title": "210.1B — Site Management and Reporting Roles",
  "description": "Learn about the Site Management Team and reporting hierarchies in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Management and Reporting Roles",
  "learningOutcomes": [
    "Identify key roles of the site management team including Site Managers and Quantity Surveyors",
    "Identify key roles of individuals reporting to site management such as Supervisors and Operatives",
    "Explain the chain of command and how information flows between site roles"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify key roles of the site management team including Site Managers and Quantity Surveyors",
            "bloomLevel": "remember"
          },
          {
            "text": "Identify key roles of individuals reporting to site management such as Supervisors and Operatives",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the chain of command and how information flows between site roles",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Site Manager",
            "definition": "The person with overall day-to-day responsibility for the safety, schedule, and quality of the construction site; often called the 'Site Agent' on larger projects."
          },
          {
            "term": "Contracts Manager",
            "definition": "A senior manager who oversees multiple projects and deals with high-level client contracts and budgets, sitting above the Site Manager in the hierarchy."
          },
          {
            "term": "Quantity Surveyor (QS)",
            "definition": "The professional responsible for estimating and monitoring construction costs, ensuring the project stays within budget by measuring materials and labor."
          },
          {
            "term": "Supervisor",
            "definition": "Also known as a foreman or chargehand, this person directs the specific daily tasks of operatives and reports progress up to the Site Manager."
          },
          {
            "term": "Chain of Command",
            "definition": "The official hierarchy of authority that dictates who reports to whom, ensuring instructions flow down from management and information flows up from operatives."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Site Management Team (AC1)",
        "content": "### In this lesson\nYou will learn about the key roles that run a construction site. You will identify who is responsible for the daily operations, who handles the money, and who oversees the big picture.\n\n*   The difference between a Site Manager and a Contracts Manager.\n*   The role of the Quantity Surveyor in cost control.\n*   How the management team coordinates the project.\n\n**What this is**\nThe **Site Management Team** is the group of professionals responsible for delivering the project. Think of a ship: the **Contracts Manager** is the Admiral (on land, managing the fleet/strategy), the **Site Manager** is the Captain (on the ship, managing the crew daily), and the **Quantity Surveyor** is the Purser (managing the money and supplies).\n\n**Why it matters**\nKnowing who is who ensures you speak to the right person. If you have a query about your pay or the cost of materials, you talk to the **Quantity Surveyor**. If you have a safety concern or a problem with the schedule, the **Site Manager** is the authority. Confusing these roles can lead to delays or unauthorized spending.\n\n**Key facts / rules**\n*   **Contracts Manager**: Visits occasionally. Manages the contract with the client and oversees multiple sites. Focus: Strategy & Profit.\n*   **Site Manager / Site Agent**: Based on site every day. Responsible for safety, labor, and deadlines. Focus: Getting the job done.\n*   **Quantity Surveyor (QS)**: Measures work completed and calculates costs. Focus: Budget & Value.\n\n**Micro-Scenario: The Cost Check**\nImagine a bricklayer needs more bricks. The **Site Manager** approves the *need* for bricks to keep work going. The **Quantity Surveyor** calculates that 1,000 bricks are required and checks if this fits the budget before placing the order. The **Contracts Manager** might later review why the project used more bricks than predicted.\n\n**When to choose it**\nWhen you need a decision made, look at the scale. Is it a daily issue? Go to the Site Manager. Is it a major contract change? It requires the Contracts Manager. Is it about money or measurements? It’s the QS.\n\n**Common mistakes**\nLearners often confuse the **Site Manager** with the **Contracts Manager**. Remember: The Site Manager is *on site* daily; the Contracts Manager manages the *contracts* (paperwork) for several sites and visits less often.\n\nMisconceptions (targeted):\n*   Misconception: The Site Manager handles all the payroll and invoicing personally. | Correction: The Quantity Surveyor is the specialist who manages costs, valuations, and invoicing. | AC: AC1\n*   Misconception: The Contracts Manager is the boss of the company. | Correction: They are a senior manager, but they report to Directors. They specifically manage project contracts. | AC: AC1\n\n**Key Points**\n*   **Site Manager**: Day-to-day site control.\n*   **Contracts Manager**: Multi-site strategic control.\n*   **Quantity Surveyor**: Cost and material control.\n\n### Coming Up Next\nNow that we know who runs the site, we will look at the individuals who report to them and do the physical work."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Site Management",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "Which management role is based on site every day and has overall responsibility for safety and schedule?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Manager",
              "Site Agent",
              "Project Manager"
            ],
            "hint": "Think of the 'Captain' of the ship who is physically present."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Which professional is responsible for estimating costs and monitoring the project budget?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS",
              "Surveyor"
            ],
            "hint": "This role involves measuring materials and managing money."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Who oversees multiple projects and manages the high-level client contracts?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Contracts Manager",
              "Contract Manager"
            ],
            "hint": "This manager sits above the Site Manager and looks at the bigger strategic picture."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Explain the relationship between the Site Manager and the Quantity Surveyor. Why are both roles needed for a successful project?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Site Manager focuses on physical progress, safety, and schedule",
              "Quantity Surveyor focuses on costs, budget, and material quantities",
              "Together they ensure the project is built correctly (Site Manager) and profitably (QS)",
              "One manages the work, the other manages the money"
            ],
            "expectedAnswer": [
              "The Site Manager ensures the work is done safely and on time, while the Quantity Surveyor ensures it is done within budget. Both are needed because a project that is finished on time but costs double the budget is a failure, just as a cheap project that is never finished is a failure. They balance physical progress with financial control.",
              "The Site Manager handles the day-to-day operations and logistics, whereas the Quantity Surveyor handles the financial side. You need both to ensure the building is constructed to standard without running out of money."
            ],
            "hint": "Think about the difference between 'building it' and 'paying for it'."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Reporting Lines and Operatives (AC2)",
        "content": "### In this lesson\nYou will learn about the individuals who report to the site management team. This includes the supervisors who direct work and the operatives who perform it.\n\n*   The role of the Supervisor/Foreman.\n*   The duties of the Operative.\n*   The function of Site Administration.\n*   Understanding the Chain of Command.\n\n**What this is**\nBelow the management team is the workforce. This is organized into a **Chain of Command**. Instructions flow down from the Site Manager -> Supervisor -> Operative. Reports flow back up. \n\n**Roles**\n1.  **Supervisor (Foreman/Ganger)**: The link between management and workers. They do not usually run the whole site but control a specific team (e.g., the electrical team). They ensure materials are ready and work is correct.\n2.  **Operative**: The skilled tradesperson (e.g., Electrician, Plumber, Bricklayer) or general laborer. They perform the physical installation.\n3.  **Site Administrator**: Reports to the Site Manager. Handles the 'office' side: filing drawings, checking timesheets, and signing in visitors.\n\n**Why it matters**\nFollowing the **Chain of Command** prevents confusion. If an **Operative** has a problem, they should tell their **Supervisor**, not bypass them to the Contracts Manager. This ensures problems are solved quickly at the right level.\n\n**Micro-Scenario: Span of Control**\nConsider a site with 20 electricians. It is too hard for one Site Manager to watch them all. So, the team is split: 2 **Supervisors** each manage 10 **Operatives**. If an operative installs 50 meters of cable tray, the Supervisor checks it measures correctly and meets the standard before telling the Site Manager the task is complete.\n\n**Key facts / rules**\n*   **Operatives** report to **Supervisors**.\n*   **Supervisors** report to the **Site Manager**.\n*   **Site Admin** supports the **Site Manager** with paperwork.\n*   **Span of Control**: The number of people a supervisor can effectively manage (usually 8-12).\n\n**Common mistakes**\nLearners often think the Site Manager tells every single worker what to do every hour. In reality, the Site Manager tells the **Supervisor** the plan for the week, and the Supervisor directs the **Operatives** daily.\n\nMisconceptions (targeted):\n*   Misconception: Operatives can change the design if they think a better way exists. | Correction: Operatives must follow the design; changes must be approved by the Supervisor and Management. | AC: AC2\n*   Misconception: The Site Administrator is just a receptionist. | Correction: They control critical project documentation and site access records. | AC: AC2\n\n**Key Points**\n*   Respect the **Chain of Command**.\n*   **Supervisors** translate management goals into daily tasks.\n*   **Operatives** deliver the physical work quality.\n\n### Coming Up Next\nWe will practice identifying these roles and calculating team structures."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Reporting Lines",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Who acts as the direct link between the Site Manager and the Operatives?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Supervisor",
              "Foreman",
              "Ganger",
              "Chargehand"
            ],
            "hint": "This person directs the daily tasks of the work gang."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which role is responsible for performing the physical installation work on site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Operative",
              "Tradesperson",
              "Electrician",
              "Worker"
            ],
            "hint": "This is the person on the tools doing the job."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "Who supports the Site Manager by handling documentation, filing, and visitor logs?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Administrator",
              "Site Admin",
              "Administrator"
            ],
            "hint": "This role is office-based and deals with paperwork."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Describe the 'Chain of Command' from the Operative to the Site Manager. Why is it important to follow this structure?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Order: Operative -> Supervisor -> Site Manager",
              "Ensures instructions flow down clearly",
              "Ensures issues are resolved at the correct level",
              "Prevents management overload and confusion"
            ],
            "expectedAnswer": [
              "The Chain of Command flows from the Operative up to the Supervisor, and then to the Site Manager. It is important to follow this so that the Site Manager isn't overwhelmed with minor issues that a Supervisor could fix, and to ensure that instructions from the top are clearly explained to the team by their direct leader.",
              "Operatives report to Supervisors, who report to the Site Manager. Following this structure prevents confusion and ensures that information reaches the right person without bypassing the necessary checks."
            ],
            "hint": "Think about how information moves up the ladder and why skipping a step causes problems."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A site management team consists of 1 Contracts Manager, 1 Project Manager, 1 Site Agent, and 2 Quantity Surveyors. How many individuals are part of this specific management group?",
            "answerType": "numeric",
            "expectedAnswer": [
              "5"
            ],
            "hint": "Simply count the total number of management roles listed."
          },
          {
            "id": "210-1B-P2",
            "questionText": "If you are an operative and you find a discrepancy in the drawings, who is the first person you should report this to?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Supervisor",
              "Foreman",
              "Line Manager"
            ],
            "hint": "Follow the immediate chain of command; do not go straight to the top."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A company policy requires 1 Supervisor for every 8 Operatives. If there are 24 Operatives on site, what is the minimum number of Supervisors required?",
            "answerType": "numeric",
            "expectedAnswer": [
              "3"
            ],
            "hint": "Divide the total operatives by the span of control (24 divided by 8)."
          },
          {
            "id": "210-1B-P4",
            "questionText": "Which management role would you contact regarding a payment valuation or a budget issue?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS"
            ],
            "hint": "This person is the financial controller of the project."
          },
          {
            "id": "210-1B-P5",
            "questionText": "Who has the authority to make high-level strategic decisions for multiple sites at once?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Contracts Manager",
              "Contract Manager"
            ],
            "hint": "This role sits above the Site Manager."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain the distinct responsibilities of the Site Manager compared to the Quantity Surveyor. In your answer, include: (1) the primary focus of each role (schedule/safety vs. cost), (2) how they interact during a material shortage, and (3) why separating these roles benefits the project. (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Site Manager focuses on operations, safety, and time",
              "Quantity Surveyor focuses on budget, valuations, and procurement",
              "Interaction: Site Manager identifies need, QS approves cost/orders",
              "Separation ensures checks and balances (progress vs. profit)"
            ],
            "expectedAnswer": [
              "The Site Manager focuses on the operational side, ensuring safety and schedule, while the Quantity Surveyor focuses on the financial side, managing the budget. During a material shortage, the Site Manager identifies the need for materials to keep work going, and the QS ensures the purchase is cost-effective and within budget. Separating these roles provides a check and balance, ensuring the project is built correctly without overspending.",
              "While the Site Manager drives the physical work and safety, the QS controls the money. If materials run out, the Site Manager requests them, but the QS handles the financial approval. This separation prevents the Site Manager from spending recklessly just to speed up the job."
            ],
            "hint": "Contrast 'getting it done' with 'keeping it affordable'."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Analyze the chain of command during a design change. If an Operative notices a cable route is blocked: (1) Who do they tell? (2) Who does that person report to? (3) Who likely makes the final decision if it costs money? Explain the flow of information.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Flow: Operative -> Supervisor -> Site Manager -> QS/Contracts Manager",
              "Operative identifies issue",
              "Supervisor verifies and reports up",
              "Site Manager assesses impact",
              "QS/Contracts Manager approves cost if significant"
            ],
            "expectedAnswer": [
              "The Operative should first tell their Supervisor, who verifies the blockage. The Supervisor then reports this to the Site Manager. If the solution requires significant extra cost or materials, the Site Manager will consult the Quantity Surveyor or Contracts Manager for approval. This flow ensures the decision is made by the person with the appropriate authority and budget control.",
              "1. Operative tells Supervisor.\n2. Supervisor tells Site Manager.\n3. Site Manager/QS makes the decision.\nInformation flows up so that the Site Manager is aware of the delay, and the QS can account for any extra costs."
            ],
            "hint": "Follow the hierarchy: Worker -> Leader -> Manager -> Financial Control."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "Who is the primary person or organization that commissions and pays for the construction project?",
            "expectedAnswer": [
              "Client",
              "The Client",
              "Customer"
            ],
            "hint": "This is the person at the very top who wants the building built.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "Which design team member is responsible for the aesthetic design and spatial arrangement of the building?",
            "expectedAnswer": [
              "Architect",
              "The Architect"
            ],
            "hint": "They produce the drawings that show what the building will look like.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "Which engineer calculates the loads to ensure the building's framework (beams and columns) is strong enough?",
            "expectedAnswer": [
              "Structural Engineer",
              "Structural"
            ],
            "hint": "They focus on the strength and stability of the skeleton of the building.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Site Management Roles"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, HIERARCHY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1",
        "AC2"
      ],
      "outOfScopeAC": [
        "AC3",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Roles and responsibilities of the Site Management Team and reporting individuals (Operatives/Supervisors).",
      "outOfScope": "External site visitors (AC3), statutory inspectors, and design team roles (covered in 1A).",
      "rationale": "The lesson focuses on the internal site hierarchy and management structure as defined by AC1 and AC2."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": false,
      "specificScope": "Focus on the 'who' and 'why' of the management hierarchy."
    },
    "misconceptions": [
      {
        "misconception": "The Site Manager handles all the payroll and invoicing personally.",
        "correction": "The Quantity Surveyor is the specialist who manages costs, valuations, and invoicing.",
        "relatedAC": "AC1"
      },
      {
        "misconception": "Operatives can change the design if they think a better way exists.",
        "correction": "Operatives must follow the design; changes must be approved by the Supervisor and Management.",
        "relatedAC": "AC2"
      },
      {
        "misconception": "The Contracts Manager is the boss of the company.",
        "correction": "They are a senior manager, but they report to Directors. They specifically manage project contracts.",
        "relatedAC": "AC1"
      }
    ]
  }
}