{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn about the key regulatory roles that visit construction sites, including Building Control, HSE, and Utility Inspectors.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify the key types of regulatory inspectors and site visitors encountered in a technical environment.",
    "Describe the specific purpose and area of authority for Building Control, Water, HSE, and Electrical inspectors.",
    "Explain why different site visitors require specific access and information to fulfill their roles."
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the key types of regulatory inspectors and site visitors encountered in a technical environment.",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the specific purpose and area of authority for Building Control, Water, HSE, and Electrical inspectors.",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain why different site visitors require specific access and information to fulfill their roles.",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Inspector",
            "definition": "An official with legal power to enforce national laws on a site (e.g., Building Control). They do not work for the client."
          },
          {
            "term": "Building Control",
            "definition": "A government body that inspects buildings to ensure they are structurally safe, fire-resistant, and energy efficient."
          },
          {
            "term": "HSE (Health and Safety Executive)",
            "definition": "The national authority that enforces safety laws to protect people from accidents and ill health at work."
          },
          {
            "term": "Utility Inspector",
            "definition": "A representative from a water, gas, or electric company who checks that new connections to their public network are safe."
          },
          {
            "term": "Compliance",
            "definition": "The act of following all rules, regulations, and standards. If work is 'compliant', it is legal and safe."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Statutory and Utility Inspectors",
        "content": "### The Referee on the Site\nImagine a football match. The **Site Manager** is like the team coach—they direct the players (the construction team) and organize the game plan. A **Statutory Inspector** is like the **Referee**. They don't play for either team, and they don't care who wins; their only job is to ensure the rules (laws) are followed. If a rule is broken, they have the power to stop the game.\n\n### 1. Statutory Inspectors (The Law Enforcers)\nA **Statutory Inspector** is someone with legal authority to enter a site and check work against national laws. They are independent—they do not work for the site owner or the contractor.\n\n*   **Building Control:** This is the most common statutory body. They focus on the **building itself**. They check things like foundations, fire exits, and insulation to ensure the building is safe to live in. They must visit at key stages, such as \"first-fix\" (before walls are closed up), to see pipes and wires that will later be hidden.\n\n### 2. Utility Inspectors (The Network Guardians)\nConstruction sites need to connect to public networks for water, electricity, and gas. A **Utility Inspector** works for the service provider (like the Water Board or Electric Company).\n\n*   **Focus:** They check the **connection point** between the private site and the public street.\n*   **Why?** If you install a dirty pipe, it could contaminate the whole town's water supply. The Utility Inspector ensures your work doesn't damage their public network.\n\n### Interaction with the Team\nWhile these inspectors visit the site, they usually report their findings to the **Site Management Team** (AC1.1). However, they inspect the work done by the **subcontractors and tradespeople** (AC1.2). For example, a Building Control officer will look at a bricklayer's wall, but if it is wrong, they will tell the Site Manager to get it fixed."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Statutory and Utility Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "Which type of visitor has the legal power to enforce national regulations, similar to a referee in a game?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Statutory Inspector",
              "Statutory Inspectors",
              "A Statutory Inspector"
            ],
            "hint": "This person's duty is to the law, not the project owner."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "What does Building Control primarily check during a site visit?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "safety and energy standards",
              "structural safety",
              "minimum standards",
              "compliance with building regulations"
            ],
            "hint": "They focus on the physical building structure and safety systems like fire exits."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "What specific part of an installation is a Utility Inspector most concerned with?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "connection point",
              "connection to public network",
              "public network connection",
              "point of connection"
            ],
            "hint": "They want to make sure the private site does not damage the public supply."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Why is it important for a Statutory Inspector to visit a site during the 'first-fix' stage?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "First-fix involves internal work like pipes and cables",
              "Once walls are plastered, this work is hidden",
              "Inspectors cannot verify safety if they cannot see the work",
              "Visiting early prevents having to tear down walls later"
            ],
            "expectedAnswer": [
              "Inspectors must visit during the first-fix stage because this is when internal components like pipes, wires, and structural beams are still visible. Once the walls and floors are finished, this work is hidden. If they don't check it now, they cannot guarantee it is safe without tearing the building apart later.",
              "They need to see the work before it is covered up. First-fix is when the core systems are installed but not yet hidden by plaster or flooring, allowing the inspector to verify they meet regulations."
            ],
            "hint": "Think about what happens to pipes and wires after the walls are plastered and painted."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Safety and Technical Inspectors",
        "content": "### Protecting People and Systems\nWhile Building Control looks at the *building*, other inspectors look at the *people* and the *specialized systems*.\n\n### 1. The HSE (Health and Safety Executive)\nThe **HSE** is a government agency focused entirely on **workplace safety**. They don't check if the wall is straight; they check if the bricklayer is safe while building it.\n\n*   **Power:** The HSE has the legal right to enter **any** workplace at **any reasonable time** without an appointment. They do not need permission.\n*   **Action:** If they see something dangerous (like a deep trench with no guardrail), they can issue a **Prohibition Notice**. This is a legal order that stops the work immediately until it is fixed.\n*   **Documents:** They will ask to see **Risk Assessments** and training records to prove workers know how to work safely.\n\n### 2. Technical Service Inspectors (Specialists)\nThese are experts in one specific trade, such as **Electrical** or **Gas**.\n\n*   **Role:** They verify complex technical details that general inspectors might miss. For example, an Electrical Inspector checks **earthing** and **circuit protection**.\n*   **Why?** A wiring fault might not cause a problem today, but could cause a fire in 5 years. These inspectors use test meters to find invisible faults.\n*   **Documents:** They need to see **test certificates** and **design drawings** to confirm the system matches the plan.\n\n### Comparison\n*   **HSE Inspector:** Looks at the *process* (Is the worker wearing a helmet? Is the ladder safe?).\n*   **Technical Inspector:** Looks at the *product* (Is the wire thick enough? Is the gas pressure correct?)."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Safety and Technical Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which organization has the power to enter a site without an appointment to check for safety hazards?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "HSE",
              "Health and Safety Executive",
              "The HSE"
            ],
            "hint": "They protect people at work and can visit any time."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "What is the name of the legal order an HSE inspector can issue to stop dangerous work immediately?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Prohibition Notice",
              "Prohibition order",
              "Stop notice"
            ],
            "hint": "It prohibits (bans) the activity from continuing."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "What does an Electrical Inspector typically check that is not visible to the naked eye?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "earthing",
              "circuit protection",
              "insulation resistance",
              "technical safety features"
            ],
            "hint": "Think about the safety features inside the wires and consumer unit."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Explain the difference between what an HSE inspector looks for versus what a Technical Inspector looks for.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE looks at the safety of the working process (people, PPE, hazards)",
              "Technical Inspectors look at the quality/safety of the installed system (wires, pipes)",
              "HSE prevents immediate accidents; Technical prevents future system failures"
            ],
            "expectedAnswer": [
              "The HSE inspector focuses on the safety of the people and the process, checking things like PPE, scaffolding, and immediate hazards. A Technical Inspector focuses on the specialized system being installed, checking things like wiring or gas pressure to ensure the equipment works safely.",
              "HSE checks if the workers are safe while doing the job. Technical inspectors check if the job itself (the installation) meets technical standards."
            ],
            "hint": "One protects the worker during the job; the other protects the building/user after the job."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "Which regulatory body is responsible for ensuring that the physical structure of a building meets national regulations (like fire safety and insulation)?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Building Control",
              "Building Control Department",
              "Local Building Control"
            ],
            "hint": "This is the statutory body for building standards."
          },
          {
            "id": "210-1B-P2",
            "questionText": "Why must a Statutory Inspector be invited to see drainage pipes *before* the trench is filled with soil?",
            "answerType": "short-text",
            "expectedAnswer": [
              "work is hidden",
              "cannot see the pipes",
              "verify compliance before covering",
              "access is restricted"
            ],
            "hint": "Once the soil is back, the inspector cannot check if the pipes are laid correctly."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A Site Manager is dealing with three visitors: 1) A Water Board official checking the main pipe connection, 2) An HSE officer checking ladder safety, 3) A client architect checking paint colors. How many of these are 'Utility Inspectors'?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "Only the one representing a public service provider (water/gas/electric) counts."
          },
          {
            "id": "210-1B-P4",
            "questionText": "If an HSE inspector sees a worker on a roof without a harness, they can issue a 'Prohibition Notice'. What does this notice do?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Stops work",
              "Stops the activity",
              "Halts work immediately",
              "Bans the work"
            ],
            "hint": "It forces the dangerous activity to cease immediately."
          },
          {
            "id": "210-1B-P5",
            "questionText": "How many of the following documents are relevant for an Electrical Inspector checking a new system: 1) Circuit diagrams, 2) Test results, 3) Lunch menu, 4) Earthing records?",
            "answerType": "numeric",
            "expectedAnswer": [
              "3"
            ],
            "hint": "Count the technical documents related to the electrical installation."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain why a Site Manager must cooperate with both Building Control AND the HSE, even though they look at different things. What would happen if the site satisfied Building Control but ignored the HSE?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Building Control ensures the final building is legal/safe",
              "HSE ensures the workers are safe during construction",
              "Ignoring HSE could lead to accidents, fines, or site closure (Prohibition Notice)",
              "A compliant building is useless if the site is shut down for safety breaches"
            ],
            "expectedAnswer": [
              "The Site Manager must cooperate with both because they cover different legal requirements. Building Control ensures the final building is safe to occupy, while the HSE ensures the construction process is safe for workers. If the manager ignored the HSE, the site could be shut down via a Prohibition Notice or face heavy fines for accidents, even if the building structure itself was perfect.",
              "Cooperation with both is mandatory. Building Control certifies the product, but HSE regulates the process. Ignoring the HSE puts workers at risk and invites legal action that could stop the project entirely, regardless of building quality."
            ],
            "hint": "One checks the destination (the finished building), the other checks the journey (the work process)."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Describe the complete 'Compliance' picture for a new bathroom installation. How do the Plumber (Trade), Site Manager (Management), and Water Inspector (Visitor) work together to ensure the job is legal?",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Plumber (Trade/AC1.2): Installs the work to standard",
              "Site Manager (AC1.1): Coordinates the work and calls the inspector",
              "Water Inspector (Visitor/AC1.3): Verifies the connection to the public network",
              "All three must align for the work to be signed off as compliant"
            ],
            "expectedAnswer": [
              "The Plumber (Trade) installs the bathroom pipes according to technical standards. The Site Manager (Management) oversees the schedule and calls the Water Inspector when the work is ready to be checked. The Water Inspector (Visitor) then visits to verify the connection to the public network is safe. Compliance is achieved when the physical work (Plumber), the coordination (Manager), and the external verification (Inspector) all align to sign off the project.",
              "1. The Plumber installs the system.\n2. The Site Manager checks it internally and invites the Inspector.\n3. The Water Inspector verifies it meets public network rules.\nTogether, they ensure the installation is safe, legal, and ready for use."
            ],
            "hint": "Think about the chain of responsibility: Do the work -> Check the work -> Certify the work."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "What is the general term for the skilled workers (like electricians or plumbers) who report to the site management?",
            "expectedAnswer": [
              "trades",
              "skilled trades",
              "operatives",
              "subcontractors"
            ],
            "hint": "These are the individuals who physically install the systems.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "Who is the person primarily responsible for running the daily operations on a construction site?",
            "expectedAnswer": [
              "site manager",
              "site agent",
              "manager"
            ],
            "hint": "They are the 'captain' of the site team.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What term describes the set of national laws that all construction work must follow?",
            "expectedAnswer": [
              "regulations",
              "building regulations",
              "legislation"
            ],
            "hint": "These are the rules enforced by statutory inspectors.",
            "answerType": "short-text"
          }
        ],
        "notes": "Review of AC1.1 and AC1.2 concepts before proceeding to advanced communication."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1.3"
  ],
  "metadata": {
    "created": "2026-02-17",
    "updated": "2026-02-17",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1.3"
      ],
      "outOfScopeAC": [
        "AC1.1",
        "AC1.2"
      ]
    },
    "scope": {
      "inScope": "Identification of site inspectors (Building Control, HSE, Utility) and their interaction with the site team.",
      "outOfScope": "Detailed inspection procedures, specific testing values, or completing inspection forms.",
      "rationale": "The lesson focuses on identifying external regulatory roles (AC1.3) and understanding their authority."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Key roles of inspectors only"
    },
    "misconceptions": [
      {
        "misconception": "A Utility Inspector works for the building contractor.",
        "correction": "A Utility Inspector represents the service provider (e.g., water or energy company) to protect the public network.",
        "relatedAC": "AC1.3"
      },
      {
        "misconception": "The HSE only visits large construction sites.",
        "correction": "The HSE has authority over any workplace, regardless of size, to enforce safety standards.",
        "relatedAC": "AC1.3"
      },
      {
        "misconception": "Building Control and the Site Manager are the same thing.",
        "correction": "The Site Manager runs the project; Building Control is an external body that checks legal compliance.",
        "relatedAC": "AC1.3"
      }
    ]
  }
}