{
  "id": "210-2B",
  "title": "210.2B — Customer Information and Company Policies",
  "description": "Learn about Customer Information and Company Policies in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Customer Information and Company Policies",
  "learningOutcomes": [
    "Identify the purpose of key customer documents including quotations, estimates, and statutory cancellation rights.",
    "Describe the importance of adhering to company policies regarding behavior, timekeeping, and dress code.",
    "Explain the limits of personal authority for apprentices and Level 2 staff within a working relationship."
  ],
  "prerequisites": [
    "210-2A"
  ],
  "blocks": [
    {
      "id": "210-2B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the purpose of key customer documents including quotations, estimates, and statutory cancellation rights.",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the importance of adhering to company policies regarding behavior, timekeeping, and dress code.",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the limits of personal authority for apprentices and Level 2 staff within a working relationship.",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "210-2B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Estimate",
            "definition": "An approximate calculation of the likely cost for work or materials, which is subject to change rather than a fixed price."
          },
          {
            "term": "Quotation",
            "definition": "A formal, fixed price offer to complete specific work that, once accepted, becomes a legally binding agreement, not a variable estimate."
          },
          {
            "term": "Cancellation Rights",
            "definition": "The statutory period during which a customer can legally withdraw from a contract without penalty, often referred to as a cooling-off period."
          },
          {
            "term": "Handover",
            "definition": "The formal process of transferring completed work, safety documentation, and operational instructions to the customer at the conclusion of a project."
          },
          {
            "term": "Limits of Authority",
            "definition": "The defined boundaries within which an employee or apprentice is permitted to make decisions or financial commitments on behalf of the employer."
          }
        ]
      }
    },
    {
      "id": "210-2B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Customer Documentation and Information",
        "content": "### In this lesson\nYou will learn to identify the purpose and function of primary customer documents used throughout a project lifecycle. This knowledge ensures that communication between a service provider and a client remains clear, legal, and professional.\n\n*   Distinguishing between fixed and variable pricing documents.\n*   Understanding the legal protections offered by cancellation rights.\n*   Identifying the components of a professional project completion.\n\n**What this is**\nCustomer documentation consists of the formal records that track a project from the initial inquiry to the final payment. An **Estimate** is an approximate calculation of the likely cost for work or materials, which is subject to change rather than a fixed price. In contrast, a **Quotation** is a formal, fixed price offer to complete specific work that, once accepted, becomes a legally binding agreement. Following the completion of work, an invoice is issued to request payment, while a statement provides a summary of all transactions over a period. Furthermore, **Cancellation Rights** represent the statutory period during which a customer can legally withdraw from a contract without penalty, often referred to as a cooling-off period. Finally, the **Handover** is the formal process of transferring completed work, safety documentation, and operational instructions to the customer.\n\n**Why it matters**\nClear documentation prevents disputes and protects both the business and the customer. Without a clear **Quotation**, a customer might be surprised by a final bill, leading to non-payment or legal action. Similarly, failing to provide information on **Cancellation Rights** can lead to significant legal penalties for a business. Proper **Handover** procedures ensure the customer knows how to use the installation safely, reducing the risk of accidents and ensuring the provider has fulfilled their professional duty of care.\n\n**Key facts / rules**\n*   An **Estimate** should be used when the full extent of the work is unknown or hidden.\n*   A **Quotation** must clearly define the scope of work to remain a fixed price.\n*   **Cancellation Rights** are usually mandated by consumer protection laws (verify current edition/version for specific durations).\n*   Invoices must include a unique identification number and a breakdown of costs.\n*   The **Handover** process must include all relevant manufacturer instructions and safety certificates.\n*   A statement is a record of account, not a request for a single payment like an invoice.\n\n**When to choose it**\nSelection depends on the stage of the project and the level of certainty regarding the work. You should provide an **Estimate** when there are variables that cannot be confirmed until work begins, such as the condition of existing hidden infrastructure. You must provide a **Quotation** when the client requires a guaranteed price for a specific, well-defined task. If a client signs a contract at their home, you must ensure they are informed of their **Cancellation Rights** immediately. The **Handover** information is selected and prepared as the final stage of the project to ensure the client is fully equipped to manage the new installation.\n\n**Common mistakes**\nLearners often confuse an **Estimate** with a **Quotation**; an **Estimate** is a non-binding projection of costs whereas a **Quotation** is a fixed legal offer that cannot be changed once accepted. Another common error is treating the **Handover** as a simple verbal \"goodbye\" rather than a formal transfer of safety and operational data.\n\nMisconceptions (targeted):\n*   Misconception: An estimate is a guaranteed maximum price. | Correction: An estimate is a variable calculation that can increase or decrease based on the actual work required. | AC: 210.LO2.AC2.3\n*   Misconception: Cancellation rights only apply if the work is poor. | Correction: Cancellation rights are a statutory time-based \"cooling-off\" period that applies regardless of work quality. | AC: 210.LO2.AC2.3\n\n**Key Points**\n*   Estimates provide flexibility for unknown variables; quotations provide price certainty.\n*   **Cancellation Rights** protect consumers from high-pressure sales and snap decisions.\n*   **Handover** is a critical safety and administrative step at the end of a job.\n*   Invoices and statements provide the financial trail for accounting and tax purposes.\n\n**Quick recap**\nEffective customer communication relies on using the correct document for the correct purpose. An **Estimate** starts the conversation for complex jobs, a **Quotation** seals the deal with a fixed price, and **Cancellation Rights** ensure the agreement is fair. The process concludes with an invoice for payment and a formal **Handover** to ensure the customer is safe and informed.\n\n### Coming Up Next\nWe will examine how your personal conduct and professional boundaries affect these customer relationships and your standing within a company."
      }
    },
    {
      "id": "210-2B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Customer Documentation and Information",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-2B-C1-L1-A",
            "questionText": "What type of cost document is defined as an approximate calculation of the likely cost for work or materials?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Estimate",
              "An estimate",
              "Project estimate"
            ],
            "hint": "Think of the document used when the final cost is not yet fixed."
          },
          {
            "id": "210-2B-C1-L1-B",
            "questionText": "Which document is identified as a formal fixed price offer to complete specific work?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quotation",
              "A quotation",
              "Formal quotation"
            ],
            "hint": "This document becomes a legally binding agreement once the customer accepts it."
          },
          {
            "id": "210-2B-C1-L1-C",
            "questionText": "In terms of legal obligation, how does a quotation differ from an estimate?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Fixed legal offer",
              "Legally binding",
              "Fixed price offer"
            ],
            "hint": "Consider which document is a non-binding projection and which is a legal commitment."
          },
          {
            "id": "210-2B-C1-L2",
            "questionText": "Using your answers to Q1 (estimates), Q2 (quotations), and Q3 (legal differences), why must a service provider choose the document type based on the level of project certainty?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Estimates allow for flexibility when costs are approximate or likely to change",
              "Quotations provide a fixed price which creates a legal commitment for specific work",
              "Choosing correctly prevents disputes by matching the document's legal status to the certainty of the task"
            ],
            "expectedAnswer": [
              "A provider must choose based on certainty because an estimate is only an approximate calculation for unknown variables, whereas a quotation is a fixed legal offer. If the work is well-defined, a quotation ensures price certainty for both parties.",
              "Because an estimate is a non-binding projection of likely costs, it is used when work is uncertain; however, a quotation must be used when a formal fixed price is required to create a legally binding agreement."
            ],
            "hint": "Consider how the approximate nature of one document contrasts with the binding nature of the other."
          }
        ]
      }
    },
    {
      "id": "210-2B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Professional Standards and Authority",
        "content": "### In this lesson\nYou will learn about the standards of behavior expected in a professional environment and the specific boundaries of your role. Understanding these rules ensures you represent your company positively and stay within legal and operational limits.\n\n*   The impact of behavior, timekeeping, and dress code on professional reputation.\n*   The role of the contract of employment in defining work relationships.\n*   Identifying the limits of personal authority for Level 2 staff and apprentices.\n\n**What this is**\nProfessional standards are the set of rules and expectations defined by company policies. These typically cover behavior (how you interact with others), timekeeping (punctuality and reliability), and dress code (wearing the correct uniform or protective gear). These expectations are often formalised in a contract of employment, which is the legal agreement between the employer and the employee. Within this framework, every staff member has **Limits of Authority**, which are the defined boundaries within which an employee or apprentice is permitted to make decisions or financial commitments on behalf of the employer.\n\n**Why it matters**\nAdhering to company policies is vital because your actions reflect directly on the company’s brand and reputation. Poor timekeeping or inappropriate behavior can lead to lost contracts or disciplinary action. Furthermore, understanding your **Limits of Authority** is crucial for safety and financial stability. If an apprentice makes a promise they cannot keep, such as offering a discount or agreeing to a technical change they aren't qualified to assess, it can lead to legal disputes and financial loss for the business.\n\n**Key facts / rules**\n*   Behavior policies often include rules on language, social media use, and client interaction.\n*   A dress code ensures staff are easily identifiable and meet health and safety requirements.\n*   Timekeeping policies usually define procedures for reporting absences or lateness.\n*   The contract of employment outlines your rights, duties, and the notice period required to leave.\n*   **Limits of Authority** for Level 2 staff usually exclude signing off on safety certificates or pricing new work.\n*   Apprentices must always seek supervisor approval before deviating from a planned task.\n\n**When to choose it**\nProfessional standards should be applied in every interaction, whether with a colleague or a customer. You choose to follow the dress code every morning to ensure you are safe and recognisable on-site. You apply your understanding of **Limits of Authority** whenever a customer asks for a change to the project scope or a reduction in price; in these scenarios, you must refer the customer to a senior staff member. For example, if a customer offers an apprentice £200 to add an extra task not on the original plan, the apprentice must recognise their **Limits of Authority** and decline, directing the customer to the office for a formal amendment.\n\n**Common mistakes**\nLearners often confuse their technical skills with their **Limits of Authority**; even if you know how to do a task, you may not have the legal authority to sign off on it or price it. Another mistake is viewing the dress code as a suggestion rather than a mandatory safety and branding requirement.\n\nMisconceptions (targeted):\n*   Misconception: Apprentices can negotiate prices with customers to be helpful. | Correction: Apprentices must stay within their Limits of Authority and never negotiate financial terms. | AC: 210.LO2.AC2.4\n*   Misconception: Dress code is only about looking good. | Correction: Dress codes often incorporate Personal Protective Equipment (PPE) requirements and professional identification. | AC: 210.LO2.AC2.4\n\n**Key Points**\n*   Company policies on behavior and dress code maintain the firm’s professional image.\n*   The contract of employment is the legal foundation of your working relationship.\n*   **Limits of Authority** prevent staff from making commitments they are not authorised to handle.\n*   Punctuality is a core indicator of professional reliability.\n\n**Quick recap**\nProfessionalism is about more than just technical ability; it is about how you represent your company through your behavior, appearance, and reliability. By understanding your contract of employment and respecting your **Limits of Authority**, you protect yourself and your employer from unnecessary risks and ensure that the business runs smoothly.\n\n### Coming Up Next\nIn the next module, we will explore how to handle specific communication challenges when dealing with difficult situations or complex customer queries."
      }
    },
    {
      "id": "210-2B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Professional Standards and Authority",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-2B-C2-L1-A",
            "questionText": "What term describes the defined boundaries within which an employee or apprentice is permitted to make decisions?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Limits of Authority",
              "Limit of Authority",
              "Authority limits"
            ],
            "hint": "These boundaries define what you are allowed to commit the company to."
          },
          {
            "id": "210-2B-C2-L1-B",
            "questionText": "What must an apprentice do before they are allowed to deviate from a planned task?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Seek supervisor approval",
              "Ask supervisor",
              "Get supervisor approval"
            ],
            "hint": "This involves checking with a more senior member of staff."
          },
          {
            "id": "210-2B-C2-L1-C",
            "questionText": "What might an employee lack even if they possess the technical knowledge to perform a task?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Legal authority",
              "Formal authority",
              "Authority to sign off"
            ],
            "hint": "Knowing how to do something is different from having the official right to sign it off."
          },
          {
            "id": "210-2B-C2-L2",
            "questionText": "Using your answers to Q1 (limits of authority), Q2 (supervisor approval), and Q3 (technical skill vs authority), how do we know when an apprentice has exceeded their professional role?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Exceeding the role occurs when an apprentice moves outside their defined limits of authority",
              "Making decisions or technical changes without supervisor approval indicates a breach of boundaries",
              "Technical competence does not grant the legal authority required to sign off on work or change plans"
            ],
            "expectedAnswer": [
              "We know an apprentice has exceeded their role if they step outside their limits of authority by making decisions without seeking supervisor approval. Even if they have the technical skill, they lack the legal authority to deviate from the plan or sign off work.",
              "An apprentice exceeds their role when they ignore their limits of authority and fail to seek supervisor approval for changes. This is true because technical knowledge is separate from the formal legal authority needed to commit the business to a decision."
            ],
            "hint": "Think about the difference between being able to do a job and being allowed to sign it off."
          }
        ]
      }
    },
    {
      "id": "210-2B-worked-example",
      "type": "worked-example",
      "order": 6,
      "content": {
        "title": "Worked Example: Selecting Customer Documentation",
        "given": "A customer requests a guaranteed, fixed price for a standard maintenance task where all components are visible and the scope of work is clearly defined.",
        "steps": [
          {
            "stepNumber": 1,
            "description": "Identify context/constraints",
            "formula": null,
            "calculation": null,
            "result": "The task is specific and well-defined with no hidden variables or unknown factors."
          },
          {
            "stepNumber": 2,
            "description": "Select appropriate option",
            "formula": null,
            "calculation": null,
            "result": "Quotation"
          },
          {
            "stepNumber": 3,
            "description": "State purpose/result",
            "formula": null,
            "calculation": null,
            "result": "This provides a legally binding offer and a fixed price that cannot be changed once the customer accepts it."
          },
          {
            "stepNumber": 4,
            "description": "State common wrong choice and why",
            "formula": null,
            "calculation": null,
            "result": "An Estimate would be incorrect because it is a non-binding projection subject to change, which does not meet the customer's need for price certainty."
          }
        ],
        "notes": "Always ensure the scope of work is clearly documented within the quotation to maintain the fixed price. Verify current edition/version of consumer protection laws regarding statutory cancellation rights."
      }
    },
    {
      "id": "210-2B-guided",
      "type": "guided-practice",
      "order": 7,
      "content": {
        "title": "Guided Practice (We Do)",
        "problem": "A client asks for a price to repair a system where the internal condition of the infrastructure is hidden and the full extent of the required work cannot be confirmed until the project begins.",
        "steps": [
          {
            "stepNumber": 1,
            "prompt": "Identify the context and constraints regarding the visibility and certainty of the required work.",
            "expectedAnswer": [
              "Full extent of work is unknown",
              "Hidden variables are present"
            ],
            "hint": "Consider whether the service provider can see everything needed to determine the final cost."
          },
          {
            "stepNumber": 2,
            "prompt": "Select the appropriate document type to provide when the full extent of the work is unknown.",
            "expectedAnswer": [
              "Estimate",
              "An Estimate"
            ],
            "hint": "Look for the document used for approximate calculations rather than fixed prices."
          },
          {
            "stepNumber": 3,
            "prompt": "State the purpose or result of using this document type instead of a fixed price.",
            "expectedAnswer": [
              "Provides an approximate calculation subject to change",
              "Allows for price flexibility as work progresses"
            ],
            "hint": "Think about how this document protects the business if more work is discovered later."
          },
          {
            "stepNumber": 4,
            "prompt": "State the common wrong choice and explain why it is unsuitable for work with hidden variables.",
            "expectedAnswer": [
              "Quotation, because it is a fixed price for undefined work",
              "Quotation, as it cannot be changed once accepted"
            ],
            "hint": "Identify the document that would legally lock the business into a price before the full workload is known."
          }
        ]
      }
    },
    {
      "id": "210-2B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-2B-P1",
            "questionText": "A project is given a formal Quotation of 1200. After the work is completed, the provider calculates that the actual costs were 1450 due to a rise in material prices. What is the maximum amount the provider can legally invoice the customer for the agreed work?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1200",
              "1200.00"
            ],
            "hint": "Value in pounds (£). Remember that a quotation is a fixed price offer."
          },
          {
            "id": "210-2B-P2",
            "questionText": "A service provider gives an Estimate of 450 for a repair. During the work, hidden faults are discovered that require an additional 120 in labor and parts. What is the total final cost to be charged to the customer?",
            "answerType": "numeric",
            "expectedAnswer": [
              "570",
              "570.00"
            ],
            "hint": "Value in pounds (£). An estimate is an approximate calculation subject to change."
          },
          {
            "id": "210-2B-P3",
            "questionText": "Explain why a service provider cannot increase the price of a Quotation after it has been accepted, even if the work takes longer than expected.",
            "answerType": "short-text",
            "expectedAnswer": [
              "legally binding",
              "fixed price",
              "binding agreement",
              "fixed offer"
            ],
            "hint": "Consider the legal status of a quotation compared to an estimate."
          },
          {
            "id": "210-2B-P4",
            "questionText": "A client receives a document that summarizes all invoices issued and payments made over the last 30 days. Identify this document.",
            "answerType": "short-text",
            "expectedAnswer": [
              "statement",
              "account statement",
              "a statement"
            ],
            "hint": "This document provides a summary of account history rather than a request for a single payment."
          },
          {
            "id": "210-2B-P5",
            "questionText": "What is the primary purpose of the Handover process at the conclusion of a project?",
            "answerType": "short-text",
            "expectedAnswer": [
              "safety and operation",
              "transfer of information",
              "safe use",
              "operational instructions"
            ],
            "hint": "Think about the provider's duty to ensure the customer can use the installation correctly."
          }
        ]
      }
    },
    {
      "id": "210-2B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-2B-INT-1",
            "questionText": "Explain how adhering to professional standards like timekeeping and dress code supports the effective delivery of customer documentation. In your answer, include: (1) the role of company policies in establishing professional reputation, (2) the function of providing accurate quotations or estimates, (3) how professional conduct affects the client's perception of the documentation's validity. Why does this relationship between personal behavior and formal documentation hold true in a professional environment?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Professional standards (dress, timekeeping) create an initial foundation of trust and reliability with the client.",
              "Quotations and estimates serve as the formal financial and operational agreement for the service provided.",
              "Clients are more likely to trust the accuracy and fairness of pricing documents if the staff member appears disciplined and professional.",
              "Poor behavior can lead a client to question the attention to detail in the technical documentation provided.",
              "Reasoning: The relationship holds because professional conduct validates the service provider's competence, making the formal documentation more credible and legally robust."
            ],
            "expectedAnswer": [
              "Professional standards like dress code and timekeeping establish a reputation for discipline, which is essential when presenting quotations or estimates. If a staff member is punctual and professional, the client is more likely to trust that the pricing and project scope in the documentation are accurate and reliable. This relationship holds because the client views the staff member's personal conduct as a reflection of the organization's overall attention to detail and legal compliance.",
              "Adhering to company policies on behavior ensures that the service provider is seen as a credible authority when delivering formal documents like cancellation rights or estimates. When a staff member represents the company well, it reinforces the validity of the paperwork, whereas poor timekeeping might make a client doubt the provider's ability to meet the terms of a quotation. This holds true because professional reputation and formal documentation are both components of the overall contract of trust between the provider and the client."
            ],
            "hint": "Consider how a client's first impression of your behavior might change their level of trust in the financial documents you give them."
          },
          {
            "id": "210-2B-INT-2",
            "questionText": "Evaluate how a staff member integrates the use of customer documentation, professional standards, and authority limits to manage a successful project lifecycle. In your answer, include: (1) the purpose of pricing documents and statutory cancellation rights, (2) the impact of professional behavior on organizational reputation, (3) the importance of operating within defined authority limits, (4) how these factors collectively ensure legal and operational compliance. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Pricing documents (quotes/estimates) provide financial clarity and set project expectations.",
              "Statutory cancellation rights ensure the client is legally protected and the organization meets regulatory requirements.",
              "Adherence to behavior and dress codes reinforces the organization's brand and builds client confidence.",
              "Recognizing authority limits prevents staff from making unauthorized financial or operational commitments.",
              "Referring complex issues to a supervisor ensures that the project stays within legal and safety boundaries.",
              "Integration of these elements minimizes organizational risk and prevents contractual disputes.",
              "Consistent professional standards combined with accurate documentation result in high-quality service delivery."
            ],
            "expectedAnswer": [
              "A staff member manages a project by using quotations and cancellation rights to establish legal and financial clarity while maintaining professional behavior to build client trust. They must also operate strictly within their authority limits, referring any changes to a supervisor to ensure the project remains compliant with company policy. Together, these elements ensure the project is delivered legally, professionally, and within the scope of the staff member's specific role.",
              "• Accurate pricing documentation and cancellation rights provide the legal framework for the project and protect the client's interests.\n• High standards of dress and behavior protect the organization's reputation and ensure the client feels respected and informed.\n• Staying within personal authority limits ensures that staff do not exceed their technical or financial decision-making power.\n• This integrated approach ensures the service provider meets all legal obligations while maintaining a high standard of operational excellence."
            ],
            "hint": "Think about how following rules, knowing what you are allowed to decide, and using the right paperwork all work together to protect you and the business."
          }
        ]
      }
    },
    {
      "id": "210-2B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-2B-SR-1",
            "questionText": "What is the general term for an individual or business that receives and pays for a service?",
            "expectedAnswer": [
              "customer",
              "client",
              "consumer"
            ],
            "hint": "Think of the person who requests and pays for the work.",
            "answerType": "short-text"
          },
          {
            "id": "210-2B-SR-2",
            "questionText": "What term describes the official rules or guidelines that a business expects its staff to follow?",
            "expectedAnswer": [
              "policy",
              "policies",
              "company policy"
            ],
            "hint": "These are the written rules of a workplace.",
            "answerType": "short-text"
          },
          {
            "id": "210-2B-SR-3",
            "questionText": "What term is used for a person who is employed to learn a technical skill or trade through on-the-job training?",
            "expectedAnswer": [
              "apprentice",
              "trainee",
              "learner"
            ],
            "hint": "This person is usually at the start of their career path.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Customer Information and Company Policies"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2",
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO2",
      "coveredAC": [
        "AC1",
        "AC2",
        "AC3"
      ],
      "outOfScopeAC": [
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "The identification and purpose of customer-related documentation and the professional expectations of company policies.",
      "outOfScope": "The calculation of costs for quotations/estimates or the physical drafting of employment contracts.",
      "rationale": "Level 2 requirements focus on organizational awareness and professional conduct rather than financial or legal administration."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on 'purpose of' and 'importance of' as per mustHaveTopics constraints."
    },
    "misconceptions": [
      {
        "misconception": "An estimate is a final price.",
        "correction": "An estimate is a variable projection that can change as work progresses, unlike a quotation which is fixed.",
        "relatedAC": "210.LO2.AC2.3"
      },
      {
        "misconception": "Apprentices can sign off on any work changes.",
        "correction": "Apprentices must operate within their Limits of Authority and refer changes to a supervisor.",
        "relatedAC": "210.LO2.AC2.4"
      },
      {
        "misconception": "Cancellation rights only apply to poor quality work.",
        "correction": "Cancellation rights are a statutory time-based period allowing a customer to withdraw for any reason.",
        "relatedAC": "210.LO2.AC2.3"
      }
    ]
  }
}