{
  "id": "210-3B",
  "title": "210.3B — Conflict Resolution and Communication Impact",
  "description": "Learn about Conflict Resolution and Communication Impact in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Conflict Resolution and Communication Impact",
  "learningOutcomes": [
    "Identify common sources of conflict between different stakeholders in a technical environment",
    "Explain the negative effects of poor communication on organizational efficiency and customer relations",
    "Describe appropriate professional actions to resolve interpersonal conflicts within a workplace hierarchy"
  ],
  "prerequisites": [
    "210-3A"
  ],
  "blocks": [
    {
      "id": "210-3B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify common sources of conflict between different stakeholders in a technical environment",
            "bloomLevel": "remember"
          },
          {
            "text": "Explain the negative effects of poor communication on organizational efficiency and customer relations",
            "bloomLevel": "understand"
          },
          {
            "text": "Describe appropriate professional actions to resolve interpersonal conflicts within a workplace hierarchy",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "210-3B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Stakeholder",
            "definition": "A stakeholder is any person or group, such as a client, manager, or colleague, who has a direct interest in or is affected by the technical work being carried out."
          },
          {
            "term": "Communication Breakdown",
            "definition": "A communication breakdown is a failure to exchange information accurately or promptly, which leads to operational errors rather than a total lack of interaction."
          },
          {
            "term": "Chain of Command",
            "definition": "The chain of command is the formal hierarchy of an organization that establishes the reporting lines and the correct path for information flow and decision-making."
          },
          {
            "term": "Escalation",
            "definition": "Escalation is the formal procedure of referring a conflict or technical issue to a person with higher authority when it cannot be resolved at the immediate level."
          },
          {
            "term": "Active Listening",
            "definition": "Active listening is a communication method where the listener focuses entirely on the speaker to confirm understanding and de-escalate tension during a dispute."
          }
        ]
      }
    },
    {
      "id": "210-3B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Conflict Resolution Actions",
        "content": "### In this lesson\nYou will learn how to professionally manage and resolve disagreements between different parties in a technical workplace. This knowledge is applied whenever friction occurs between team members, management, or clients to ensure work continues safely and effectively. You will learn the importance of the hierarchy, the role of attentive communication, and when to seek higher-level assistance.\n\n*   How to apply professional actions to resolve interpersonal conflicts.\n*   The role of the workplace hierarchy in managing disputes.\n*   Techniques for de-escalating tension with various stakeholders.\n\n**What this is**\nConflict resolution is the process of finding a peaceful and professional solution to a disagreement between two or more parties. In a technical environment, a **stakeholder**—such as a client, a supervisor, or a colleague—may have different priorities or expectations, leading to friction. Resolving these disputes requires a structured approach that respects the professional relationship and the organizational structure.\n\n**Why it matters**\nUnresolved conflict can stall progress, create a hazardous working environment, and damage professional reputations. By following established procedures, you ensure that technical standards are maintained and that interpersonal issues do not compromise the safety or quality of the project. Using a formal **chain of command** ensures that the right person makes the final decision, preventing confusion and resentment.\n\n**Key facts / rules**\n*   Always remain calm and professional, regardless of the other person's tone.\n*   **Active listening** is mandatory to ensure all perspectives are understood before proposing a solution.\n*   Conflicts with customers should typically be handled by following company policy and involving a supervisor if the issue persists.\n*   Disagreements between co-workers should first be addressed privately and professionally between the individuals.\n*   If a conflict cannot be resolved at the immediate level, the formal process of **escalation** must be used.\n*   The **chain of command** defines who has the authority to make a final ruling on a technical or interpersonal dispute.\n\n**How to do it**\nTo resolve a conflict, first engage in **active listening**. This involves focusing entirely on the **stakeholder**, acknowledging their points, and asking clarifying questions. For example, if a customer is unhappy with the progress of a task, listen to their specific concerns without interrupting. Once the issue is identified, compare the concerns against the project requirements or company policy. If the dispute is with a co-worker regarding a technical method, refer to the standard operating procedures. If an agreement cannot be reached, follow the **chain of command** to report the issue to a supervisor. This **escalation** should be done neutrally, presenting the facts of the disagreement rather than personal feelings. \n\nConsider a scenario where two operatives disagree on the sequence of a task: Operative A wants to finish in 30 minutes to move to the next job, while Operative B insists on a 60-minute thorough check. By comparing these views against the safety manual, they can reach an objective decision rather than a personal one.\n\n**Common mistakes**\nLearners often confuse **escalation** with a personal complaint; **escalation** is a formal procedure to resolve a technical or procedural block, whereas a complaint is often an emotional reaction. Another common error is ignoring the **chain of command** by taking a problem directly to a high-level manager before speaking with an immediate supervisor.\n\nMisconceptions (targeted):\n*   Misconception: Conflict resolution means winning the argument. | Correction: Conflict resolution is about finding a professional path forward that meets the project's requirements. | AC: 210.LO3.AC3.3\n*   Misconception: Active listening is just staying quiet while the other person speaks. | Correction: Active listening requires providing feedback and confirming understanding to ensure the speaker feels heard. | AC: 210.LO3.AC3.3\n\n**Key Points**\n*   Use **active listening** to de-escalate tension and gather facts.\n*   Respect the **chain of command** when disputes arise.\n*   Apply **escalation** procedures when an immediate resolution is not possible.\n*   Focus on professional standards rather than personal opinions.\n\n**Quick recap**\nConflict resolution involves using professional communication and organizational structures to solve disagreements. By engaging in **active listening** and respecting the **chain of command**, you can manage disputes with any **stakeholder** effectively, ensuring that the work environment remains productive and safe.\n\n### Coming Up Next\nNext, we will examine the specific organizational consequences that occur when these communication methods fail."
      }
    },
    {
      "id": "210-3B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Conflict Resolution Actions",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-C1-L1-A",
            "questionText": "What is mandatory to ensure all perspectives are understood before proposing a solution?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Active listening",
              "active listening techniques",
              "active listening is mandatory"
            ],
            "hint": "This involves focusing entirely on the stakeholder and asking clarifying questions."
          },
          {
            "id": "210-3B-C1-L1-B",
            "questionText": "Where should disagreements between co-workers first be addressed according to professional standards?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Privately and professionally",
              "privately and professionally between individuals",
              "private and professional discussion"
            ],
            "hint": "Think about the initial setting required before involving other parties."
          },
          {
            "id": "210-3B-C1-L1-C",
            "questionText": "What defines who has the authority to make a final ruling on a dispute?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "The chain of command",
              "chain of command",
              "formal chain of command"
            ],
            "hint": "This organizational structure ensures the right person makes the final decision."
          },
          {
            "id": "210-3B-C1-L2",
            "questionText": "Using your answers to Q1 (active listening), Q2 (private resolution), and Q3 (chain of command), explain how these facts connect. Why must a professional attempt active listening and private resolution before using the chain of command?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Active listening is the tool used to attempt private resolution between co-workers",
              "Private resolution is the first step in the professional process before escalation",
              "The chain of command is only used for a final ruling if private active listening fails",
              "This relationship ensures disputes are managed at the lowest possible level to maintain efficiency"
            ],
            "expectedAnswer": [
              "Active listening allows co-workers to understand each other and resolve issues privately and professionally first. If these private efforts do not work, the chain of command is then used to provide a final ruling. This matters because it prevents every small disagreement from immediately becoming a formal management issue.",
              "Professionals use active listening to try and reach an agreement privately between individuals. We must do this first because the chain of command is reserved for when an immediate resolution is not possible. This keeps the workplace productive by solving problems without unnecessary escalation."
            ],
            "hint": "Consider how the first two actions serve as a filter before reaching the final authority."
          }
        ]
      }
    },
    {
      "id": "210-3B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Impact of Poor Communication",
        "content": "### In this lesson\nYou will learn to identify the signs and consequences of ineffective information exchange within a technical organization. This knowledge helps you understand how small errors in sharing data can lead to large-scale operational failures. You will explore how a **communication breakdown** impacts efficiency, safety, and the relationship between a company and its clients.\n\n*   Identifying common sources of conflict caused by poor information flow.\n*   Understanding the negative effects of miscommunication on organizational efficiency.\n*   Recognizing the impact of poor communication on customer relations.\n\n**What this is**\nPoor communication occurs when information is missing, incorrect, or delivered to the wrong person. This often results in a **communication breakdown**, which is not a total lack of talking, but a failure to exchange information accurately or promptly. This can happen between operatives, between management and staff, or between the company and an external **stakeholder**.\n\n**Why it matters**\nIn technical fields, precision is vital. A lack of clarity can lead to wasted materials, missed deadlines, and even physical danger. When a **communication breakdown** occurs, it erodes the trust a customer has in the organization, potentially leading to a loss of future work and a damaged professional reputation. Efficiency drops because tasks often have to be repeated or corrected.\n\n**Key facts / rules**\n*   Vague instructions are a primary source of conflict between management and operatives.\n*   Inaccurate data transfer leads to operational errors and wasted resources.\n*   Poor communication with a customer often results in unrealistic expectations and dissatisfaction.\n*   A **communication breakdown** can lead to safety hazards if critical warnings are not passed on.\n*   Efficiency is measured by the ability to complete a task correctly the first time; poor communication prevents this.\n*   The **chain of command** must be used to ensure information reaches the correct level of authority.\n\n**How to recognise it**\nYou can recognise poor communication by looking for specific indicators in the workplace. One major sign is a high rate of 're-work,' where tasks must be done twice because the initial requirements were misunderstood. Another indicator is a lack of alignment between different departments; for example, if the procurement team orders materials for a project that the technical team has already changed. In customer relations, poor communication is often visible through frequent complaints regarding delays or unexpected costs. \n\nImagine a scenario where a manager tells an operative to \"check the sensors\" without specifying which floor or which system. If the operative spends 4 hours checking the wrong area, the 100% increase in time spent is a direct result of a **communication breakdown**. This is like a broken link in a mechanical chain; even if every other part is strong, the system cannot pull the load.\n\n**Common mistakes**\nLearners often confuse a **communication breakdown** with a lack of effort; a **communication breakdown** is an operational failure of information flow, whereas a lack of effort is a performance issue. People also mistake \"hearing\" for \"understanding,\" assuming that because a message was sent, it was correctly interpreted by the **stakeholder**.\n\nMisconceptions (targeted):\n*   Misconception: Communication only fails if people stop talking to each other. | Correction: A communication breakdown often happens while people are talking, but the information being exchanged is inaccurate or incomplete. | AC: 210.LO3.AC3.4\n*   Misconception: Poor communication only affects the people involved in the conversation. | Correction: Poor communication impacts the entire organization's efficiency and the satisfaction of every stakeholder involved. | AC: 210.LO3.AC3.4\n\n**Key Points**\n*   **Communication breakdown** leads to operational errors and reduced efficiency.\n*   Vague instructions create conflict between different levels of the **chain of command**.\n*   Poor communication with customers damages professional reputation and trust.\n*   Accuracy in information exchange is critical for workplace safety.\n\n**Quick recap**\nPoor communication has a ripple effect throughout an organization, causing inefficiency, safety risks, and poor customer relations. By identifying the signs of a **communication breakdown**, such as re-work or conflicting instructions, you can take steps to correct the flow of information and maintain professional standards.\n\n### Coming Up Next\nIn the next module, we will look at the specific documentation used to record and prevent these communication issues."
      }
    },
    {
      "id": "210-3B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Impact of Poor Communication",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-C2-L1-A",
            "questionText": "What is identified as a primary source of conflict between management and operatives?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Vague instructions",
              "vague instruction",
              "unclear instructions"
            ],
            "hint": "This occurs when the details of a task are not specified clearly."
          },
          {
            "id": "210-3B-C2-L1-B",
            "questionText": "How is efficiency measured in a technical work environment?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Ability to complete a task correctly the first time",
              "completing a task correctly the first time",
              "complete tasks correctly first time"
            ],
            "hint": "Efficiency is linked to the lack of re-work or corrections."
          },
          {
            "id": "210-3B-C2-L1-C",
            "questionText": "When does a communication breakdown often happen even if people are still talking to each other?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "When information is inaccurate",
              "information being exchanged is inaccurate",
              "information is inaccurate or incomplete"
            ],
            "hint": "A breakdown is not just a lack of talking, but a failure in the quality of the data."
          },
          {
            "id": "210-3B-C2-L2",
            "questionText": "Using your answers to Q1 (vague instructions), Q2 (efficiency), and Q3 (inaccurate information), explain how these facts connect. How do we know that inaccurate information leads to a decrease in efficiency?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Vague instructions are a form of inaccurate or incomplete information exchange",
              "Inaccurate information prevents an operative from completing a task correctly the first time",
              "We know this connection is valid because the resulting need for re-work directly reduces the measured efficiency"
            ],
            "expectedAnswer": [
              "Vague instructions mean that the information being exchanged is inaccurate or incomplete, which is a communication breakdown. This prevents the worker from completing the task correctly the first time. We know this reduces efficiency because it leads to re-work, which wastes time and resources.",
              "A communication breakdown happens when vague instructions provide inaccurate information to a worker. Because the worker lacks clear data, they cannot complete the task correctly the first time. This relationship is valid because any task that requires being done twice due to poor info is by definition inefficient."
            ],
            "hint": "Think about how the quality of an instruction affects the outcome of the work performed."
          }
        ]
      }
    },
    {
      "id": "210-3B-worked-example",
      "type": "worked-example",
      "order": 6,
      "content": {
        "title": "Worked Example: Identifying Conflict Resolution Actions",
        "given": "Two operatives disagree on the time required for a safety inspection. One wants to finish quickly to move to the next job, while the other insists on a longer, thorough check according to the manual.",
        "steps": [
          {
            "stepNumber": 1,
            "description": "Identify context and constraints",
            "formula": null,
            "calculation": null,
            "result": "Disagreement between co-workers regarding a technical method and safety standards."
          },
          {
            "stepNumber": 2,
            "description": "Select appropriate option",
            "formula": null,
            "calculation": null,
            "result": "Engage in active listening and compare views against the safety manual/standard operating procedures."
          },
          {
            "stepNumber": 3,
            "description": "State purpose or result",
            "formula": null,
            "calculation": null,
            "result": "To reach an objective decision based on professional standards rather than personal opinion."
          },
          {
            "stepNumber": 4,
            "description": "State common wrong choice and why",
            "formula": null,
            "calculation": null,
            "result": "Ignoring the chain of command by taking the issue to a high-level manager before speaking privately with the colleague."
          }
        ],
        "notes": "Always refer to the specific standard operating procedures of your organization; verify current edition/version of safety manuals."
      }
    },
    {
      "id": "210-3B-guided",
      "type": "guided-practice",
      "order": 7,
      "content": {
        "title": "Guided Practice (We Do)",
        "problem": "A client (stakeholder) is unhappy with the progress of a technical project and is speaking to you in an aggressive tone, demanding an immediate change to the work schedule.",
        "steps": [
          {
            "stepNumber": 1,
            "prompt": "Identify the context and the stakeholders involved in this scenario.",
            "expectedAnswer": [
              "External stakeholder conflict",
              "Client disagreement"
            ],
            "hint": "Consider who is involved and the nature of the friction being described."
          },
          {
            "stepNumber": 2,
            "prompt": "Select the appropriate professional action to take first to manage the situation.",
            "expectedAnswer": [
              "Active listening",
              "Follow company policy"
            ],
            "hint": "Recall the mandatory communication technique used to ensure all perspectives are understood."
          },
          {
            "stepNumber": 3,
            "prompt": "State the purpose of using this specific communication action.",
            "expectedAnswer": [
              "De-escalate tension",
              "Gather facts"
            ],
            "hint": "Think about what is achieved by acknowledging the stakeholder's points without interrupting."
          },
          {
            "stepNumber": 4,
            "prompt": "State a common wrong choice and why it would be ineffective in this context.",
            "expectedAnswer": [
              "Winning the argument",
              "Personal complaint"
            ],
            "hint": "Reflect on the misconception that conflict resolution is about personal victory rather than professional paths forward."
          }
        ]
      }
    },
    {
      "id": "210-3B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-3B-P1",
            "questionText": "A technician spends 5 hours on a task due to vague instructions. If the task should have taken 2 hours with clear communication, how many hours were wasted?",
            "answerType": "numeric",
            "expectedAnswer": [
              "3",
              "3.0"
            ],
            "hint": "Subtract the required time from the total time spent to find the lost efficiency in hours."
          },
          {
            "id": "210-3B-P2",
            "questionText": "Explain why a communication breakdown can occur even when two stakeholders are actively speaking to each other.",
            "answerType": "short-text",
            "expectedAnswer": [
              "inaccurate information",
              "incomplete information",
              "vague instructions",
              "incorrect data"
            ],
            "hint": "Consider the quality and accuracy of the information being exchanged rather than the volume of talking."
          },
          {
            "id": "210-3B-P3",
            "questionText": "A stakeholder demands a work method that violates the safety manual. After listening to their concerns, the technician still cannot reach an agreement. What formal process should be used to resolve this?",
            "answerType": "short-text",
            "expectedAnswer": [
              "escalation",
              "escalate the issue",
              "formal escalation",
              "escalate"
            ],
            "hint": "This involves moving the problem to a higher level in the chain of command."
          },
          {
            "id": "210-3B-P4",
            "questionText": "What must be true if a conflict is being resolved professionally rather than one person simply winning the argument?",
            "answerType": "short-text",
            "expectedAnswer": [
              "meets project requirements",
              "follows technical standards",
              "objective path forward",
              "meets professional standards"
            ],
            "hint": "Professional resolution focuses on the needs of the project and the organization rather than personal feelings."
          },
          {
            "id": "210-3B-P5",
            "questionText": "A supervisor gives a team of 4 operatives incorrect data. Each operative spends 1.5 hours working before the error is identified and corrected. How many total labor hours were lost to this breakdown?",
            "answerType": "numeric",
            "expectedAnswer": [
              "6",
              "6.0"
            ],
            "hint": "Multiply the number of operatives by the time each one spent on the incorrect task."
          }
        ]
      }
    },
    {
      "id": "210-3B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-INT-1",
            "questionText": "Explain how a breakdown in information flow necessitates specific professional responses to maintain workplace harmony. In your answer, include: (1) a specific negative effect of poor communication on efficiency, (2) a professional action used to resolve interpersonal conflict, and (3) the role of the workplace hierarchy in the resolution process. Why is identifying the root communication error essential before applying a resolution action?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies a specific impact on efficiency such as operational failure or safety risks.",
              "Describes a professional resolution action like active listening or mediation.",
              "Explains how the hierarchy provides a framework for escalation or formal guidance.",
              "Connects the communication failure directly to the resulting interpersonal friction.",
              "Argues that without identifying the root error, the resolution will only be temporary or superficial."
            ],
            "expectedAnswer": [
              "A breakdown in communication often leads to operational failures that decrease efficiency, requiring professionals to use active listening to de-escalate resulting friction. If the conflict persists, the workplace hierarchy allows for the matter to be escalated to management for formal intervention. Identifying the root communication error is essential because the resolution action must address the specific source of the misunderstanding to prevent the same operational failure from recurring.",
              "When data is shared incorrectly, it causes delays that harm efficiency, which must be addressed through professional mediation between the affected parties. The hierarchy ensures that there is a clear chain of command to authorize changes to communication protocols. One must identify the root error first because applying a generic resolution may fail to fix the underlying technical misinformation that caused the conflict."
            ],
            "hint": "Consider how a misunderstanding about technical data leads to an argument and how you would fix both the data error and the argument."
          },
          {
            "id": "210-3B-INT-2",
            "questionText": "Synthesize the impact of stakeholder interactions on the overall success of a technical project. In your answer, include: (1) a primary source of conflict between stakeholders, (2) the resulting effect on organizational efficiency, (3) the role of attentive communication in resolution, and (4) how professional actions prevent the escalation of conflict within the hierarchy. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Identifies a source of conflict such as misaligned objectives or resource competition.",
              "Describes the negative impact on efficiency such as downtime or wasted resources.",
              "Explains how attentive communication clarifies technical requirements and stakeholder needs.",
              "Outlines professional actions like seeking higher-level assistance when appropriate.",
              "Links conflict resolution to the preservation of customer relations and trust.",
              "Demonstrates how hierarchy provides a structured path for resolving complex disputes.",
              "Concludes that professional standards ensure operational continuity despite interpersonal friction."
            ],
            "expectedAnswer": [
              "Conflicts often arise from misaligned stakeholder objectives, which can lead to significant downtime and reduced organizational efficiency. To resolve this, professionals use attentive communication to clarify requirements and apply hierarchical protocols to escalate issues that cannot be solved at a peer level. These professional actions prevent minor disagreements from damaging customer relations and ensure that the project remains technically viable and safe.",
              "• A primary source of conflict is often the competition for limited resources between different departments.\n• This leads to decreased efficiency as teams wait for necessary inputs or approvals.\n• Attentive communication and professional mediation help stakeholders align their priorities and resolve friction.\n• Following the workplace hierarchy ensures that conflicts are managed by the appropriate authority, preserving long-term customer trust."
            ],
            "hint": "Focus on how professional behavior and communication flow together to keep a business running smoothly even when people disagree."
          }
        ]
      }
    },
    {
      "id": "210-3B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-3B-SR-1",
            "questionText": "What term is used to describe the range of individual differences, such as culture and background, that should be respected in a workplace?",
            "expectedAnswer": [
              "Diversity",
              "Inclusion",
              "Equality"
            ],
            "hint": "This was covered in your previous lesson on communication methods.",
            "answerType": "short-text"
          },
          {
            "id": "210-3B-SR-2",
            "questionText": "Name one common method used to exchange information or instructions with others in a professional environment.",
            "expectedAnswer": [
              "Verbal",
              "Written",
              "Email",
              "Digital"
            ],
            "hint": "Consider the different ways you send or receive messages at work.",
            "answerType": "short-text"
          },
          {
            "id": "210-3B-SR-3",
            "questionText": "Which workplace documents contain the official rules and standard procedures that all employees are required to follow?",
            "expectedAnswer": [
              "Company policies",
              "Staff handbook",
              "Workplace documentation",
              "Policies"
            ],
            "hint": "These documents ensure that everyone follows the same organizational standards.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Conflict Resolution and Communication Impact"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3",
    "AC4"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "PROCEDURE, IDENTIFICATION",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO3",
      "coveredAC": [
        "AC3",
        "AC4"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Interpersonal conflict resolution strategies and the systemic impact of communication failures on business operations.",
      "outOfScope": "Formal legal mediation, technical documentation standards, or specific disciplinary HR procedures.",
      "rationale": "The lesson focuses on the behavioral and organizational aspects of communication rather than the technical tools or legal frameworks."
    },
    "teachingConstraints": {
      "excludeHowTo": false,
      "purposeOnly": false,
      "identificationOnly": false,
      "noCalculations": true,
      "specificScope": "Focus on the relationship between operative, supervisor, and customer interactions."
    },
    "misconceptions": [
      {
        "misconception": "Escalation is a sign of personal failure or an inability to do the job.",
        "correction": "Escalation is a formal, professional procedure used to ensure the correct level of authority handles a specific issue.",
        "relatedAC": "210.LO3.AC3.3"
      },
      {
        "misconception": "Communication only fails if people stop talking to each other.",
        "correction": "A communication breakdown often happens while people are talking, but the information being exchanged is inaccurate or incomplete.",
        "relatedAC": "210.LO3.AC3.4"
      },
      {
        "misconception": "Active listening is just staying quiet while the other person speaks.",
        "correction": "Active listening requires providing feedback and confirming understanding to ensure the speaker feels heard.",
        "relatedAC": "210.LO3.AC3.3"
      }
    ]
  }
}