{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn about Site Visitors and Inspectors in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify the key roles and reasons for different personnel visiting a site",
    "Describe the specific regulatory duties of Building Control and HSE inspectors",
    "Differentiate between the inspection scopes of water and electrical services inspectors"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the key roles and reasons for different personnel visiting a site",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the specific regulatory duties of Building Control and HSE inspectors",
            "bloomLevel": "understand"
          },
          {
            "text": "Differentiate between the inspection scopes of water and electrical services inspectors",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Regulatory Body",
            "definition": "An official organization with legal power to set standards and enforce rules, similar to how a referee enforces rules in sports."
          },
          {
            "term": "Building Control",
            "definition": "Inspectors who check the physical building (walls, foundations, insulation) to ensure it is safe to inhabit and meets sustainability laws."
          },
          {
            "term": "HSE Inspector",
            "definition": "An official from the Health and Safety Executive who checks that people are working safely (e.g., wearing helmets, using safe scaffolding)."
          },
          {
            "term": "Statutory Inspection",
            "definition": "A mandatory site visit required by law that the site management cannot refuse."
          },
          {
            "term": "Compliance",
            "definition": "The act of following all rules and laws. If a site is 'compliant', it passes the inspection."
          },
          {
            "term": "Inspection Scope",
            "definition": "The specific limit of what an inspector is allowed to check (e.g., a water inspector checks pipes but ignores electrical wiring)."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Roles of Site Visitors",
        "content": "### In this lesson\nThis lesson identifies the key roles and reasons for different personnel visiting a site. You will learn to distinguish between general visitors (like clients) and regulatory inspectors.\n\n**What this is**\nA **Site Visitor** is anyone who enters the site but does not work there permanently. Think of them like guests in a restaurant kitchen: they are allowed to be there for a specific reason, but they don't cook the food daily. \n\nCommon visitors include:\n*   **The Client**: The person or company paying for the project. They visit to see if the building looks like what they paid for.\n*   **The Architect**: The designer. They visit to answer technical questions (e.g., \"Is this wall in the right place?\").\n*   **Delivery Drivers**: They bring materials (bricks, pipes) and usually stay near the loading bay.\n\n**Why it matters**\nConstruction sites are dangerous places with moving machinery and hidden hazards. If you don't know who is on-site, you cannot keep them safe. For example, if a client wanders near a crane without a hard hat, they could be injured. Identifying the visitor's role helps you decide how much supervision they need.\n\n**Key facts / rules**\n*   **Sign-In Rule**: Every visitor must sign in so there is an accurate list (manifest) in case of a fire.\n*   **The 'Why' Rule**: The reason for the visit determines access. A driver needs the loading bay; an architect needs to see the structural beams.\n*   **Authority**: General visitors (clients, drivers) do **not** have the authority to give orders to the workforce regarding safety procedures; they must follow site rules.\n\n**When to choose it**\nWhen someone arrives at the gate, ask: \"Who are you and why are you here?\"\n*   If they say \"I'm here to drop off cement,\" they are a **Delivery Driver** (Low access).\n*   If they say \"I designed this building and need to check the roof,\" they are an **Architect** (High technical access).\n\n**Common mistakes**\nLearners often think **Clients** can change safety rules because they pay the bills. This is false. Clients must follow all safety instructions given by the Site Manager.\n\nMisconceptions (targeted):\n*   **Misconception**: All site visitors have the same level of authority as the site manager. | **Correction**: Visitors usually have limited authority and must follow the instructions of site staff regarding safety and movement. | **AC**: AC3\n*   **Misconception**: Delivery drivers do not count as visitors because they stay in their vehicles. | **Correction**: Anyone entering the site boundaries is a visitor and must be accounted for in safety logs. | **AC**: AC3"
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Roles of Site Visitors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "What is the primary safety reason for requiring every visitor to sign in and out?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "maintain fire safety manifest",
              "fire safety manifest",
              "accurate fire safety manifest",
              "know who is on site for emergency",
              "emergency roll call"
            ],
            "hint": "Think about what the fire brigade needs to know if there is an emergency evacuation."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Which visitor role is primarily concerned with clarifying technical drawings and resolving design discrepancies?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Architect",
              "Designer",
              "The Architect"
            ],
            "hint": "This person created the plans and visits to ensure the building matches their design."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Does a general site visitor (like a client) have the legal authority to enforce safety laws on the workforce?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "No",
              "No they do not",
              "False"
            ],
            "hint": "Only specific government inspectors have legal enforcement powers; clients are just customers."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Why must a Site Manager treat a Delivery Driver differently from an Architect when they arrive at the gate? Use the concepts of 'Access' and 'Purpose' in your answer.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The Delivery Driver only needs access to the loading area to drop off materials",
              "The Architect needs access to the building structure to check designs",
              "The Manager limits access based on the purpose to keep the site safe and organized"
            ],
            "expectedAnswer": [
              "The Site Manager treats them differently because their purposes require different levels of access. A Delivery Driver only needs to go to the loading bay to drop off materials, so they are restricted from the main build. An Architect needs to inspect the work against drawings, so they require access to the construction zones. Restricting access based on purpose keeps the site safe.",
              "Because the Delivery Driver's purpose is just to drop off goods, they are limited to the loading area. The Architect's purpose is technical inspection, so they are granted wider access. This ensures people only go where they need to be."
            ],
            "hint": "Compare where the driver needs to go versus where the architect needs to go."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Regulatory and Specialist Inspectors",
        "content": "### In this lesson\nThis lesson describes the duties of **Regulatory Inspectors** (who enforce laws) and **Specialist Inspectors** (who check specific systems like water or electricity).\n\n**What this is**\nUnlike general visitors, these individuals have **legal power** or **certification authority**.\n\n1.  **HSE Inspector (Health & Safety Executive)**:\n    *   **Focus**: **PEOPLE**. They check if workers are safe (e.g., \"Are you wearing a harness? Is that ladder safe?\").\n    *   **Power**: Can stop work immediately if they see danger.\n2.  **Building Control Officer**:\n    *   **Focus**: **THE BUILDING**. They check if the structure is sound (e.g., \"Are the foundations deep enough? Is the insulation thick enough?\").\n    *   **Power**: Can order you to demolish unsafe work.\n3.  **Specialist Inspectors** (Water/Electrical):\n    *   **Focus**: **SYSTEMS**. They have a narrow **Inspection Scope**. A water inspector checks pipes but ignores wiring. An electrical inspector checks fuses but ignores drains.\n\n**Why it matters**\nA visit from these inspectors is often a **Statutory Inspection**—meaning it is required by law. You cannot refuse them entry. Failing their checks can lead to fines, prosecution, or the building being declared illegal to use.\n\n**Key facts / rules**\n*   **Building vs. People Rule**: Building Control looks at the *product* (the wall). HSE looks at the *process* (how you built the wall safely).\n*   **Scope Rule**: Never ask a water inspector to sign off on electrical work. They are only authorized for their specific trade.\n*   **Compliance**: This means passing the check. If the inspector says the work is \"compliant,\" it meets the legal standard.\n\n**When to choose it**\n*   Call **Building Control** when you finish a major stage (e.g., foundations poured).\n*   Expect **HSE** at any time (they often do spot checks).\n*   Call a **Specialist** when commissioning a specific system (e.g., turning on the power).\n\n**Common mistakes**\nConfusing **HSE** with **Building Control**. Remember: HSE protects the *worker*; Building Control protects the *future resident*.\n\nMisconceptions (targeted):\n*   **Misconception**: Inspectors are only there to give advice. | **Correction**: While they may offer guidance, their primary role is to enforce **Compliance** with the law; they can prosecute for failures. | **AC**: AC3\n*   **Misconception**: All inspectors can check any part of the site. | **Correction**: Each inspector has a specific **Inspection Scope**; for example, a water inspector cannot certify electrical wiring. | **AC**: AC3"
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which inspector focuses primarily on the safety and quality of the finished building structure (e.g., foundations, walls)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Building Control",
              "Building Control Officer",
              "Building inspector"
            ],
            "hint": "They check the 'Building' to ensure it follows regulations."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "What limits a water inspector from certifying electrical wiring?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Inspection Scope",
              "Scope",
              "Their scope",
              "Limited scope"
            ],
            "hint": "This term refers to the specific boundary of what they are allowed to check."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "Can a Site Manager refuse entry to an HSE Inspector conducting a statutory inspection?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "No",
              "Cannot refuse",
              "No they cannot",
              "Mandatory"
            ],
            "hint": "This visit is required by law (statutory)."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Explain the difference between an HSE Inspector and a Building Control Officer using the 'People vs. Product' rule.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE Inspector focuses on People (worker safety, PPE, safe practices)",
              "Building Control focuses on Product (the structure, foundations, insulation)",
              "HSE checks the process; Building Control checks the result"
            ],
            "expectedAnswer": [
              "The HSE Inspector focuses on the People. They check if workers are safe, wearing PPE, and using safe equipment during the build. The Building Control Officer focuses on the Product. They check if the finished building (walls, foundations) is safe to live in.",
              "HSE is about the safety of the workforce (People) during construction. Building Control is about the quality and compliance of the structure (Product) for future use."
            ],
            "hint": "One protects the workers building the site; the other protects the people who will eventually live there."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A site has a maximum safe occupancy of 30 people. There are 22 staff members and 3 visitors currently signed in. How many more visitors can be admitted before reaching the limit?",
            "answerType": "numeric",
            "expectedAnswer": [
              "5"
            ],
            "hint": "Total people = 22 + 3. Max = 30. Calculate the difference."
          },
          {
            "id": "210-1B-P2",
            "questionText": "The visitor log shows 14 people signed in this morning. By noon, 6 of them signed out. Then, 5 new visitors arrived and signed in. How many visitors are currently on site?",
            "answerType": "numeric",
            "expectedAnswer": [
              "13"
            ],
            "hint": "Start with 14. Subtract those who left (6). Add those who arrived (5)."
          },
          {
            "id": "210-1B-P3",
            "questionText": "Why is a 'Statutory Inspection' different from a client visit in terms of refusal?",
            "answerType": "short-text",
            "expectedAnswer": [
              "mandatory by law",
              "legally required",
              "cannot be refused",
              "statutory means mandatory"
            ],
            "hint": "Think about the legal requirement. You can tell a client 'not today', but you cannot tell the law 'no'."
          },
          {
            "id": "210-1B-P4",
            "questionText": "A specialist arrives to check the chemical storage tank. You ask them to also check the fire alarm wiring. They refuse. What term describes why they refused?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Inspection Scope",
              "Scope",
              "Scope of inspection"
            ],
            "hint": "They are adhering to the limits of their technical authority."
          },
          {
            "id": "210-1B-P5",
            "questionText": "Which regulatory official would you expect to see if there was a report of dangerous scaffolding on site?",
            "answerType": "short-text",
            "expectedAnswer": [
              "HSE Inspector",
              "HSE",
              "Health and Safety Executive"
            ],
            "hint": "This involves the safety of people and working conditions."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Imagine you are a Site Manager. An Architect and an HSE Inspector arrive at the same time. Compare how you would handle these two visitors. In your answer, include: (1) The purpose of each visit, (2) The authority each person holds, and (3) Why the HSE Inspector might take priority.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Architect visits to check design/drawings; HSE visits to enforce safety law",
              "Architect has no direct authority over safety; HSE has legal power to stop work",
              "HSE takes priority because safety compliance is a legal requirement and they can shut down the site"
            ],
            "expectedAnswer": [
              "I would welcome the Architect to check the designs, but I would prioritize the HSE Inspector. The Architect is there for technical reasons and has no legal authority over safety. The HSE Inspector is there to enforce the law and has the power to stop work if they find danger. Because the HSE visit is statutory and concerns immediate safety, their requirements take priority over the design check.",
              "The Architect is a general visitor there to resolve design issues, while the HSE Inspector is a regulatory official enforcing safety laws. The HSE Inspector has the authority to issue fines or stop work, whereas the Architect does not. Therefore, I must prioritize the HSE Inspector to ensure the site remains legally compliant and open."
            ],
            "hint": "One is a technical partner; the other is a legal enforcer. Which one can shut down your job?"
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "How do 'Specialist Inspectors' (like water/elec) and 'Building Control' work together to ensure the final building is safe? Explain how their different 'Scopes' cover the whole project.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Specialist inspectors cover specific systems (water, electric) in detail",
              "Building Control covers the overall structure and general regulations",
              "Together they ensure every part of the building (systems + structure) is compliant",
              "Their scopes do not overlap but complement each other"
            ],
            "expectedAnswer": [
              "Specialist inspectors focus on specific systems within their scope, such as ensuring the wiring is safe (Electrical) or pipes are sealed (Water). Building Control focuses on the broader scope of the building's structure and insulation. By working together, the Specialists certify the complex inner workings, while Building Control certifies the overall shell, ensuring the entire project is safe and compliant.",
              "They cover the whole project by dividing the work. Specialists handle technical utilities (water/power) that require specific expertise. Building Control handles the general construction standards (walls/roof). Combined, they ensure both the structure and the services inside it meet the law."
            ],
            "hint": "Think of it like a puzzle: The Specialist checks the pieces (wires/pipes), and Building Control checks the frame holding it all together."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "What is the job title of the person responsible for the overall daily management and coordination of a construction site?",
            "expectedAnswer": [
              "Site Manager",
              "Project Manager",
              "Site Supervisor"
            ],
            "hint": "This role oversees all trade roles and visitors.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What term is used to describe laws and regulations that are mandatory to follow on a worksite?",
            "expectedAnswer": [
              "Statutory",
              "Statutory legislation",
              "Legislation"
            ],
            "hint": "This word means 'required by law' (starts with S).",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What formal safety briefing must all new visitors receive before entering the site?",
            "expectedAnswer": [
              "Site induction",
              "Induction",
              "Safety induction"
            ],
            "hint": "A mandatory briefing for new arrivals.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Site Visitors and Inspectors"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC3"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification of site visitors and the purpose of specific regulatory inspectors (AC3).",
      "outOfScope": "Detailed management roles (AC1) or supervisor roles (AC2), technical inspection procedures.",
      "rationale": "Focus is strictly on identifying visitors and their authority levels as per AC3."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on role identification and purpose of inspectors only"
    },
    "misconceptions": [
      {
        "misconception": "All site visitors have the same level of authority as the site manager.",
        "correction": "Visitors usually have limited authority and must follow the instructions of site staff regarding safety and movement.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "All inspectors can check any part of the site.",
        "correction": "Each inspector has a specific Inspection Scope; for example, a water inspector cannot certify electrical wiring.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "Inspectors are only there to give advice.",
        "correction": "While they may offer guidance, their primary role is to enforce Compliance with the law.",
        "relatedAC": "AC3"
      }
    ]
  }
}