{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn about Site Visitors and Inspectors in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify the primary categories of site visitors and their general roles.",
    "Explain the specific purpose and authority of statutory inspectors on a construction site.",
    "Differentiate between the oversight areas of building control, water, electrical, and HSE inspectors."
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the primary categories of site visitors and their general roles.",
            "bloomLevel": "remember"
          },
          {
            "text": "Explain the specific purpose and authority of statutory inspectors on a construction site.",
            "bloomLevel": "understand"
          },
          {
            "text": "Differentiate between the oversight areas of building control, water, electrical, and HSE inspectors.",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Inspector",
            "definition": "An individual with the legal authority to enter and inspect a site to ensure work complies with national legislation. Unlike a general visitor, they do not always need an invitation.",
            "anchor": "Like a health inspector in a restaurant who can enter the kitchen without asking."
          },
          {
            "term": "Regulatory Compliance",
            "definition": "The state of meeting all mandatory legal requirements and technical codes of practice, rather than just following the client's design preferences.",
            "anchor": "Following the law (must do), not just the blueprints (want to do)."
          },
          {
            "term": "Health and Safety Executive (HSE)",
            "definition": "The national independent regulator responsible for enforcing workplace health and safety legislation to prevent accidents.",
            "anchor": "The 'police' for workplace safety rules."
          },
          {
            "term": "Building Control",
            "definition": "The body responsible for verifying that the physical construction meets minimum legal standards for structural safety and sustainability.",
            "anchor": "Inspectors who check if the building will stand up and is safe to occupy."
          },
          {
            "term": "Enforcement Notice",
            "definition": "A formal legal document issued by an inspector that requires a contractor to fix a breach or stop work immediately.",
            "anchor": "A legal 'Red Card' that stops the game until the rules are followed."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Site Visitor Roles",
        "content": "### In this lesson\nWe will identify the different people who come to a site but do not work there permanently. You will learn how to handle them based on why they are there.\n\n**What this is**\nA **site visitor** is anyone crossing the site boundary who is not part of the regular workforce. Imagine you are at the site gate. A van pulls up. It could be:\n1.  **Commercial Visitor:** A delivery driver dropping off bricks. They need access to the loading bay.\n2.  **Professional Visitor:** An architect or engineer checking the plans. They need access to the work face.\n3.  **Member of the Public:** Someone asking for directions or a trespasser. They should not be there.\n\n**Why it matters**\nConstruction sites are dangerous places for people who don't know the risks. \n*   **Scenario:** A delivery driver walks behind a reversing excavator because they don't know the blind spots. \nTo prevent this, every visitor must be identified at the gate. If you know *who* they are, you know *where* they can go and what safety gear (PPE) they need.\n\n**Key facts / rules**\n*   **Report Immediately:** All visitors must go straight to the site office or reception.\n*   **Sign In:** Everyone must sign the register. If there is a fire, the fire brigade needs to know exactly how many people are inside.\n*   **Induction:** Most visitors need a safety briefing (induction) to learn the local rules (e.g., \"Wear a hard hat,\" \"Stay on the yellow path\").\n*   **Escorts:** General visitors (like clients or drivers) usually need a member of the site team to walk with them.\n\n**Common mistakes**\n*   *Mistake:* Thinking delivery drivers don't count as visitors.\n*   *Correction:* Even if they stay in the cab, they are on site. If an emergency alarm sounds, you need to know they are there.\n\n**Misconceptions (targeted):**\n*   *Misconception:* All visitors have the same access rights once they sign in.\n*   *Correction:* Access is restricted based on role. A delivery driver goes to the stores; an architect goes to the building; a client might go everywhere but only with an escort. (AC 1.3)"
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Site Visitor Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "What defines a 'site visitor' compared to the regular workforce?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "not part of the permanent workforce",
              "not contracted workforce",
              "non-permanent personnel",
              "temporary visitor"
            ],
            "hint": "Think about whether they work on the site every day or just arrived for a specific reason."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "What is the very first thing a visitor must do upon arriving at the site boundary?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "report to site office",
              "go to reception",
              "sign in",
              "report to reception"
            ],
            "hint": "They cannot just walk onto the site; they must go to a specific building first."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Why must every visitor sign the site register?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "emergency roll call",
              "fire safety record",
              "account for everyone in emergency",
              "track who is on site"
            ],
            "hint": "If a fire alarm sounds, how does the manager know who is inside?"
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "A delivery driver arrives to drop off materials, and an architect arrives to inspect a wall. Using the rules of visitor management, explain why their treatment at the gate might differ despite both being 'visitors'.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Both must sign in and report to the office (universal rule)",
              "Delivery driver is a commercial visitor needing limited access (loading bay)",
              "Architect is a professional visitor needing work-face access",
              "The level of induction and escorting depends on the hazards they will face"
            ],
            "expectedAnswer": [
              "Both must sign in at the site office, but their access differs. The delivery driver is a commercial visitor who only needs access to the loading bay, so they might get a short briefing. The architect is a professional visitor who needs to go into the construction area (work face), so they require a full safety induction and likely an escort to ensure they stay safe near hazards.",
              "While both are visitors and must sign in, the driver only goes to the stores, whereas the architect goes to the active work area. This means the architect faces more risks and needs a more detailed safety briefing and supervision compared to the driver."
            ],
            "hint": "Consider where they need to go on the site and what risks they will encounter."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Regulatory and Statutory Inspectors",
        "content": "### In this lesson\nWe will look at a special category of visitor: the **Statutory Inspector**. These individuals have the power to stop your work.\n\n**What this is**\nA statutory inspector works for the government or a regulatory body. Unlike a client who *asks* for things, an inspector *enforces* the law.\n\n**Key Types of Inspectors:**\n1.  **HSE (Health and Safety Executive):**\n    *   *Focus:* **People**. They check if the site is safe for workers (e.g., \"Is that trench likely to collapse on someone?\").\n    *   *Power:* Can stop work immediately if there is a risk to life.\n2.  **Building Control:**\n    *   *Focus:* **Structure**. They check if the building meets legal standards (e.g., \"Are these foundations deep enough? Is the insulation correct?\").\n    *   *Power:* Can demand you tear down work that doesn't meet the code.\n3.  **Utility Inspectors (Water/Electric):**\n    *   *Focus:* **Supply**. They check connections to the public grid (e.g., \"Will this wiring blow up the street transformer?\").\n\n**The Enforcement Notice**\nIf an inspector finds a serious problem, they issue an **Enforcement Notice**. This is a legal order.\n*   *Scenario:* An HSE inspector sees workers on a roof without guardrails. They issue a Prohibition Notice.\n*   *Result:* All work on the roof must stop immediately. It is a crime to continue until the safety measures are fixed.\n\n**Common mistakes**\n*   *Mistake:* Thinking you can refuse entry to an inspector if you are busy.\n*   *Correction:* Statutory inspectors have a **legal right of entry**. You cannot stop them from entering to do their job.\n\n**Misconceptions (targeted):**\n*   *Misconception:* Inspectors are just there to find fault.\n*   *Correction:* Their primary role is ensuring safety and compliance to protect people and the public. (AC 1.3)"
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Statutory Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which specific inspector focuses primarily on the safety and welfare of the people working on the site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "HSE",
              "Health and Safety Executive",
              "H.S.E."
            ],
            "hint": "This body enforces workplace health and safety laws."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which inspector focuses on the structure itself, ensuring it meets building regulations and sustainability standards?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Building Control",
              "Building inspector",
              "Building control officer"
            ],
            "hint": "They check the foundations, walls, and insulation, not the workers."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "What legal document can an inspector issue to force a contractor to stop work immediately?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Enforcement Notice",
              "Prohibition Notice",
              "Improvement Notice",
              "Stop work notice"
            ],
            "hint": "It is a formal notice that enforces the law."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Explain the difference between a Client visiting the site and an HSE Inspector visiting the site in terms of their authority to stop work.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Client has commercial authority (pays the bills) but cannot legally enforce safety laws",
              "HSE Inspector has statutory authority (legal power) to stop work immediately for safety breaches",
              "Client requests changes; HSE demands compliance under threat of prosecution"
            ],
            "expectedAnswer": [
              "A Client can ask for changes because they pay for the project, but they cannot legally enforce safety rules. An HSE Inspector has statutory authority, meaning they have the legal power to order work to stop immediately if they see a danger. The Client relies on the contract, while the Inspector relies on the law.",
              "The main difference is legal power. The HSE Inspector can issue an Enforcement Notice to legally halt work if it is unsafe. A Client is just a visitor with a commercial interest and does not have the legal power to shut down the site for safety violations."
            ],
            "hint": "One relies on the contract (money), the other relies on the law (statutes)."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "Why is a Statutory Inspector permitted to enter a site without an invitation, unlike a general visitor?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Legal authority",
              "Statutory right of entry",
              "Legal power",
              "Statutory power"
            ],
            "hint": "Their power comes from national law, not site management permission."
          },
          {
            "id": "210-1B-P2",
            "questionText": "A site has three visitors: a Client, an Architect, and an HSE Officer. How many of these individuals have the legal power to issue a formal Enforcement Notice?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "Only the one working for a government regulator has this power."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A delivery crew of 4 people arrives. To ensure the fire register is accurate, how many of them must sign in?",
            "answerType": "numeric",
            "expectedAnswer": [
              "4"
            ],
            "hint": "Every single person crossing the boundary counts."
          },
          {
            "id": "210-1B-P4",
            "questionText": "An inspector arrives to check that the new water pipes do not contaminate the public mains supply. What category of inspector is this?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Utility Inspector",
              "Water inspector",
              "Utilities"
            ],
            "hint": "They focus on services like water, gas, or electricity."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain the relationship between general visitor management and statutory inspectors. Include: (1) how their right to enter differs, (2) why both must still follow site safety rules (like wearing boots), and (3) what happens if site management tries to block a statutory inspector.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "General visitors need permission/invitation; Statutory inspectors have legal right of entry",
              "Both must follow safety rules (PPE/induction) because hazards don't care about rank",
              "Blocking a statutory inspector is a legal offence/obstruction",
              "Safety rules protect the person; Statutory power protects the public"
            ],
            "expectedAnswer": [
              "General visitors need an invitation to enter, whereas statutory inspectors have a legal right of entry. However, both must follow site safety rules, such as wearing PPE, because the physical hazards of the site (like falling objects) apply to everyone regardless of their rank. If site management tries to block a statutory inspector, they are committing a legal offence because the inspector's authority comes from national law.",
              "Inspectors can enter by law, while general visitors need permission. Despite this, everyone must wear PPE and follow safety rules for their own protection. Blocking an inspector is illegal and can lead to prosecution."
            ],
            "hint": "Think about 'Right of Entry' vs 'Safety of Self'. Does having legal power stop a brick from falling on your head?"
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Synthesize the roles of HSE, Building Control, and Utility inspectors. In 3-4 bullet points, describe what each one checks and why their specific oversight is necessary for a compliant building.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "HSE checks unsafe practices to protect workers (people safety)",
              "Building Control checks structural standards to protect future occupants (building safety)",
              "Utility inspectors check connections to protect public infrastructure (grid safety)",
              "Together they ensure the project is safe to build, safe to use, and safe to connect"
            ],
            "expectedAnswer": [
              "• HSE Inspectors check working practices (like scaffolding safety) to ensure workers are not injured during construction.\n• Building Control checks the physical structure (like foundations and insulation) to ensure the building is safe for future occupants and meets legal codes.\n• Utility Inspectors check connections (like water and electricity) to ensure the site does not damage or contaminate public supplies.\n• All three are necessary to ensure the project is safe to build, safe to inhabit, and safe to connect to the network."
            ],
            "hint": "Focus on: HSE = Workers, Building Control = Structure, Utilities = Grid."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "What is the collective name for the personnel responsible for the daily oversight and coordination of a construction project?",
            "expectedAnswer": [
              "site management team",
              "site management",
              "management team"
            ],
            "hint": "This was covered in the lesson on key roles of the site team.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What term is used to describe legal requirements and regulations that are mandatory for site activities?",
            "expectedAnswer": [
              "statutory",
              "legislation",
              "statutes",
              "law"
            ],
            "hint": "Look for the word used to describe mandatory legal acts or guidance.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What is the general term for specialized workers, such as plumbers or electricians, who carry out specific tasks on site?",
            "expectedAnswer": [
              "trade roles",
              "trades",
              "tradespeople",
              "skilled trades"
            ],
            "hint": "This distinguishes the manual workers from the management team.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Site Visitors and Inspectors"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC 1.3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC 1.3"
      ],
      "outOfScopeAC": [
        "AC 1.1",
        "AC 1.2"
      ]
    },
    "scope": {
      "inScope": "Identification of key site visitors (AC 1.3) and the specific regulatory purposes of major inspectors.",
      "outOfScope": "Specific inspection procedures, technical testing methods, or internal site communication protocols.",
      "rationale": "Focus is on identifying personnel and their authority roles (AC 1.3) rather than the technical procedures they carry out."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on role identification and areas of authority for specific inspectors mentioned."
    },
    "misconceptions": [
      {
        "misconception": "All visitors have the same access rights once they sign in.",
        "correction": "Access is restricted based on the visitor's specific role and the hazards present in certain zones.",
        "relatedAC": "AC 1.3"
      },
      {
        "misconception": "An inspector needs the site manager's permission to enter.",
        "correction": "A Statutory Inspector has legal right of entry to perform their duties under national legislation.",
        "relatedAC": "AC 1.3"
      },
      {
        "misconception": "Inspectors are only there to find someone to blame for mistakes.",
        "correction": "Their primary purpose is to ensure the project meets legal safety and technical standards for the protection of the public.",
        "relatedAC": "AC 1.3"
      }
    ]
  }
}