{
  "id": "210-1B",
  "title": "210.1B — Construction Team Roles and Visitors",
  "description": "Learn the roles of the Site Management Team, reporting lines, and the distinction between statutory and non-statutory visitors.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Construction team members and roles",
  "learningOutcomes": [
    "Identify key roles of the site management team including Contracts Manager and Site Agent.",
    "Identify key roles of individuals reporting to site management such as the Quantity Surveyor and Foreman.",
    "Identify key roles of site visitors and distinguish statutory inspectors from professional visitors."
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify key roles of the site management team including Contracts Manager and Site Agent.",
            "bloomLevel": "remember"
          },
          {
            "text": "Identify key roles of individuals reporting to site management such as the Quantity Surveyor and Foreman.",
            "bloomLevel": "understand"
          },
          {
            "text": "Identify key roles of site visitors and distinguish statutory inspectors from professional visitors.",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Contracts Manager",
            "definition": "A senior manager responsible for overseeing multiple construction projects and site teams simultaneously, ensuring they stay within budget and contract terms."
          },
          {
            "term": "Site Agent",
            "definition": "The person responsible for the day-to-day running of a specific site, managing safety, schedules, and the workforce (also called Site Manager or Project Manager)."
          },
          {
            "term": "Quantity Surveyor (QS)",
            "definition": "A financial professional who manages project costs, contracts, and payments to ensure the project remains profitable and within budget."
          },
          {
            "term": "Clerk of Works",
            "definition": "An independent inspector appointed by the client to monitor the quality of work and ensure it matches the specifications and drawings."
          },
          {
            "term": "Statutory Inspector",
            "definition": "An official with legal authority (e.g., from the HSE or Building Control) to enter a site to enforce laws and regulations."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Site Management Team and Reporting Lines",
        "content": "### In this lesson\nYou will learn the hierarchy of a construction site, from the managers who plan the work to the supervisors who oversee the gangs. You will also learn who handles the money and who checks the quality.\n\n*   Differentiate between a **Contracts Manager** and a **Site Agent**.\n*   Understand the role of the **Quantity Surveyor (QS)**.\n*   Identify the supervision duties of a **Foreman**.\n\n**What this is**\nA construction site relies on a clear Chain of Command to function safely and efficiently. This hierarchy ensures everyone knows who to report to.\n\n**The Hierarchy (Visual Anchor)**\n1.  **Contracts Manager (Strategic/Off-site):** Sits at the top of the project view. They manage *multiple* sites, deal with the client's contract, and visit occasionally to check progress.\n2.  **Site Agent / Site Manager (Operational/On-site):** The \"Captain of the Ship.\" They are on *one* specific site every day, responsible for safety, logistics, and ensuring the work gets done on time.\n3.  **Foreman / Ganger (Supervisory/Task-based):** Reports to the Site Agent. They supervise a specific trade group (or \"gang\") of operatives, such as the bricklayers or electricians.\n\n**Specialist Reporting Roles**\n*   **Quantity Surveyor (QS):** Focusing on finance. They calculate material costs, pay subcontractors, and manage the budget. They report on financial health.\n*   **Clerk of Works:** Focusing on quality. Uniquely, they often report directly to the **Client** (not the builder), acting as the client's \"eyes\" to ensure the building is built correctly to the drawings.\n\n**Why it matters**\nKnowing the difference between these roles prevents confusion. If you have a query about your pay or a material order, you might speak to the **QS**. If you have a safety concern about a trench, you speak to the **Foreman** or **Site Agent**. If you see someone inspecting the quality of the brickwork who isn't part of your team, it is likely the **Clerk of Works** protecting the client's interest.\n\n**Micro-scenario:** \nA project is running late. The **Foreman** pushes the gang to work faster. The **Site Agent** reorganizes the schedule to recover lost time. The **Contracts Manager** visits to explain the delay to the client. Meanwhile, the **Quantity Surveyor** calculates the cost of the overtime wages.\n\n**Key facts**\n*   **Contracts Manager** = Multiple sites, strategic view.\n*   **Site Agent** = Single site, day-to-day control.\n*   **Foreman** = Direct supervision of workers.\n*   **Clerk of Works** = Quality inspection for the Client.\n\n**Common mistakes**\nLearners often confuse the **Clerk of Works** with a **Site Manager**. Remember: The Site Manager runs the build; the Clerk of Works *checks* the build for the client."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Management Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "Which manager is typically responsible for overseeing multiple projects and site managers simultaneously?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Contracts Manager",
              "Contract Manager"
            ],
            "hint": "This role is strategic and off-site, dealing with the business side of several projects."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Who is the specific financial professional responsible for managing project costs and contracts?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS",
              "The Quantity Surveyor"
            ],
            "hint": "They count materials and manage the money."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Which role acts as the independent quality inspector reporting directly to the client?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Clerk of Works",
              "The Clerk of Works"
            ],
            "hint": "They are the 'eyes' of the client, checking work against drawings."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Explain the difference in responsibility between a Contracts Manager and a Site Agent. How does their scope of control differ?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Contracts Manager oversees multiple sites/projects.",
              "Site Agent manages a single site day-to-day.",
              "Contracts Manager is strategic/client-facing; Site Agent is operational/safety-facing.",
              "Scope: Contracts Manager = Business/Portfolio; Site Agent = Site Operations."
            ],
            "expectedAnswer": [
              "The Contracts Manager is responsible for multiple projects at a strategic level, handling client contracts and budgets across several sites. In contrast, the Site Agent is responsible for the day-to-day operations, safety, and logistics of one specific site. While the Contracts Manager visits occasionally, the Site Agent is permanently on-site to direct the work.",
              "A Contracts Manager oversees the business aspects of many sites, whereas a Site Agent controls the practical work on a single site."
            ],
            "hint": "Think about 'Many Sites vs. One Site' and 'Strategy vs. Daily Operations'."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Site Visitors: Statutory and Non-Statutory",
        "content": "### In this lesson\nYou will learn to categorize people who visit the site but are not part of the permanent team. We distinguish them by their **power**: some have the legal right to stop work, while others are guests.\n\n*   Identify **Statutory Inspectors** (HSE, Building Control).\n*   Identify **Professional Visitors** (Architects, Engineers).\n*   Understand the authority differences.\n\n**What this is**\nNot everyone on site reports to the Site Agent. Visitors fall into two main groups based on their authority.\n\n**1. Statutory Inspectors (The Enforcers)**\nThese visitors represent a **Regulatory Body** and have legal powers defined by UK law.\n*   **Health and Safety Executive (HSE):** Focuses on *people's safety*. They can enter any workplace at any reasonable time without an appointment. If they see danger, they can issue a **Prohibition Notice** to stop work immediately.\n*   **Building Control:** Focuses on the *building's compliance*. They check structures, fire safety, and drainage against Building Regulations. They usually visit at specific stages (e.g., before foundations are poured).\n\n**2. Non-Statutory Visitors (The Guests)**\nThese visitors are there for business reasons but do not have legal enforcement powers.\n*   **Professional Visitors:** Architects, Structural Engineers, Client Representatives. They inspect progress or resolve technical queries. They must follow site rules and be inducted.\n*   **Transient Visitors:** Delivery drivers, couriers. They are on site briefly and usually require an escort or restriction to specific zones.\n\n**Why it matters**\nSite management must treat these groups differently. An **HSE Inspector** has the right to demand documents and interview staff immediately. An **Architect** is an invited guest who must wait for an induction and permission to enter the work zone. Confusing the two can lead to legal trouble or safety breaches.\n\n**Micro-scenario:** \nTwo people arrive at the gate. \n*   Person A shows a warrant card from the HSE. The Site Agent must grant them entry immediately to inspect a scaffold.\n*   Person B is the Client wishing to see the new kitchen. The Site Agent asks them to wait for a safety briefing and PPE before entering.\n\n**Key distinction**\n*   **Statutory:** Legal power, Right of Entry, Enforcement (HSE, Building Control).\n*   **Non-Statutory:** Invited, Contractual, Must follow site rules (Architect, Client, Delivery)."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Site Visitors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which organization has the legal power to enter a site without an appointment to inspect safety?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Health and Safety Executive",
              "HSE",
              "the HSE"
            ],
            "hint": "They are the national regulator for workplace health and safety."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "What is the primary focus of a Building Control officer?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "building regulations",
              "compliance with building regulations",
              "structural compliance"
            ],
            "hint": "They check that the physical building meets national standards (e.g., fire safety, foundations)."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "Does a professional visitor, like an Architect, have the legal power to issue a Prohibition Notice to stop work?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "No",
              "no"
            ],
            "hint": "Only statutory inspectors representing a regulatory body have this specific legal power."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Compare the authority of an HSE Inspector with that of a Client visiting the site. Who has the legal right of entry and why?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE Inspector has statutory (legal) right of entry.",
              "Client is a non-statutory visitor (guest/owner) and must follow site access rules.",
              "HSE authority comes from legislation (Health & Safety at Work Act).",
              "Client authority is contractual/ownership but subject to safety rules."
            ],
            "expectedAnswer": [
              "The HSE Inspector has a statutory legal right to enter the site at any reasonable time to enforce safety laws. The Client, although they own the project, is considered a non-statutory visitor regarding safety and must follow site access rules and inductions. The HSE can enforce laws; the Client cannot.",
              "An HSE Inspector has legal authority from the government to enter and inspect. A Client is a guest on the working site and does not have statutory enforcement powers."
            ],
            "hint": "One has a badge from the government; the other has a contract with the builder."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "Who is the on-site manager responsible for the day-to-day running of the project, including safety and logistics?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Site Agent",
              "Site Manager",
              "Project Manager"
            ],
            "hint": "They are the 'Captain' of the site, present every day."
          },
          {
            "id": "210-1B-P2",
            "questionText": "A site requires 1 Foreman for every 8 operatives to ensure safe supervision. If there are 32 operatives working on the site, how many Foremen are required?",
            "answerType": "numeric",
            "expectedAnswer": [
              "4"
            ],
            "hint": "Divide the total operatives by the number allowed per foreman."
          },
          {
            "id": "210-1B-P3",
            "questionText": "Which specific statutory inspector would you call to inspect the depth and reinforcement of a foundation trench before concrete is poured?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Building Control",
              "Building Control Officer",
              "Building Inspector"
            ],
            "hint": "They check compliance with building regulations and structural standards."
          },
          {
            "id": "210-1B-P4",
            "questionText": "Which financial role tracks material costs and manages payments to subcontractors?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS"
            ],
            "hint": "This person deals with the budget and contracts."
          },
          {
            "id": "210-1B-P5",
            "questionText": "Which independent role inspects the quality of work on behalf of the client to ensure it meets specifications?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Clerk of Works"
            ],
            "hint": "They are the client's eyes on site, checking quality."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "A project is behind schedule and over budget. An accident occurs involving a fall from height. Explain the roles of the Site Agent, Quantity Surveyor, and HSE Inspector in this scenario. Who deals with the schedule, who deals with the costs, and who investigates the accident? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Site Agent manages the schedule and site safety response.",
              "Quantity Surveyor manages the costs/budget implications.",
              "HSE Inspector investigates the accident and legal compliance.",
              "Clear distinction between operational, financial, and regulatory roles."
            ],
            "expectedAnswer": [
              "The Site Agent is responsible for managing the schedule recovery and the immediate safety response on site. The Quantity Surveyor will assess the financial impact of the delay and the costs. The HSE Inspector will enter the site to investigate the cause of the accident and ensure safety laws were followed.",
              "The Site Agent handles the day-to-day operations and schedule. The QS handles the budget and cost overruns. The HSE Inspector investigates the legal safety breach."
            ],
            "hint": "Match the role to the problem: Schedule -> Manager, Cost -> QS, Accident -> HSE."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Explain the chain of command and authority on a site involving a Contracts Manager, Site Agent, and Statutory Inspector. How does the Statutory Inspector's authority differ from the Contracts Manager's authority over the Site Agent? (3-4 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Contracts Manager has employment/contractual authority over Site Agent.",
              "Statutory Inspector has legal/regulatory authority over the entire site.",
              "Inspector can override managers on safety issues.",
              "Chain of command: Contracts Manager -> Site Agent -> Foreman.",
              "External authority: Inspector -> Site."
            ],
            "expectedAnswer": [
              "The Contracts Manager has employment authority over the Site Agent, directing them on business and strategic goals. However, the Statutory Inspector holds legal authority that supersedes both managers regarding safety or compliance; they can stop work even if the managers want to continue. While the Site Agent reports to the Contracts Manager for the job, they must obey the Statutory Inspector for the law.",
              "The Contracts Manager directs the Site Agent based on the company's business needs. The Statutory Inspector directs the site based on national laws. The Inspector's authority is superior in safety matters, meaning they can shut down the site regardless of the Contracts Manager's instructions."
            ],
            "hint": "One gives orders because they are the boss; the other gives orders because they enforce the law."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "What is the general term for the location where construction work takes place?",
            "expectedAnswer": [
              "site",
              "construction site",
              "workplace"
            ],
            "hint": "It is the physical area controlled by the contractor.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What do the initials HSE stand for?",
            "expectedAnswer": [
              "Health and Safety Executive",
              "Health & Safety Executive"
            ],
            "hint": "The national regulator for workplace safety.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What is the primary document used to track who enters and leaves the site?",
            "expectedAnswer": [
              "site register",
              "visitor log",
              "signing in book",
              "register"
            ],
            "hint": "You must sign this when you arrive and leave.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check on site basics."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1.1",
    "AC1.2",
    "AC1.3"
  ],
  "metadata": {
    "created": "2026-02-17",
    "updated": "2026-02-17",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, DIFFERENTIATION",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1.1",
        "AC1.2",
        "AC1.3"
      ],
      "outOfScopeAC": [
        "AC1.4",
        "AC1.5"
      ]
    },
    "scope": {
      "inScope": "Roles of the site management team, reporting lines, and categorization of site visitors/inspectors.",
      "outOfScope": "Detailed inspection procedures, specific building regulations codes, or communication protocols.",
      "rationale": "The lesson covers the full hierarchy of site personnel (Management, Reporting, Visitors) as required by LO1."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": false,
      "specificScope": "Focus on the 'who' and 'why' of the roles."
    },
    "misconceptions": [
      {
        "misconception": "The Site Agent and Contracts Manager are the same role.",
        "correction": "The Site Agent manages one site daily; the Contracts Manager oversees multiple sites strategically.",
        "relatedAC": "AC1.1"
      },
      {
        "misconception": "The Clerk of Works works for the construction company.",
        "correction": "The Clerk of Works is appointed by the Client to independently check quality.",
        "relatedAC": "AC1.2"
      },
      {
        "misconception": "All visitors have the same right of entry.",
        "correction": "Statutory inspectors (HSE) have legal right of entry; professional visitors (Architects) are invited guests.",
        "relatedAC": "AC1.3"
      }
    ]
  }
}