{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn about Site Visitors and Inspectors in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "State the primary purpose of site visitors and inspectors in a technical environment",
    "Describe the specific responsibilities of Building Control, Water, HSE, and Electrical inspectors",
    "Identify the appropriate inspector required for specific site compliance scenarios"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "State the primary purpose of site visitors and inspectors in a technical environment",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the specific responsibilities of Building Control, Water, HSE, and Electrical inspectors",
            "bloomLevel": "understand"
          },
          {
            "text": "Identify the appropriate inspector required for specific site compliance scenarios",
            "bloomLevel": "remember"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Compliance",
            "definition": "Meeting strict legal laws and national standards, not just following optional advice or internal site rules. (Example: Stopping at a red light is compliance; choosing a route is a preference.)"
          },
          {
            "term": "Statutory Inspection",
            "definition": "A mandatory check by an external government-approved official to ensure the law is being followed. (Example: A health inspector visiting a restaurant.)"
          },
          {
            "term": "Building Control",
            "definition": "The official process of checking that a building's structure, fire safety, and insulation meet national codes. (Example: Like a car's annual MOT test.)"
          },
          {
            "term": "Health and Safety Executive (HSE)",
            "definition": "The national government body with the power to enforce workplace safety laws and prosecute companies for danger. (Example: The 'police' for workplace safety.)"
          },
          {
            "term": "Enforcement Notice",
            "definition": "A legal order issued by an inspector that forces work to stop or be fixed immediately. (Example: A 'Stop Work' order from a judge.)"
          },
          {
            "term": "Remedial Action",
            "definition": "Mandatory work required to fix a legal failure identified by an inspector. (Example: Fixing a broken brake light to pass inspection.)"
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Roles of Site Visitors",
        "content": "### In this lesson\nYou will learn to identify the different people who visit a site and understand their powers. This is vital for keeping the site legal and safe.\n\n*   The difference between a **General Visitor** (guest) and a **Statutory Inspector** (enforcer).\n*   What **Compliance** means in the real world.\n*   Why you must check credentials before letting someone on site.\n\n**What this is**\nImagine you are working on a busy construction site. Two people arrive at the gate. One is the client, who wants to see if the kitchen layout looks nice. The other is a government official checking if the fire exits are legal. Both are visitors, but they have very different roles.\n\n*   **General Visitors:** Clients, architects, or suppliers. They are there to observe, plan, or deliver. They have no legal power to stop you working.\n*   **Statutory Inspectors:** Officials from external bodies (like the Council or HSE). They are there to ensure **Compliance**. **Compliance** means strictly following the law. If you don't meet the standards, these inspectors can legally punish the site.\n\n**Why it matters**\nIf you treat a Statutory Inspector like a casual guest, you might accidentally break the law. A **Statutory Inspection** is a formal, legal exam. It's not a chat; it's a test. Knowing the difference ensures you give the inspector the right access and documentation immediately.\n\n**Key facts / rules**\n*   **Sign-In:** *Everyone* (no exceptions) must sign in at the site office. This is your first line of defense to check who they are.\n*   **Induction:** All visitors must be briefed on safety hazards (e.g., \"Don't walk there, we are lifting steel\").\n*   **Authority:** A client can *ask* you to change a wall color. An inspector can *order* you to rebuild the wall if it's unsafe.\n*   **PPE:** Visitors must wear the same safety gear (helmets, boots) as workers.\n\n**How to recognise it**\nThink of a professional kitchen. \n*   A **Food Blogger** (General Visitor) comes in to taste the food and look at the plating. They care about *quality* and *preference*.\n*   A **Health Inspector** (Statutory Inspector) comes in to check the fridge temperature and rat traps. They care about *safety* and *law*.\n\n**Scenario:**\nA site has 10 visitors in a week. \n*   9 are potential buyers measuring rooms for curtains (General Visitors).\n*   1 is from the Local Authority checking the foundation depth (Statutory Inspector).\nOnly the 10th visitor is a matter of legal **Compliance**.\n\n**Common mistakes**\n*   *Mistake:* Thinking a \"Quality Check\" by your boss is the same as a \"Statutory Inspection.\"\n*   *Correction:* Your boss checks if the work looks good (Quality). The Inspector checks if the work is legal (Statutory).\n\n**Misconceptions**\n*   **Misconception:** All visitors can stop work if they don't like it.\n*   **Correction:** Only specific inspectors (like HSE) have the legal power to stop work via formal notices. A client can only ask the manager.\n*   **Misconception:** A verbal warning from a visitor is legally binding.\n*   **Correction:** Legal instructions come in written **Enforcement Notices**. Verbal advice is just advice."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Roles of Site Visitors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "What is the term for meeting strict legal requirements and laws, rather than just following internal site preferences?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Compliance",
              "Legal compliance",
              "Regulatory compliance"
            ],
            "hint": "It starts with C. It means doing exactly what the law says."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Where is the very first place any visitor must go when they arrive at a site to be identified?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site office",
              "The site office",
              "Main site office",
              "Security office",
              "Reception"
            ],
            "hint": "They need to sign the register here before entering the work area."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Who performs a Statutory Inspection: someone from your own company or someone from an external government body?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "External government body",
              "External body",
              "External authority",
              "Government body",
              "External"
            ],
            "hint": "Think of the Health Inspector example—do they work for the restaurant or the government?"
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Why is it dangerous to treat a Statutory Inspector like a general visitor? Use the concepts of 'Legal Power' and 'Compliance' in your answer.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Statutory Inspectors have legal power to enforce laws (Compliance), unlike general visitors.",
              "Treating them casually might lead to failing a legal check.",
              "They need specific access to prove the site is safe and legal."
            ],
            "expectedAnswer": [
              "A Statutory Inspector has the legal power to enforce Compliance and even stop work, whereas a general visitor does not. Treating them casually could lead to legal penalties or the site being shut down if they cannot verify that laws are being followed.",
              "Because the Inspector is there to check legal Compliance, they have the power to issue fines or notices. A general visitor implies no legal risk, so confusing them could lead to serious consequences for the site management."
            ],
            "hint": "Think about what an inspector can do to the site (shut it down) that a client cannot."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Regulatory Inspectors",
        "content": "### In this lesson\nYou will learn which specific inspector handles which part of the site (Structure, Safety, Water, Electricity) and what happens if you fail an inspection.\n\n**What this is**\nDifferent inspectors act like different specialized referees. They don't overlap.\n\n1.  **Building Control:** Checks the **product** (the building). Is the foundation deep enough? Is the insulation thick enough? Is it fire-safe?\n2.  **HSE (Health & Safety Executive):** Checks the **process** (the people). Are workers wearing hard hats? Is the trench supported so it won't collapse on someone?\n3.  **Water & Electrical Inspectors:** Check the **utilities**. Is the wiring safe? Is the drinking water pipe separate from the sewage pipe?\n\n**The Consequences**\nIf an inspector sees something illegal, they don't just complain. They issue an **Enforcement Notice**. This is a legal document that says: \"Fix this now, or we prosecute you.\" \n\nThe work you do to fix the problem is called **Remedial Action**. This isn't normal maintenance; it is emergency repair work to avoid breaking the law.\n\n**How to recognise it**\n*   **Scenario A:** You are digging a trench. \n    *   If the **HSE** visits, they look at the *shoring* (is it safe for the digger?).\n    *   If **Building Control** visits, they look at the *soil* (is it strong enough to hold the building?).\n*   **Scenario B:** You install a toilet.\n    *   A **Water Inspector** checks you haven't connected the waste pipe to the drinking water supply.\n\n**Analogy**\nThink of a car:\n*   **Building Control** is the MOT tester. They check if the car is built correctly and roadworthy.\n*   **HSE** is the Traffic Police. They check if you are driving safely and wearing your seatbelt.\n\n**Common mistakes**\n*   *Mistake:* Thinking Building Control checks the paint finish.\n*   *Correction:* Building Control only cares about safety and regulations (e.g., fire spread), not aesthetics.\n*   *Mistake:* Thinking Remedial Action is optional.\n*   *Correction:* Remedial Action is mandatory. If you ignore it, you can go to court."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Regulatory Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which inspector specifically checks that the building's structure and fire safety meet national regulations?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Building Control",
              "Building control officer",
              "Building control inspector"
            ],
            "hint": "They act like the MOT tester for the building itself."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "If an inspector finds a serious legal breach, what formal document do they issue to force the site to stop or fix the work?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Enforcement Notice",
              "An Enforcement Notice",
              "Enforcement notices"
            ],
            "hint": "It is a legal order, not just a letter."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "What do we call the mandatory work required to fix a fault identified by an inspector?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Remedial Action",
              "Remedial work",
              "Remedial actions"
            ],
            "hint": "This is work done to remedy (fix) a legal failure."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "A site manager receives an Enforcement Notice from the HSE. What does this tell you about the safety on site, and what must happen next?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "It means there was a serious safety breach (process/people).",
              "The site must perform Remedial Action immediately.",
              "Work might have to stop until the issue is fixed."
            ],
            "expectedAnswer": [
              "It tells us that the site failed a safety inspection and people were likely at risk. The site must now perform Remedial Action to fix the safety breach immediately, or they could face prosecution.",
              "An Enforcement Notice from the HSE means a legal safety standard was broken. The site must stop the unsafe activity and complete Remedial Action before work can continue normally."
            ],
            "hint": "Connect the 'HSE' (safety police) to the 'Enforcement Notice' (ticket) and what you must do to clear it."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A site log shows 12 visitors: 7 are potential buyers, 3 are interior designers, 1 is a Building Control officer, and 1 is an HSE inspector. How many of these are performing a Statutory Inspection?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2"
            ],
            "hint": "Count only the government/legal officials (Building Control + HSE). Buyers and designers are general visitors."
          },
          {
            "id": "210-1B-P2",
            "questionText": "If a visitor issues a formal Enforcement Notice, what does this prove has happened on site?",
            "answerType": "short-text",
            "expectedAnswer": [
              "legal breach",
              "a legal breach",
              "breach of regulations",
              "regulatory breach",
              "law broken"
            ],
            "hint": "They only issue this document if a law or regulation has been broken."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A technician is installing a specialized ventilation system to protect staff from hazardous fumes. Which regulatory body inspects this to ensure the *workers* are safe?",
            "answerType": "short-text",
            "expectedAnswer": [
              "HSE",
              "Health and Safety Executive",
              "The HSE"
            ],
            "hint": "Think of the 'police' for worker safety and welfare."
          },
          {
            "id": "210-1B-P4",
            "questionText": "An inspector finds 4 structural safety violations (illegal) and 6 walls painted the wrong shade of blue (ugly). How many items require mandatory Remedial Action?",
            "answerType": "numeric",
            "expectedAnswer": [
              "4"
            ],
            "hint": "Remedial Action is for legal compliance only, not aesthetic preference."
          },
          {
            "id": "210-1B-P5",
            "questionText": "Why can't the Site Manager just sign off the building regulations themselves? Why do we need Building Control?",
            "answerType": "short-text",
            "expectedAnswer": [
              "independent verification",
              "external authority",
              "legal requirement",
              "impartial check",
              "statutory requirement"
            ],
            "hint": "Think about marking your own homework. We need an external, independent check."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Compare the roles of the HSE and Building Control. If a wall collapses and injures a worker, which body investigates the accident (the injury) and which body investigates the wall design (the structure)? Why are they different?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE investigates the accident/injury because they cover worker safety/welfare.",
              "Building Control investigates the wall design because they cover structural regulations.",
              "They are different because one protects people (HSE) and the other validates the building product (Building Control)."
            ],
            "expectedAnswer": [
              "The HSE investigates the accident because their role is to protect the welfare of the worker and ensure safe working practices. Building Control investigates the wall design to see if it met structural regulations. They are different because HSE focuses on the 'process' and people, while Building Control focuses on the 'product' and physical standards.",
              "HSE handles the injury investigation (safety of people). Building Control handles the structural failure investigation (compliance of the building). They are distinct because one enforces safety laws at work, while the other enforces construction standards."
            ],
            "hint": "HSE = People/Safety. Building Control = Structure/Regulations."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Explain the journey of a 'failed' inspection. Start with the Inspector finding a fault, and end with the site being compliant again. Use the terms: Enforcement Notice, Remedial Action, and Compliance.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Inspector identifies fault.",
              "Issues Enforcement Notice.",
              "Site performs Remedial Action.",
              "Inspector re-checks.",
              "Site achieves Compliance."
            ],
            "expectedAnswer": [
              "First, the Inspector identifies a breach of regulations. Second, they issue an Enforcement Notice which legally orders the site to fix it. Third, the site team performs Remedial Action to correct the fault. Finally, the inspector re-checks the work, and if it passes, the site achieves Compliance.",
              "1. Breach found. 2. Enforcement Notice issued. 3. Remedial Action taken. 4. Work re-inspected. 5. Compliance achieved."
            ],
            "hint": "Step 1: The bad news (Notice). Step 2: The fix (Action). Step 3: The result (Compliance)."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Review: Site Management (Previous Lesson)",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "From the previous lesson: Which specific team is responsible for the overall daily coordination and safety of the entire site?",
            "expectedAnswer": [
              "Site management team",
              "Management team",
              "Site management"
            ],
            "hint": "They are the main leaders on site who everyone reports to.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "From the previous lesson: What do we call the government laws (like the Health and Safety at Work Act) that a site MUST follow?",
            "expectedAnswer": [
              "Statutory legislation",
              "Legislation",
              "Statutes",
              "Regulations"
            ],
            "hint": "A formal word for laws passed by parliament.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "From the previous lesson: Toolbox talks and induction briefings are examples of what site process?",
            "expectedAnswer": [
              "Communication",
              "Site communication",
              "Communication methods"
            ],
            "hint": "The exchange of information between management and workers.",
            "answerType": "short-text"
          }
        ],
        "notes": "Review of Unit 210-1A (Site Management) to consolidate prerequisites."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC3"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC4"
      ]
    },
    "scope": {
      "inScope": "Identification and purpose of key site inspectors and visitors (AC3).",
      "outOfScope": "Technical inspection procedures, enforcement protocols, and booking/scheduling workflows.",
      "rationale": "Focuses on the foundational identification of visitor roles (AC3) distinct from management roles (AC1/AC2)."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on role identification and purpose rather than inspection procedures"
    },
    "misconceptions": [
      {
        "misconception": "All site visitors have the same authority to stop work.",
        "correction": "Only specific inspectors, such as those from the HSE, have the legal power to stop work via formal notices.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "Building Control is responsible for the quality of the paint finish.",
        "correction": "Building Control focuses on safety and regulation Compliance, not cosmetic quality.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "Remedial Action is just standard maintenance.",
        "correction": "Remedial Action is specifically required to fix a legal non-compliance identified by an inspector.",
        "relatedAC": "AC3"
      }
    ]
  }
}