{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn about Site Visitors and Inspectors in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify the key roles and categories of visitors typically found on a technical site.",
    "Describe the specific regulatory authority and focus areas of different site inspectors.",
    "Match specific site compliance requirements to the correct inspectorate body."
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the key roles and categories of visitors typically found on a technical site.",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the specific regulatory authority and focus areas of different site inspectors.",
            "bloomLevel": "understand"
          },
          {
            "text": "Match specific site compliance requirements to the correct inspectorate body.",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Authority",
            "definition": "The legal power granted to specific bodies to enter a site and enforce laws. \n\n**Anchor:** Like a police officer who has the right to enter a property during an emergency, unlike a guest who needs an invitation."
          },
          {
            "term": "Compliance",
            "definition": "The state of meeting all legal, technical, and safety requirements. \n\n**Anchor:** Like stopping at a red light—you must do it to follow the law, not just because you want to."
          },
          {
            "term": "Building Control",
            "definition": "A regulatory body responsible for ensuring the finished structure meets safety laws (Building Regulations). \n\n**Anchor:** Like a car's MOT test—checking the vehicle is safe to be on the road, regardless of how it looks."
          },
          {
            "term": "Health and Safety Executive (HSE)",
            "definition": "The national regulator that enforces workplace safety laws to protect people while they work. \n\n**Anchor:** Like a restaurant health inspector checking that the kitchen is clean and the chefs are safe."
          },
          {
            "term": "Clerk of Works",
            "definition": "A client representative who checks that materials and workmanship match the design quality. \n\n**Anchor:** Like a wedding planner checking that the flowers match exactly what was ordered."
          },
          {
            "term": "Distribution Network Operator (DNO)",
            "definition": "The company responsible for the regional cables and infrastructure that bring electricity to the site. \n\n**Anchor:** Like the water company that owns the main pipes in the street, distinct from the plumber who fixes the sink inside your house."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Roles and Purpose of Site Visitors",
        "content": "### In this lesson\nYou will learn to identify the different people who visit a technical site and why they are there. This helps you manage security and safety. We will look at client representatives, utility providers, and legal inspectors.\n\n*   Categorise site visitors by their function (Quality vs. Law).\n*   Understand the **Clerk of Works** role.\n*   Distinguish between contractual guests and those with **Statutory Authority**.\n\n**What this is**\nSite visitors are people who don't work on the site every day but come for a specific reason. \n\n1.  **Client Representatives:** People like the **Clerk of Works**. They are there to check quality. Think of them as \"Quality Control.\"\n2.  **Statutory Inspectors:** People with **Statutory Authority**. They are there to enforce the law. Think of them as \"Site Police.\"\n3.  **Utility Providers:** People connecting services like power or water.\n\n**Why it matters**\nYou need to know who can stop the work and who cannot. If a **Clerk of Works** sees a problem, they report it to the client. If an inspector with **Statutory Authority** sees a danger, they can legally shut down the site immediately. Knowing the difference prevents confusion and ensures you give the right people the right access.\n\n**Key facts / rules**\n*   **Clerk of Works:** Focuses on *Quality*. They check if the bricks are the right colour and the pipes are the right brand. They represent the client (the person paying).\n*   **Statutory Authority:** Focuses on *Legality*. These inspectors (like HSE or Building Control) have a legal right to enter, often without notice.\n*   **Access:** All visitors usually sign in, but Statutory inspectors have legal backing if refused entry.\n\n**Micro-Scenario: The Wall Check**\nImagine a brick wall is being built.\n*   Visitor A looks at the wall and says, \"These aren't the red bricks we ordered; they are brown.\" -> This is a **Clerk of Works** (Contract/Quality).\n*   Visitor B looks at the wall and says, \"This wall is unstable and might fall on someone. Stop work immediately.\" -> This is an inspector with **Statutory Authority** (Safety/Law).\n\n**Common mistakes**\n*   **Mistake:** Thinking a Clerk of Works can arrest you or fine you.\n*   **Correction:** A Clerk of Works only checks the contract. Only Statutory bodies (like HSE) can issue legal fines or notices.\n\n**Key Points**\n*   **Clerk of Works** = Quality (Client's friend).\n*   **Statutory Authority** = Law (Government's enforcer).\n*   Always check ID to know if a visitor is there for the contract or the law."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Roles and Purpose of Site Visitors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "Who acts as the 'eyes and ears' of the client, focusing specifically on workmanship and material quality (e.g., checking the bricks match the order)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Clerk of Works",
              "The Clerk of Works",
              "Clerks of Works"
            ],
            "hint": "This person is a client representative concerned with quality, not the police."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Which term describes the legal power held by inspectors to enter a site to enforce regulations, similar to a police officer's power?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Statutory Authority",
              "Statutory Authorities",
              "Personnel with Statutory Authority"
            ],
            "hint": "This is a legal right granted by law, not just a clause in a private contract."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "A visitor's presence is usually tied to a 'specific ________', such as verifying quality or enforcing safety.",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "outcome",
              "specific outcome",
              "purpose",
              "reason"
            ],
            "hint": "Think about the result they want to achieve (e.g., a signed-off inspection)."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Explain the difference between a Clerk of Works and a Statutory Inspector. Why does a site manager need to treat them differently regarding access and authority?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Clerk of Works checks quality/contract (private interest)",
              "Statutory Inspector checks law/safety (public interest)",
              "Statutory inspectors have legal right of entry (Statutory Authority)",
              "Clerk of Works relies on the contract for access"
            ],
            "expectedAnswer": [
              "A Clerk of Works checks that the build matches the client's quality requirements, while a Statutory Inspector enforces national laws. The site manager must treat them differently because the Statutory Inspector has a legal right to enter and stop work (Statutory Authority), whereas the Clerk of Works only has authority defined by the private contract.",
              "The Clerk of Works focuses on the quality of materials for the client. The Statutory Inspector focuses on legal compliance. The manager needs to know this because Statutory Inspectors can legally force entry or shut down the site, while the Clerk of Works cannot."
            ],
            "hint": "One is checking you got what you paid for; the other is checking you aren't breaking the law."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Regulatory and Technical Inspectors",
        "content": "### In this lesson\nWe will look at three specific powerful bodies: **Building Control**, the **Health and Safety Executive (HSE)**, and the **Distribution Network Operator (DNO)**.\n\n*   **HSE:** Focuses on *People* (Safety while working).\n*   **Building Control:** Focuses on the *Building* (Safety of the structure).\n*   **DNO:** Focuses on the *Grid* (Connection to power).\n\n**What this is**\nThese are the main \"Statutory\" bodies you will meet.\n\n1.  **Health and Safety Executive (HSE):** They are the national regulator for workplace safety. \n    *   *Analogy:* Like a referee in a football match—they watch *how* the game is played to ensure no one gets hurt. They can stop the game (issue a Prohibition Notice) if it gets dangerous.\n\n2.  **Building Control:** They check the building against Building Regulations (Part P, etc.).\n    *   *Analogy:* Like an MOT tester for a car. They don't care if the car is fast or pretty; they care if the brakes work and it is safe to drive.\n\n3.  **Distribution Network Operator (DNO):** They own the power lines in the street.\n    *   *Analogy:* Like the water company. Your plumber fixes the pipes *inside* your house, but only the water company can touch the big main pipe *outside*. The DNO is the \"electricity company\" for the outside cables.\n\n**Why it matters**\nIf you mix these up, you call the wrong person.\n*   If a worker is not wearing a helmet, that is an **HSE** issue (Worker Safety).\n*   If the staircase is too narrow for a fire escape, that is a **Building Control** issue (Structural Safety).\n*   If you need to connect your new building to the street's power cable, that is a **DNO** issue (Infrastructure).\n\n**When to choose it**\n*   **Scenario:** You need to dig up the pavement to find the main power cable.\n    *   *Action:* Contact the **DNO**. Only they have the authority to touch the regional grid.\n*   **Scenario:** You are worried the trench is too deep and might collapse on workers.\n    *   *Action:* This relates to **HSE** rules (Construction Design and Management).\n\n**Common mistakes**\n*   **Mistake:** Thinking the DNO fixes the fuse board inside the house.\n*   **Correction:** The DNO stops at the meter/cut-out. Inside the house is the electrician's job.\n*   **Mistake:** Thinking Building Control checks if the workers are wearing boots.\n*   **Correction:** Building Control looks at the *building* (walls, wires, insulation), not the *workers*.\n\n**Key Points**\n*   **HSE** = Safe People (Process).\n*   **Building Control** = Safe Building (Product).\n*   **DNO** = Safe Connection (Grid)."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Regulatory and Technical Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which national regulator focuses on the safety and welfare of people while they are working (e.g., ensuring scaffolding is safe)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Health and Safety Executive",
              "HSE",
              "The HSE"
            ],
            "hint": "Think of the 'referee' who watches how the work is done to prevent injury."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which body ensures the finished structure meets legal standards (like fire safety and insulation), similar to a car's MOT?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Building Control",
              "Building Control inspector",
              "Building Control department"
            ],
            "hint": "They check the 'product' (the building) rather than the 'process' (the workers)."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "Who must you contact to approve the connection of a new building to the regional electricity grid?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Distribution Network Operator",
              "DNO",
              "The DNO"
            ],
            "hint": "This company owns the infrastructure 'in the street' before it enters your building."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Imagine a site has two problems: (1) Workers are not wearing hard hats, and (2) The installed fire alarm system does not meet the building regulations. Which body handles each issue and why?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Issue 1 (Hard hats) is HSE because it concerns worker safety/welfare",
              "Issue 2 (Fire alarm regs) is Building Control because it concerns the finished building's compliance",
              "Distinction: Process (HSE) vs Product (Building Control)"
            ],
            "expectedAnswer": [
              "The hard hat issue is for the HSE because they regulate worker safety and welfare during construction. The fire alarm issue is for Building Control because they check that the finished building installation meets the legal regulations.",
              "HSE handles the workers not wearing hard hats (safe process). Building Control handles the fire alarm system compliance (safe product)."
            ],
            "hint": "Separate the 'safety of the worker' from the 'legality of the building'."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "Which visitor is hired by the client to act as their 'eyes and ears', ensuring the materials used are exactly what was paid for?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Clerk of Works",
              "the Clerk of Works",
              "a Clerk of Works"
            ],
            "hint": "Think: Quality Control for the client."
          },
          {
            "id": "210-1B-P2",
            "questionText": "If an inspector has 'Statutory Authority', what does this give them the legal right to do?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Enter the site",
              "Enter without notice",
              "Enforce regulations",
              "Stop the work",
              "Enter site to enforce laws"
            ],
            "hint": "Think of the police analogy—they don't need an invitation to enforce the law."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A site log records three visitors: an Architect (contractual design), a Clerk of Works (contractual quality), and a Building Control officer (statutory law). How many of these represent the client's private interests?",
            "answerType": "numeric",
            "expectedAnswer": [
              "2"
            ],
            "hint": "The Architect and Clerk of Works work for the client. Building Control works for the law/government."
          },
          {
            "id": "210-1B-P4",
            "questionText": "You need to upgrade the main fuse where the electricity enters the building from the street. Which organization owns this equipment?",
            "answerType": "short-text",
            "expectedAnswer": [
              "DNO",
              "Distribution Network Operator",
              "the DNO"
            ],
            "hint": "The utility provider for the regional grid."
          },
          {
            "id": "210-1B-P5",
            "questionText": "Which body would issue a 'Prohibition Notice' to stop work if they saw a trench that was about to collapse on workers?",
            "answerType": "short-text",
            "expectedAnswer": [
              "HSE",
              "Health and Safety Executive",
              "the HSE"
            ],
            "hint": "They protect the people in the trench."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain the difference between a 'Commercial' visitor (like a Clerk of Works) and a 'Statutory' visitor (like an HSE inspector). In your answer, include: (1) What is the main focus of each? (2) Where does their authority come from (contract vs law)? (3) Why must a site manager verify their identity before letting them in?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Commercial/Clerk of Works focuses on quality/design; Statutory/HSE focuses on legal safety/compliance.",
              "Commercial authority comes from the private contract; Statutory authority comes from national law (legislation).",
              "Verification is needed to ensure they have the right to be there and to know if they can legally stop work or just report on it."
            ],
            "expectedAnswer": [
              "A Commercial visitor like a Clerk of Works focuses on quality and gets their authority from the client's contract. A Statutory visitor like the HSE focuses on safety law and gets their authority from legislation (Statutory Authority). The site manager must verify their identity to know if the visitor has the legal power to demand access or stop work, or if they are just there to check the design.",
              "The Clerk of Works is there for the client to check quality (Contractual). The HSE is there for the government to check safety (Statutory). We verify identity to ensure we grant the correct legal access—statutory inspectors can enter by law, while others need permission."
            ],
            "hint": "Compare 'checking the product for the buyer' vs 'enforcing the law for the government'."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "A new building is nearing completion. Describe how the **Clerk of Works**, **Building Control**, and **DNO** might all be involved in the final stages. What is each one checking or doing? (3-4 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Clerk of Works: Checking final finish/quality matches the client's spec.",
              "Building Control: Checking the building is safe/compliant (e.g., fire exits, insulation).",
              "DNO: Connecting the final power supply to the grid.",
              "Integration: All three verify different aspects (Quality, Legality, Utility) to finish the job."
            ],
            "expectedAnswer": [
              "In the final stages, the Clerk of Works will check that the finishes (like paint and joinery) match the client's high standards. Building Control will inspect the structure to ensure it meets safety regulations (like fire escapes) so the building can legally be used. The DNO will visit to approve and connect the main electricity supply to the grid. Together, they ensure the building is high quality, legally safe, and powered up.",
              "The Clerk of Works checks the quality of the work for the client. Building Control checks the safety of the building for the law. The DNO connects the power supply. All three are needed to sign off the project: one for the contract, one for the regulations, and one for the utilities."
            ],
            "hint": "One checks beauty/quality, one checks safety/law, and one provides the power."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check: Previous Concepts",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "From your previous lesson on Site Roles: What is the collective term for the team (Project Manager, Site Agent) that runs the daily operations?",
            "expectedAnswer": [
              "site management team",
              "management team",
              "site management"
            ],
            "hint": "This is the group that visitors report to when they arrive.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "From your previous lesson: What term describes mandatory rules set by parliament that everyone on site must follow (e.g., HASAWA)?",
            "expectedAnswer": [
              "statutory legislation",
              "legislation",
              "statutes",
              "statutory"
            ],
            "hint": "This is the 'Law' part of 'Statutory Authority'.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "From your previous lesson: Site Diaries and Induction Forms are examples of formal site ________.",
            "expectedAnswer": [
              "communication",
              "communication methods",
              "documentation"
            ],
            "hint": "The process of exchanging information.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Site Visitors and Inspectors (Reviews Unit 210-1A)"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC3"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC4"
      ]
    },
    "scope": {
      "inScope": "Identification and purpose of key site visitors and regulatory inspectors including HSE, Water, DNO, and Building Control.",
      "outOfScope": "Specific procedures for site induction, hosting visitors, or the technical methods used during inspections.",
      "rationale": "The lesson focuses on professional role recognition and the regulatory landscape (AC3) rather than the site management team (AC1)."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on role identification and purpose of inspectors only; exclude inspection procedures."
    },
    "misconceptions": [
      {
        "misconception": "All site visitors have the power to stop the project if they see something they dislike.",
        "correction": "Only specific individuals with Statutory Authority or delegated contractual power can legally halt work.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "Building Control works for the contractor to help them finish the job.",
        "correction": "Building Control is an independent regulatory body that ensures the work meets minimum legal standards.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "The Distribution Network Operator (DNO) is responsible for all wiring inside a building.",
        "correction": "The Distribution Network Operator (DNO) is only responsible for the regional infrastructure and the point of supply connection.",
        "relatedAC": "AC3"
      }
    ]
  }
}