{
  "id": "210-210-1A1",
  "title": "210.210-1A1 — 1 Identify key roles of the site management team:",
  "description": "Learn about 1 Identify key roles of the site management team: in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "1 Identify key roles of the site management team:",
  "learningOutcomes": [
    "List the key job titles that comprise a standard site management team",
    "Describe the primary responsibilities of individuals reporting to site management",
    "Identify different categories of site visitors and their reasons for attendance"
  ],
  "prerequisites": [],
  "blocks": [
    {
      "id": "210-210-1A1-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "List the key job titles that comprise a standard site management team",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the primary responsibilities of individuals reporting to site management",
            "bloomLevel": "understand"
          },
          {
            "text": "Identify different categories of site visitors and their reasons for attendance",
            "bloomLevel": "remember"
          }
        ]
      }
    },
    {
      "id": "210-210-1A1-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Site Manager",
            "definition": "The individual responsible for the daily oversight of an entire project or facility, ensuring work is completed safely, on schedule, and according to specifications."
          },
          {
            "term": "Site Supervisor",
            "definition": "A person who manages specific operational teams and technical tasks on the ground, reporting to the site manager rather than overseeing overall project strategy."
          },
          {
            "term": "Chain of Command",
            "definition": "The formal hierarchy that defines who reports to whom and determines the flow of authority and communication throughout the site team."
          },
          {
            "term": "Subcontractor",
            "definition": "A specialist individual or firm hired to perform a specific task or trade within a project, not to be confused with a direct employee of the main organization."
          },
          {
            "term": "Site Induction",
            "definition": "A mandatory safety and procedural briefing provided to all visitors and new staff before they are permitted to access the work area."
          },
          {
            "term": "Statutory Visitor",
            "definition": "An external official with a legal right to inspect the site for compliance with regulations, such as a health and safety inspector or building control officer."
          }
        ]
      }
    },
    {
      "id": "210-210-1A1-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "1 Identify key roles of the site management team: Diagram",
        "description": "Visual representation of 1 Identify key roles of the site management team:",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "site-manager",
          "site-supervisor",
          "subcontractor",
          "statutory-visitor",
          "chain-of-command"
        ],
        "placeholderText": "The diagram should be a hierarchical flow chart showing the Site Manager at the top, connected by a vertical arrow (labeled 'Chain of Command') to the Site Supervisor. Below the Site Supervisor, several Subcontractors are shown as separate blocks. Off to the side, a Statutory Visitor is shown with a dashed line pointing towards the Site Manager, representing an external legal relationship rather than a direct reporting line. A 'Site Induction' box should be shown as a gatekeeper element that all roles must pass through to reach the main work area."
      }
    },
    {
      "id": "210-210-1A1-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Site Management and Reporting Lines",
        "content": "### In this lesson\nThis lesson identifies the core leadership roles found on a technical site and how authority flows between them. You will learn to distinguish between strategic oversight and operational management while understanding the formal reporting structures used in professional environments.\n\n*   The specific job titles that form a site management team.\n*   The primary responsibilities of those who report to management.\n*   How the formal hierarchy governs technical work and safety.\n\n**What this is**\nIn any professional technical environment, a structured hierarchy ensures that work is performed safely and efficiently. This hierarchy is known as the **Chain of Command**. At the top of this structure is the **Site Manager**, who holds the ultimate responsibility for the project’s success, including safety, scheduling, and meeting technical specifications. Supporting them are **Site Supervisors**, who act as the link between high-level project goals and the physical work being performed. This structure ensures that every individual on-site knows exactly who to look to for instructions and who is responsible for their safety and performance.\n\n**Why it matters**\nWithout a clear **Chain of Command**, communication breaks down, leading to safety risks and project delays. For example, if a technical issue arises, a technician must know whether to consult their **Site Supervisor** for a practical solution or if the issue requires the **Site Manager** to adjust the overall project timeline. Understanding these roles ensures that instructions are followed correctly and that accountability is maintained throughout the project lifecycle.\n\n**Key facts / rules**\n*   The **Site Manager** oversees the entire project strategy and high-level safety compliance.\n*   A **Site Supervisor** manages specific operational teams and technical tasks on a daily basis.\n*   The **Chain of Command** dictates the flow of information; workers typically report to a supervisor, not directly to the manager.\n*   **Subcontractors** are specialist firms or individuals brought in for specific tasks but must still follow the site's management rules.\n*   All management roles share a legal and moral duty to ensure a safe working environment.\n*   Reporting lines are typically documented in a site-specific management plan.\n\n**How to recognise it**\nYou can recognise these roles by their scope of influence and their daily activities. A **Site Manager** is often found reviewing project documents, coordinating with clients, and checking the overall project schedule. In contrast, a **Site Supervisor** is usually seen on the ground, directing specific technical activities and ensuring that the immediate work area is safe and productive. \n\nTo anchor this in the physical world, consider a large commercial ship. The Captain (the **Site Manager**) is responsible for the entire vessel, the route, and the safety of everyone on board. The Deck Officers (the **Site Supervisors**) manage specific shifts and technical tasks like navigation or engine maintenance, reporting directly to the Captain while leading their own small teams.\n\n*Micro-scenario: If a project has 50 workers split into five specialized groups, the **Site Manager** monitors the 12-month completion date, while each **Site Supervisor** manages the 10 people in their specific group to ensure today's tasks are finished.* \n\n**Common mistakes**\nLearners often confuse a **Site Manager** with a **Site Supervisor**; a **Site Manager** is responsible for the overall project strategy and safety specifications, whereas a **Site Supervisor** is focused on the daily operational management of specific technical teams. Another common error is assuming **Subcontractors** operate outside the **Chain of Command**; while they are independent entities, they must report to the site management for safety and coordination.\n\nMisconceptions (targeted):\n*   Misconception: The Site Manager and Site Supervisor have the same daily tasks. | Correction: The Manager focuses on the whole project and strategy, while the Supervisor focuses on specific team operations. | AC: 210.LO1.AC1.1\n*   Misconception: Subcontractors do not need to follow the site's management hierarchy. | Correction: All personnel, including subcontractors, must follow the established Chain of Command for safety and coordination. | AC: 210.LO1.AC1.2\n\n**Key Points**\n*   The **Site Manager** holds overall project and safety responsibility.\n*   The **Site Supervisor** manages daily technical tasks and specific teams.\n*   The **Chain of Command** defines the reporting hierarchy and authority flow.\n*   **Subcontractors** provide specialist skills while remaining under site management oversight.\n\n**Quick recap**\nTechnical sites rely on a defined management team to maintain safety and progress. The **Site Manager** provides strategic oversight, the **Site Supervisor** provides operational leadership, and the **Chain of Command** ensures clear communication between all parties, including **Subcontractors**.\n\n### Coming Up Next\nNow that we have identified the internal management team, we will look at the various external individuals who visit technical sites and the legal reasons for their attendance."
      }
    },
    {
      "id": "210-210-1A1-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Site Management and Reporting Lines",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-210-1A1-C1-L1-A",
            "questionText": "Who oversees the entire project strategy and high-level safety compliance?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Manager",
              "The Site Manager",
              "Site Managers"
            ],
            "hint": "This person holds the ultimate responsibility for the success and strategy of the project."
          },
          {
            "id": "210-210-1A1-C1-L1-B",
            "questionText": "Who manages specific operational teams and technical tasks on a daily basis?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Supervisor",
              "A Site Supervisor",
              "Site Supervisors"
            ],
            "hint": "This role acts as the link between high-level goals and the physical work being performed."
          },
          {
            "id": "210-210-1A1-C1-L1-C",
            "questionText": "According to the chain of command, who do workers typically report to instead of the manager?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "A supervisor",
              "Site Supervisor",
              "The supervisor"
            ],
            "hint": "Information flows through this role to ensure the hierarchy is maintained."
          },
          {
            "id": "210-210-1A1-C1-L2",
            "questionText": "Using your answers to Q1 (Site Manager), Q2 (Site Supervisor), and Q3 (Reporting), explain how these roles work together. Why must a worker know the difference between these two management roles when reporting an issue?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Site Managers handle project-wide strategy while Supervisors handle immediate daily tasks",
              "The Chain of Command requires workers to report to a supervisor to maintain the flow of information",
              "Knowing the difference ensures issues are directed to the correct level of authority for either practical or strategic solutions"
            ],
            "expectedAnswer": [
              "The Site Manager handles the project strategy while the Site Supervisor manages the daily team tasks. Because workers report to the supervisor first, they must know the difference to ensure that operational issues are handled by the supervisor and strategic issues are passed up the chain correctly.",
              "A worker needs to distinguish between the roles because the chain of command dictates they report to a supervisor for daily tasks. This allows the Site Manager to focus on high-level strategy and safety while the supervisor handles the immediate technical team."
            ],
            "hint": "Consider how the chain of command prevents the Site Manager from being overwhelmed by daily technical problems."
          }
        ]
      }
    },
    {
      "id": "210-210-1A1-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Site Visitors and External Roles",
        "content": "### In this lesson\nThis lesson explores the different categories of individuals who access a technical site but are not part of the permanent daily workforce. You will learn to identify these visitors and understand the mandatory procedures required for their entry.\n\n*   The different categories of site visitors and their reasons for attendance.\n*   The role of the **Statutory Visitor** in site compliance.\n*   The purpose and necessity of a **Site Induction**.\n\n**What this is**\nTechnical sites are restricted areas, but they frequently require access by external parties. These individuals are classified as visitors. A critical category is the **Statutory Visitor**, which includes officials like health and safety inspectors or building control officers who have a legal right to enter and inspect the site. Other visitors may include delivery drivers, clients, or specialized consultants. Regardless of their role, every visitor must undergo a **Site Induction**—a mandatory briefing that explains site-specific hazards, emergency procedures, and safety rules—before they are allowed past the site boundary.\n\n**Why it matters**\nIdentifying visitors and their reasons for attendance is essential for security and safety. If an unauthorized person enters a high-risk area, they could cause an accident or be injured themselves. Furthermore, failing to facilitate a **Statutory Visitor** can lead to legal penalties or the immediate closure of the site. The **Site Induction** acts as the first line of defense, ensuring that even a temporary visitor understands the risks present on that specific site.\n\n**Key facts / rules**\n*   A **Statutory Visitor** has a legal right to access the site for inspection purposes (verify current local regulations).\n*   All visitors must sign in and out to maintain an accurate record for emergency evacuations.\n*   A **Site Induction** is mandatory for everyone before they access the work area for the first time.\n*   Visitors must typically be accompanied by a member of the site team unless they have been fully cleared for unescorted access.\n*   The reason for attendance must be recorded (e.g., equipment delivery, safety audit, client progress meeting).\n*   Visitors must wear the required personal protective equipment (PPE) as specified during their induction.\n\n**How to recognise it**\nYou can recognise visitor types by their purpose and the documentation they carry. A **Statutory Visitor** will usually present official identification and may arrive unannounced to perform a spot check. A delivery driver will have a manifest for specific materials, and a client will likely be there for a scheduled progress review. \n\nAn everyday contextual anchor for this is an airport. Just as everyone entering the secure gate area must pass through security and follow specific rules (the **Site Induction**), different people enter for different reasons: passengers (clients), baggage handlers (subcontractors), and government customs officials (the **Statutory Visitor**).\n\n*Micro-scenario: A delivery driver arrives with a 10-minute drop-off, while a health and safety inspector arrives for a 4-hour audit. Both must complete a **Site Induction** before entering the work zone, but only the inspector has the legal right to demand access to all site records.* \n\n**Common mistakes**\nLearners often confuse a generic visitor with a **Statutory Visitor**; a generic visitor (like a client) requires an invitation or permission to enter, whereas a **Statutory Visitor** has a legal right to inspect the site for compliance. Another common mistake is thinking that a **Site Induction** is only for long-term workers; in reality, it is a mandatory requirement for every single person who steps onto the operational site.\n\nMisconceptions (targeted):\n*   Misconception: Only permanent workers need a Site Induction. | Correction: Every visitor, regardless of their stay duration, must receive a Site Induction before entering the work area. | AC: 210.LO1.AC1.3\n*   Misconception: Statutory Visitors need a scheduled appointment to enter. | Correction: Statutory Visitors often have the legal right to enter a site unannounced for inspections. | AC: 210.LO1.AC1.3\n\n**Key Points**\n*   **Statutory Visitors** have legal authority to inspect the site for compliance.\n*   The **Site Induction** is a mandatory safety briefing for all new arrivals.\n*   Accurate visitor logs are essential for emergency safety and accountability.\n*   Visitors must always adhere to site-specific safety rules and PPE requirements.\n\n**Quick recap**\nManaging site access is a core responsibility of the management team. By identifying different categories of visitors—especially **Statutory Visitors**—and ensuring every person completes a **Site Induction**, the site remains compliant with the law and safe for everyone involved.\n\n### Coming Up Next\nWe have covered the roles and visitors on a site. Next, we will examine the specific communication methods used to relay technical information between these different groups."
      }
    },
    {
      "id": "210-210-1A1-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Site Visitors and External Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-210-1A1-C2-L1-A",
            "questionText": "Which category of visitor has a legal right to access the site for inspection purposes?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Statutory Visitor",
              "A Statutory Visitor",
              "Statutory Visitors"
            ],
            "hint": "These individuals include health and safety inspectors or building control officers."
          },
          {
            "id": "210-210-1A1-C2-L1-B",
            "questionText": "What is mandatory for everyone before they access the work area for the first time?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Induction",
              "A Site Induction",
              "Induction"
            ],
            "hint": "This is a mandatory safety briefing that explains site-specific hazards."
          },
          {
            "id": "210-210-1A1-C2-L1-C",
            "questionText": "What legal right do Statutory Visitors have regarding when they can enter a site for inspections?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Enter unannounced",
              "Unannounced inspections",
              "Right to enter unannounced"
            ],
            "hint": "Think about whether these officials need to book an appointment before arriving."
          },
          {
            "id": "210-210-1A1-C2-L2",
            "questionText": "Using your answers to Q1 (Statutory Visitor), Q2 (Site Induction), and Q3 (Unannounced access), explain how site access is controlled. Why must a statutory visitor still complete an induction even though they have a legal right to enter?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Statutory Visitors have legal authority for inspections and can arrive unannounced",
              "The Site Induction is a universal safety requirement for everyone entering the work area",
              "Inductions are necessary for statutory visitors to ensure they understand specific site hazards and emergency procedures during their inspection"
            ],
            "expectedAnswer": [
              "While a Statutory Visitor has the legal right to enter a site unannounced for inspections, they must still complete a Site Induction. This is because the induction is mandatory for everyone to ensure they are aware of specific site hazards and safety rules before entering the work area.",
              "We know that every person must have a Site Induction before entering a work zone. This includes Statutory Visitors, who may arrive unannounced, because their legal right to inspect does not exempt them from the safety rules required to prevent accidents on that specific site."
            ],
            "hint": "Consider if a legal right to inspect also means a person is immune to physical hazards on the site."
          }
        ]
      }
    },
    {
      "id": "210-210-1A1-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-210-1A1-P1",
            "questionText": "Which specific role acts as the primary link between high-level project goals and the physical technical work being performed by teams on the ground?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Site Supervisor",
              "the Site Supervisor"
            ],
            "hint": "This role manages daily operations and specific technical tasks rather than overall project strategy."
          },
          {
            "id": "210-210-1A1-P2",
            "questionText": "Why is a site induction mandatory for every visitor, regardless of how long they intend to stay in the work area?",
            "answerType": "short-text",
            "expectedAnswer": [
              "To explain site hazards",
              "To communicate safety rules",
              "To ensure site safety"
            ],
            "hint": "Think about the need to understand specific risks and emergency procedures before entering a restricted zone."
          },
          {
            "id": "210-210-1A1-P3",
            "questionText": "A facility has 5 supervisors managing 50 staff members, all reporting to one head of site. How many individuals in this hierarchy hold the ultimate responsibility for the entire project's success and high-level safety compliance?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "Consider the role of the Site Manager in the chain of command."
          },
          {
            "id": "210-210-1A1-P4",
            "questionText": "In a secure data center, an external fire inspector arrives to verify that the facility meets legal safety standards. Identify the specific category of visitor this official represents.",
            "answerType": "short-text",
            "expectedAnswer": [
              "Statutory Visitor",
              "a statutory visitor",
              "Statutory"
            ],
            "hint": "This term refers to individuals with a legal right to inspect a site for compliance."
          },
          {
            "id": "210-210-1A1-P5",
            "questionText": "A project is split into 4 specialist teams. Each team has 1 supervisor, and they all report to a single manager. How many people in total hold a leadership role (managers or supervisors) within this site's management team?",
            "answerType": "numeric",
            "expectedAnswer": [
              "5"
            ],
            "hint": "Add the number of supervisors to the single site manager."
          }
        ]
      }
    },
    {
      "id": "210-210-1A1-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-210-1A1-INT-1",
            "questionText": "Explain how the site management hierarchy interacts with external site visitors. In your answer, include: (1) the core roles within the management team, (2) the purpose of the site induction process, and (3) the reporting structure used to monitor visitor activity. Why must management maintain direct oversight of these entry procedures to ensure site integrity?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies management roles such as Site Manager or Assistant Site Manager",
              "Explains that inductions ensure visitors understand safety and operational protocols",
              "Describes how visitors report to management or designated supervisors upon arrival",
              "Connects management authority to the legal and safety responsibility for all persons on site",
              "Reasons that unmanaged access bypasses safety checks and reporting lines, creating liability"
            ],
            "expectedAnswer": [
              "The site management team, led by roles like the Site Manager, uses a formal reporting structure to oversee all personnel, including external visitors. Before entry, management ensures every visitor undergoes a site induction to communicate essential safety rules and operational boundaries. This oversight is necessary because management is legally responsible for site safety, and unescorted or unverified visitors could compromise the integrity of the technical environment.",
              "Core management roles like the Site Manager and Project Manager establish reporting lines that all visitors must follow, typically starting with a site induction. This process ensures visitors are aware of the hazards and procedures relevant to their reason for attendance. Management must oversee this because they hold the ultimate authority for site compliance, and allowing unauthorized movement would break the chain of command and increase safety risks."
            ],
            "hint": "Consider how the chain of command ensures that everyone on site, even temporary guests, follows the same safety standards."
          },
          {
            "id": "210-210-1A1-INT-2",
            "questionText": "Evaluate how a site management team coordinates the permanent workforce and external stakeholders during a regulatory site inspection. In your answer, include: (1) the primary management roles involved, (2) the responsibilities of staff reporting to management, (3) the specific role of statutory visitors, and (4) how these groups collaborate to ensure site compliance. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Identifies Site Manager or Assistant Manager as the primary authority",
              "Outlines reporting staff responsibilities in executing technical tasks and maintaining logs",
              "Defines statutory visitors as external officials with legal rights to inspect site compliance",
              "Describes the induction process for the statutory visitor",
              "Explains how management facilitates the visitor's access to reporting staff",
              "Details the flow of technical evidence from staff through management to the visitor",
              "Synthesizes the interaction as a method for verifying site safety and legal standards",
              "Highlights the importance of clear reporting lines during the inspection process"
            ],
            "expectedAnswer": [
              "The Site Manager coordinates the inspection by leading the statutory visitor through the mandatory induction while the reporting workforce provides the necessary technical data and operational evidence. Statutory visitors use their legal authority to verify that the work managed by the leadership team meets all regulatory standards. This collaboration ensures that the site remains compliant through a clear flow of information from the technical staff, through management, to the external inspector.",
              "• The Site Manager provides oversight and facilitates the visit of the statutory official, who is there to inspect site compliance.\n• Reporting staff support this by maintaining accurate records and demonstrating safe working practices as directed by management.\n• The statutory visitor undergoes a site induction and then verifies that the management's reporting lines are effectively maintaining safety.\n• All three groups interact to provide a transparent account of site operations, ensuring legal and technical requirements are fully met."
            ],
            "hint": "Think about how management acts as the bridge between the daily technical workforce and the external officials who verify their work."
          }
        ]
      }
    },
    {
      "id": "210-210-1A1-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-210-1A1-SR-1",
            "questionText": "What term describes the specific location where technical work or project activities are carried out?",
            "expectedAnswer": [
              "site",
              "the site",
              "worksite",
              "job site"
            ],
            "hint": "It is the first word in the lesson title.",
            "answerType": "short-text"
          },
          {
            "id": "210-210-1A1-SR-2",
            "questionText": "What term is used for a group of people who work together to achieve a shared goal or task?",
            "expectedAnswer": [
              "team",
              "a team",
              "workgroup",
              "crew"
            ],
            "hint": "This word follows 'management' in the lesson title.",
            "answerType": "short-text"
          },
          {
            "id": "210-210-1A1-SR-3",
            "questionText": "What is the general name for people who attend a place of work but are not employed to work there permanently?",
            "expectedAnswer": [
              "visitors",
              "visitor",
              "guests",
              "site visitors"
            ],
            "hint": "Check the third learning outcome for this category of person.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting 1 Identify key roles of the site management team:"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2",
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-15",
    "updated": "2026-02-15",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1",
        "AC2",
        "AC3"
      ],
      "outOfScopeAC": [
        "AC4",
        "AC5",
        "AC6"
      ]
    },
    "scope": {
      "inScope": "The identification of roles, titles, and basic functions of site personnel and visitors.",
      "outOfScope": "Specific communication protocols, operational procedures, or health and safety legislation.",
      "rationale": "The lesson focuses on organizational awareness as a prerequisite for understanding site-wide communication flows."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": false,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus exclusively on role identification and hierarchy rather than procedural actions."
    },
    "misconceptions": [
      {
        "misconception": "The Site Manager and Site Supervisor have the same daily tasks.",
        "correction": "The Manager focuses on the whole project and strategy, while the Supervisor focuses on specific team operations.",
        "relatedAC": "AC1"
      },
      {
        "misconception": "Subcontractors do not need to follow the site's management hierarchy.",
        "correction": "All personnel, including subcontractors, must follow the established Chain of Command for safety and coordination.",
        "relatedAC": "AC2"
      },
      {
        "misconception": "Only permanent workers need a Site Induction.",
        "correction": "Every visitor, regardless of their stay duration, must receive a Site Induction before entering the work area.",
        "relatedAC": "AC3"
      }
    ]
  }
}