{
  "id": "210-3B",
  "title": "210.3B — Communication Methods and Specific Needs",
  "description": "Learn to identify suitable communication methods for workplace tasks and adapt communication for people with specific needs.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Communication Methods and Specific Needs",
  "learningOutcomes": [
    "Identify suitable communication methods for different professional situations (AC1).",
    "Define effective communication adjustments for people with specific needs (AC2).",
    "Select the appropriate method to ensure accuracy, safety, and understanding."
  ],
  "prerequisites": [
    "210-3A"
  ],
  "blocks": [
    {
      "id": "210-3B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify suitable communication methods for different professional situations.",
            "bloomLevel": "remember"
          },
          {
            "text": "Define effective communication adjustments for people with specific needs.",
            "bloomLevel": "understand"
          },
          {
            "text": "Select the appropriate method to ensure accuracy, safety, and understanding.",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-3B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Verbal Communication",
            "definition": "The use of spoken words to exchange information, such as face-to-face conversations, telephone calls, or toolbox talks."
          },
          {
            "term": "Written Communication",
            "definition": "The use of text or symbols recorded on paper or digital devices, providing a permanent record (e.g., emails, job sheets, site diaries)."
          },
          {
            "term": "Non-verbal Communication",
            "definition": "Exchanging information without words, using body language, hand signals, or gestures, often used when noise prevents speaking."
          },
          {
            "term": "Specific Needs",
            "definition": "Individual requirements due to disabilities (e.g., hearing or visual impairment) or language barriers that require communication to be adapted."
          },
          {
            "term": "Visual Aid",
            "definition": "An image, diagram, or sign used to support understanding, especially helpful for language barriers or technical explanations."
          }
        ]
      }
    },
    {
      "id": "210-3B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Identifying Suitable Communication Methods",
        "content": "### In this lesson\nThis lesson covers how to choose the right tool for the job when communicating. Just as you wouldn't use a hammer to turn a screw, you shouldn't use a casual chat to record a legal contract.\n\n*   Identify **Verbal**, **Written**, and **Non-verbal** methods.\n*   Understand when to use each method based on the situation.\n*   Recognise the importance of written records for liability.\n\n**What this is**\nCommunication methods are the \"channels\" we use to transfer information. \n1.  **Verbal:** Speaking (Phone, Toolbox Talk, Meeting). Fast and allows immediate feedback.\n2.  **Written:** Text (Email, Site Diary, Accident Book, Job Sheet). Permanent and provides legal proof.\n3.  **Non-verbal:** Visuals (Hand Signals, Body Language, Safety Signs). Universal and works in noisy environments.\n\n**Why it matters**\nChoosing the wrong method leads to errors. If you only *tell* a client about a cost increase (Verbal) but don't write it down, you have no proof when they refuse to pay. If you try to *email* a warning to a crane operator during a lift, it will be too late; you must use **Hand Signals** (Non-verbal).\n\n**Key facts / rules**\n*   **Written Communication** is required for formal records, variations, and accident reporting because it creates a permanent audit trail.\n*   **Verbal Communication** is best for quick instructions, team coordination, and checking immediate understanding.\n*   **Non-verbal Communication** (like Banksman signals) is essential on noisy sites where voices cannot be heard.\n*   **Visual Aids** (drawings/plans) are used to explain complex technical layouts.\n\n**How to recognise it**\nThink of communication like traffic control:\n*   **Verbal** is like a police officer directing traffic—flexible and immediate.\n*   **Written** is like the painted lines on the road—permanent and legally binding.\n*   **Non-verbal** is like the traffic lights—visual signals that everyone understands without words.\n\n**Micro-scenario:** \nYou are on a noisy construction site. A crane is lifting a load. The operator cannot hear you. You use standard **Hand Signals** to direct them left or right. Later, you need to order more cement. You send an **Email** so there is a record of exactly how much was ordered and when.\n\n**Common mistakes**\nLearners often think verbal is always best because it is fast. \n*   Misconception: \"I told him, so that's enough.\" | Correction: In professional settings, \"if it isn't written down, it didn't happen.\" | AC: 210.LO3.AC1\n*   Misconception: \"Hand signals are just informal waving.\" | Correction: Site signals are a formal, standardized language for safety. | AC: 210.LO3.AC1\n\n**Key Points**\n*   Use **Written** for proof/records.\n*   Use **Verbal** for speed/dialogue.\n*   Use **Non-verbal** for safety/noise.\n\n### Coming Up Next\nNow that we can identify the methods, we will learn how to adapt them for people with specific needs, such as disabilities or language barriers."
      }
    },
    {
      "id": "210-3B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Communication Methods",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-C1-L1-A",
            "questionText": "Which communication method provides a permanent record suitable for legal proof?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "written communication",
              "written",
              "email",
              "site diary",
              "job sheet"
            ],
            "hint": "Think about which method leaves a physical or digital trace that can be checked later."
          },
          {
            "id": "210-3B-C1-L1-B",
            "questionText": "What is the most appropriate method to communicate with a crane operator on a noisy site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "non-verbal",
              "hand signals",
              "signals",
              "gestures",
              "visual signals"
            ],
            "hint": "When you cannot be heard, you must use visual signs."
          },
          {
            "id": "210-3B-C1-L1-C",
            "questionText": "What is the main advantage of verbal communication like a toolbox talk?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "immediate feedback",
              "speed",
              "fast",
              "quick",
              "allows questions"
            ],
            "hint": "Think about how quickly you can get a reply compared to an email."
          },
          {
            "id": "210-3B-C1-L2",
            "questionText": "Using your answers to Q1 (written/proof) and Q2 (signals/noise), explain why a site manager uses a site diary for accidents but hand signals for lifting. Why can't they swap these methods?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Site diaries are written to provide permanent legal evidence of accidents.",
              "Hand signals are visual/non-verbal to overcome noise during lifting.",
              "Swapping them fails: You cannot signal a legal record for later use.",
              "Swapping them fails: You cannot write a note to a crane operator mid-lift safely."
            ],
            "expectedAnswer": [
              "A site manager uses a site diary for accidents because it creates a permanent written record for legal proof, which hand signals cannot do. They use hand signals for lifting because the site is too noisy for speech and writing is too slow for immediate safety directions. You cannot swap them because signals leave no record and writing is unsafe during a live lift.",
              "The diary provides the necessary written evidence for the accident. The hand signals provide the necessary immediate visual communication for the noise. Swapping them would mean no legal record for the accident and unsafe delays for the lift."
            ],
            "hint": "Consider the 'purpose' of each task: one needs evidence later, the other needs immediate safety now."
          }
        ]
      }
    },
    {
      "id": "210-3B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Adapting for Specific Needs",
        "content": "### In this lesson\nThis lesson explains how to adjust your communication method when the receiver has **Specific Needs**, such as a disability or language barrier. \n\n*   Define methods for people with **Hearing Impairment**.\n*   Define methods for people with **Visual Impairment**.\n*   Define methods for **Language Barriers** and **Learning Difficulties**.\n\n**What this is**\nCommunication only works if the message is received and understood. If the receiver has a specific need, the sender must adapt the method. This is like using a travel adapter for a plug; the electricity (information) is the same, but the connection (method) changes to fit the socket.\n\n**Why it matters**\nFailing to adapt is not just rude; it is ineffective and often illegal (discrimination). If you shout at a client who relies on lip-reading, they still won't understand you. If you give a text-heavy manual to someone with dyslexia or a language barrier, the safety instructions will be ignored.\n\n**Key facts / rules**\n1.  **Hearing Impairment:**\n    *   Face the person directly so they can lip-read.\n    *   Ensure good lighting on your face.\n    *   Use **Written** notes or text messages to confirm details.\n    *   Use **Sign Language** interpreters for formal meetings.\n2.  **Visual Impairment:**\n    *   Use clear **Verbal** descriptions of the environment.\n    *   Provide documents in **Large Print** or Braille.\n    *   Ensure good contrast on signs.\n3.  **Language Barriers:**\n    *   Use **Visual Aids** (diagrams, pictures).\n    *   Use translation apps or interpreters.\n    *   Use simple, standard English without slang.\n4.  **Learning Difficulties:**\n    *   Break information into small chunks.\n    *   Use pictures and demonstrations.\n    *   Check understanding frequently.\n\n**How to do it**\nWhen you meet someone with a specific need, ask them: \"What is the best way for us to communicate?\" \n\n**Micro-scenario:** \nYou are explaining a heating timer to a customer who does not speak English well. \n*   *Bad:* Speaking louder (does not help translation).\n*   *Good:* You draw a **diagram** (Visual Aid) of the timer settings and demonstrate the action physically. You use a translation app for key words like \"On\" and \"Off\".\n\n**Common mistakes**\n*   Misconception: \"Shouting helps people understand.\" | Correction: Shouting distorts lip movements and can seem aggressive; use clear enunciation or writing instead. | AC: 210.LO3.AC2\n*   Misconception: \"Visual aids are childish.\" | Correction: Diagrams are often the most precise way to overcome language or technical knowledge gaps. | AC: 210.LO3.AC2\n\n**Key Points**\n*   **Hearing:** Use Light, Lip-reading, Writing.\n*   **Visual:** Use Verbal description, Large print.\n*   **Language:** Use Diagrams, Translation.\n*   **General:** Always check for understanding.\n\n### Coming Up Next\nWe have covered the methods and how to adapt them. Next, we will practice applying these choices to specific workplace scenarios."
      }
    },
    {
      "id": "210-3B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Specific Needs",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-C2-L1-A",
            "questionText": "What is a suitable adjustment when communicating with someone who has a hearing impairment?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "face them directly",
              "write it down",
              "use written notes",
              "good lighting",
              "lip reading"
            ],
            "hint": "Think about what helps them see your words or read the message."
          },
          {
            "id": "210-3B-C2-L1-B",
            "questionText": "Which type of aid is most effective for overcoming a language barrier?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "visual aids",
              "diagrams",
              "pictures",
              "translation app",
              "demonstration"
            ],
            "hint": "If words don't work, what can you look at to understand?"
          },
          {
            "id": "210-3B-C2-L1-C",
            "questionText": "What should you provide for a client with a visual impairment regarding documents?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "large print",
              "braille",
              "audio format",
              "digital text"
            ],
            "hint": "How can you make text easier to see or accessible without sight?"
          },
          {
            "id": "210-3B-C2-L2",
            "questionText": "Using your answers to Q1 (hearing) and Q2 (language), explain why 'shouting' is a poor strategy for both groups. What is the shared principle of effective adaptation here?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Shouting does not translate language.",
              "Shouting distorts lip movements making lip-reading harder.",
              "The shared principle is clarity and switching channels (to visual/written), not just increasing volume.",
              "Effective adaptation requires changing the method to suit the receiver's capability."
            ],
            "expectedAnswer": [
              "Shouting is poor because it does not help translate a foreign language, and for hearing impairments, it distorts your face making lip-reading difficult. The shared principle is that we must change the method (like using visuals or writing) rather than just increasing the volume.",
              "Volume doesn't fix understanding. For language barriers, we need visuals. For hearing loss, we need clear visibility or writing. Shouting fails both because it doesn't address the actual barrier."
            ],
            "hint": "Think about the 'adapter' analogy. Does forcing the plug harder (shouting) make it fit, or do you need a different tool?"
          }
        ]
      }
    },
    {
      "id": "210-3B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-3B-P1",
            "questionText": "A written job sheet takes 5 minutes to complete. If you complete 6 job sheets in a day, how many total minutes are spent on written communication?",
            "answerType": "numeric",
            "expectedAnswer": [
              "30"
            ],
            "hint": "Multiply the time per sheet by the number of sheets."
          },
          {
            "id": "210-3B-P2",
            "questionText": "You need to warn a colleague of a falling object immediately, but it is too noisy to shout. What method do you use?",
            "answerType": "short-text",
            "expectedAnswer": [
              "hand signals",
              "visual signals",
              "non-verbal",
              "gestures"
            ],
            "hint": "Immediate safety warning without sound."
          },
          {
            "id": "210-3B-P3",
            "questionText": "A customer claims you quoted £100, but you actually quoted £150. Which communication method would have prevented this dispute by providing proof?",
            "answerType": "short-text",
            "expectedAnswer": [
              "written",
              "email",
              "written quote",
              "paperwork"
            ],
            "hint": "The method that creates a permanent legal record."
          },
          {
            "id": "210-3B-P4",
            "questionText": "You are giving a safety briefing to a worker with limited English. Besides speaking simply, what can you show them to ensure they understand the hazard zones?",
            "answerType": "short-text",
            "expectedAnswer": [
              "diagrams",
              "pictures",
              "visual aids",
              "drawings",
              "signs"
            ],
            "hint": "A picture is worth a thousand words."
          },
          {
            "id": "210-3B-P5",
            "questionText": "A toolbox talk involves 1 supervisor and 4 operatives. If the talk lasts 15 minutes, how many total person-minutes are consumed by this verbal communication?",
            "answerType": "numeric",
            "expectedAnswer": [
              "75"
            ],
            "hint": "Total people (1+4) multiplied by the duration."
          }
        ]
      }
    },
    {
      "id": "210-3B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-INT-1",
            "questionText": "Scenario: You are explaining a complex boiler fault to an elderly customer who has significant hearing loss. Analyze why a standard verbal explanation might fail and propose a combined strategy. In your answer, include: (1) The barrier to the standard method, (2) Two specific adaptations you would use, and (3) Why checking understanding is critical here.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Barrier: The customer cannot hear technical details clearly, leading to misunderstanding.",
              "Adaptation 1: Face the customer directly in good light for lip-reading.",
              "Adaptation 2: Write down the key points or costs (Written method) or use a diagram.",
              "Reasoning: Checking understanding ensures the message was received despite the sensory deficit.",
              "Demonstrates linking a specific need (hearing) to a method choice (written/visual)."
            ],
            "expectedAnswer": [
              "A standard verbal explanation might fail because the customer cannot hear the technical details clearly. To fix this, I would face the customer directly in good light so they can lip-read, and I would also write down the fault details and cost on paper. Checking understanding is critical to ensure they actually agreed to the work and didn't just nod out of politeness.",
              "The barrier is hearing loss. I would use written notes and diagrams to support my speech. I would also ensure I am facing them. Checking understanding prevents disputes later if they didn't hear the price correctly."
            ],
            "hint": "Combine 'Verbal' best practices (facing them) with a 'Written' backup."
          },
          {
            "id": "210-3B-INT-2",
            "questionText": "Evaluate the relationship between legal liability and communication methods. Why is 'Written Communication' considered superior for contracts but 'Non-verbal' superior for immediate crane safety? Answer in 3-4 sentences, explaining the specific property (e.g., permanence vs. speed) that makes each method correct for its context.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Written communication has the property of permanence/traceability, required for contracts/liability.",
              "Non-verbal communication has the property of visibility/immediacy, required for noisy safety situations.",
              "Using the wrong property causes failure (e.g., writing takes too long for safety; signals leave no proof for contracts).",
              "Synthesizes the trade-off between speed/visibility and evidence/detail."
            ],
            "expectedAnswer": [
              "Written communication is superior for contracts because its main property is permanence; it creates a lasting record that proves exactly what was agreed for legal liability. Non-verbal communication is superior for crane safety because its main property is visual immediacy; it cuts through site noise instantly to prevent accidents. You cannot use writing for the crane because it is too slow, and you cannot use signals for contracts because they leave no evidence.",
              "Contracts require proof, so we use written methods because they are permanent. Safety requires speed and visibility in noise, so we use non-verbal signals. The context dictates the method: one needs evidence, the other needs immediate reaction."
            ],
            "hint": "Focus on the words 'Permanent Record' vs 'Immediate Visibility'."
          }
        ]
      }
    },
    {
      "id": "210-3B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-3B-SR-1",
            "questionText": "Who is the 'Sender' in the communication cycle?",
            "expectedAnswer": [
              "the person giving information",
              "person speaking",
              "source of information"
            ],
            "hint": "The person who starts the message.",
            "answerType": "short-text"
          },
          {
            "id": "210-3B-SR-2",
            "questionText": "What is 'Feedback' in communication?",
            "expectedAnswer": [
              "confirmation",
              "reply",
              "response",
              "checking understanding"
            ],
            "hint": "How you know the message was understood.",
            "answerType": "short-text"
          },
          {
            "id": "210-3B-SR-3",
            "questionText": "What is 'Noise' in the context of communication barriers?",
            "expectedAnswer": [
              "interference",
              "distraction",
              "background sound",
              "barrier"
            ],
            "hint": "Anything that distorts or blocks the message.",
            "answerType": "short-text"
          }
        ],
        "notes": "Review of Communication Cycle (Lesson 3A) before progressing."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PROCEDURE",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO3",
      "coveredAC": [
        "AC1",
        "AC2"
      ],
      "outOfScopeAC": [
        "AC3",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification of verbal, written, and non-verbal communication methods. Adaptation of methods for hearing, visual, and language needs.",
      "outOfScope": "Conflict resolution strategies (AC3), Effects of poor communication (AC4), Technical report writing standards.",
      "rationale": "The lesson focuses on the selection of methods and inclusivity tools as required by AC1 and AC2."
    },
    "teachingConstraints": {
      "excludeHowTo": false,
      "purposeOnly": false,
      "identificationOnly": false,
      "noCalculations": false,
      "specificScope": "Focus on method selection and specific need adaptation."
    },
    "misconceptions": [
      {
        "misconception": "Verbal communication is always sufficient because it is fast.",
        "correction": "Written communication is required for liability, contracts, and formal records regardless of speed.",
        "relatedAC": "210.LO3.AC1"
      },
      {
        "misconception": "Shouting helps people with language barriers or hearing loss understand better.",
        "correction": "Shouting often distorts lip-reading and does not translate language; visual aids or writing are effective adaptations.",
        "relatedAC": "210.LO3.AC2"
      },
      {
        "misconception": "Hand signals are informal and optional.",
        "correction": "Standardized hand signals are a formal, mandatory safety communication method in noisy environments.",
        "relatedAC": "210.LO3.AC1"
      }
    ]
  }
}