{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn to identify site visitors and statutory inspectors, understanding their roles, legal powers, and remits.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify the common types of site visitors and inspectors encountered in a professional environment",
    "Describe the primary purpose and remit of specific statutory inspectors including HSE and Building Control",
    "Determine which inspector is relevant to specific aspects of technical installation and compliance"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the common types of site visitors and inspectors encountered in a professional environment",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the primary purpose and remit of specific statutory inspectors including HSE and Building Control",
            "bloomLevel": "understand"
          },
          {
            "text": "Determine which inspector is relevant to specific aspects of technical installation and compliance",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Inspector",
            "definition": "An official with legal power (statute) to enter a site to enforce laws, unlike a general visitor who must be invited."
          },
          {
            "term": "Remit",
            "definition": "The specific legal boundaries of an inspector's job; what they are allowed to check and what they are not."
          },
          {
            "term": "Building Control",
            "definition": "The authority that checks the building itself (structure, materials, insulation) to ensure it meets building regulations."
          },
          {
            "term": "Health and Safety Executive (HSE)",
            "definition": "The national agency that checks the safety of people (workers and public) and investigates accidents."
          },
          {
            "term": "Compliance",
            "definition": "The act of following all rules, laws, and technical standards correctly."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Site Visitors vs. Statutory Inspectors",
        "content": "### In this lesson\nYou will learn the difference between a guest on site and an official with legal power. You will understand why we track everyone who enters a construction area.\n\n*   Distinguish between general visitors (guests) and statutory inspectors (officials).\n*   Understand why signing in is a legal safety requirement.\n*   Recognise the security rules for site access.\n\n**What this is**\nA **Site Visitor** is anyone on site who is not a permanent employee. This includes delivery drivers, clients, and architects. Most visitors are guests; they must be invited and usually accompanied.\n\nA **Statutory Inspector** is different. They are officials with **legal authority** given by the government. They do not always need an invitation. If they suspect a danger, they can enter the site to inspect it, and they have the power to stop work if it is unsafe.\n\n**Concrete Anchor**\nThink of a restaurant kitchen. A customer (General Visitor) cannot just walk into the kitchen; they must be invited. However, a Food Safety Officer (Statutory Inspector) has the legal right to walk into the kitchen at any time to check cleanliness. They don't need the manager's permission because the law gives them authority.\n\n**Why it matters**\nSafety and Law. If an untrained visitor wanders off, they could be hurt. If a Statutory Inspector is refused entry, the company can be fined. You must know who is who so you can follow the right rules: keep guests safe, and give inspectors the access they legally require.\n\n**Key facts / rules**\n*   **Log Book**: Everyone (visitors and inspectors) must sign in and out. This is for fire safety—we need to know who is in the building during an emergency.\n*   **Accompaniment**: General visitors must be escorted by a site representative. Statutory Inspectors may be allowed to move freely depending on their **Remit**.\n*   **Identification**: Always check ID. An inspector carries a warrant or official badge.\n\n**When to choose it**\nAs soon as someone arrives at the gate. Ask: \"Are they here to sell something (Visitor), buy something (Client/Visitor), or enforce the law (Inspector)?\"\n\n**Common mistakes**\nThinking a client (who pays the bills) has the same authority as an inspector. A client can complain, but an inspector can shut the site down.\n\nMisconceptions (targeted):\n*   Misconception: Anyone from the council can stop work on site. | Correction: Only inspectors with a specific legal **Remit** (like HSE or Building Control) have the power to issue notices or stop work. | AC: AC3\n*   Misconception: Visitors only need to sign in if they stay a long time. | Correction: Every person must be recorded immediately upon arrival for fire safety accountability. | AC: AC3\n\n**Key Points**\n*   General Visitors = Guests (need permission).\n*   Statutory Inspectors = Officials (have legal power).\n*   Everyone signs the log book for safety."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Visitors and Authority",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "What is the primary safety reason for requiring all visitors to sign a log upon arrival?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "fire safety",
              "accountability",
              "emergency evacuation",
              "know who is on site"
            ],
            "hint": "Think about what happens if the fire alarm goes off—how do we know who to count?"
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "General visitors usually require a site representative to go with them. What is this called?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "escort",
              "accompaniment",
              "being accompanied",
              "chaperone"
            ],
            "hint": "It ensures they don't wander into dangerous areas alone."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Which type of visitor has the legal power to enforce regulations, sometimes without an appointment?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Statutory Inspector",
              "Inspector",
              "HSE",
              "Building Control"
            ],
            "hint": "This person has authority granted by law (statute)."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Why do we treat a Statutory Inspector differently from a General Visitor regarding site access?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Statutory Inspectors have legal authority (remit) to enter",
              "General Visitors are guests and must be invited/escorted",
              "Refusing an inspector can lead to legal penalties",
              "Both must sign in for safety, but access rights differ"
            ],
            "expectedAnswer": [
              "We treat them differently because a Statutory Inspector has legal power (a remit) to enter and check the work, whereas a General Visitor is just a guest. While both must sign in for safety, we cannot refuse a Statutory Inspector entry if they are acting within their legal powers."
            ],
            "hint": "Compare 'permission' (for a guest) vs 'legal right' (for an inspector)."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "HSE vs. Building Control",
        "content": "### In this lesson\nWe will look at the two most important inspectors: the **HSE** and **Building Control**. We will learn how to tell them apart based on what they look at: **People** vs. **Property**.\n\n*   Describe the **Remit** of the **HSE** (Safety of People).\n*   Describe the **Remit** of **Building Control** (Quality of Building).\n*   Identify utility inspectors (Water/Electric).\n\n**What this is**\nDifferent inspectors have different \"Remits\" (areas of responsibility).\n\n1.  **Health and Safety Executive (HSE)**: They focus on **PEOPLE**. Their job is to prevent injury and death. They check if you are wearing a hard hat, if the scaffolding is safe, and if there is a risk of someone getting hurt.\n2.  **Building Control**: They focus on the **BUILDING**. Their job is to ensure the structure meets regulations. They check if the walls are strong, if the insulation is correct, and if the drains fall at the right angle.\n\n**Analogy: Traffic Police vs. Mechanic**\n*   **HSE** is like the **Traffic Police**. They watch *how* you drive to make sure you don't hurt anyone.\n*   **Building Control** is like the **Vehicle Mechanic (MOT)**. They check the *car* to make sure it is built correctly and safe to be on the road.\n\n**Why it matters**\nIf you have a problem with a loose railing that might kill someone, you report it to the HSE (Safety). If you have a problem with a pipe that is the wrong size, you report it to Building Control (Standards). Calling the wrong one wastes time and causes confusion.\n\n**Utility Inspectors**\nThere are also specialist inspectors for **Water** and **Electricity**. A water inspector checks that pipes don't contaminate the public water supply. An electrical inspector checks that wiring meets safety standards (like BS 7671).\n\n**Key facts / rules**\n*   **HSE**: Enforces the \"Health and Safety at Work Act\". Can stop work immediately if people are in danger.\n*   **Building Control**: Enforces \"Building Regulations\". Can make you tear down work if it doesn't meet standards.\n*   **Remit**: You must know the inspector's remit. A water inspector cannot fine you for bad scaffolding.\n\n**When to choose it**\nScenario: You see a deep trench.\n*   Is it about to collapse on a worker? -> **HSE** issue (People safety).\n*   Is it the wrong depth for the foundation? -> **Building Control** issue (Building standard).\n\nMisconceptions (targeted):\n*   Misconception: The HSE checks if the building will last 50 years. | Correction: Building Control checks structural quality; HSE checks that workers don't get hurt building it. | AC: AC3\n*   Misconception: Any inspector can fine you for not wearing PPE. | Correction: Only the HSE (or site management) enforces PPE. A water inspector only cares about the water pipes. | AC: AC3"
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Inspector Remits",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which organization is responsible for enforcing workplace safety and preventing accidents (protecting people)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Health and Safety Executive",
              "HSE",
              "The HSE"
            ],
            "hint": "Think 'Health' and 'Safety'. They act like the police for worker safety."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which authority checks that the construction work itself (materials, structure) meets building regulations?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Building Control",
              "local building control",
              "building control officer"
            ],
            "hint": "They control the standards of the 'Building'."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "What word describes the specific legal area an inspector is allowed to check?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Remit",
              "Scope",
              "Jurisdiction"
            ],
            "hint": "It starts with R. It means their scope of responsibility."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "If a trench is dug on site, how would the interest of the HSE differ from the interest of Building Control?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE cares about worker safety (trench collapse, barriers)",
              "Building Control cares about the structure (foundation depth, soil type)",
              "HSE = People; Building Control = Property"
            ],
            "expectedAnswer": [
              "The HSE would check if the trench is safe for workers (e.g., shoring to prevent collapse). Building Control would check if the trench is the correct size and depth for the building's foundations.",
              "The HSE focuses on the safety of the people working in the trench. Building Control focuses on whether the trench meets the technical standards for the building structure."
            ],
            "hint": "One looks at the safety of the workers inside it; the other looks at the quality of the hole itself."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn: Identify the Inspector",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A visitor arrives and demands to see the accident log book because they are investigating a recent injury. Which body do they likely represent?",
            "answerType": "short-text",
            "expectedAnswer": [
              "HSE",
              "Health and Safety Executive"
            ],
            "hint": "They investigate injuries and accidents."
          },
          {
            "id": "210-1B-P2",
            "questionText": "An official arrives to check that the insulation installed in the roof meets the energy efficiency regulations. Who are they?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Building Control",
              "Building Control Officer"
            ],
            "hint": "They are checking the building's materials and standards, not worker safety."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A person arrives to check the main water supply connection to ensure there is no risk of backflow contamination. What type of inspector is this?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Water Inspector",
              "Water regulations inspector",
              "Utility inspector"
            ],
            "hint": "They focus specifically on the water supply system."
          },
          {
            "id": "210-1B-P4",
            "questionText": "True or False: A client visiting the site has the legal power to issue a 'Prohibition Notice' to stop work immediately.",
            "answerType": "short-text",
            "expectedAnswer": [
              "False",
              "No"
            ],
            "hint": "Only a Statutory Inspector has this legal power. A client is a commercial visitor."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Imagine a Statutory Inspector from the HSE arrives at the site gate. Explain the process: (1) What must happen at the gate? (2) What does their identification prove? (3) Why can they enter areas a normal visitor cannot?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Gate: Sign in/Log book for fire safety",
              "ID: Proves legal authority (warrant) and identity",
              "Access: Their remit (law) gives them power to enter to enforce safety, unlike a guest who needs an invite"
            ],
            "expectedAnswer": [
              "At the gate, the inspector must sign the log book for safety accountability. Their identification proves they are a Statutory Inspector with legal power. They can enter restricted areas because the law (their remit) gives them the authority to inspect for safety hazards, whereas a normal visitor is just a guest."
            ],
            "hint": "Combine 'signing in', 'checking ID', and 'legal power'."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Compare the roles of the Site Manager, the HSE, and Building Control regarding a new brick wall. Who is responsible for building it, who checks it is safe to build, and who checks the quality of the finished wall?",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Site Manager: Coordinates the building of the wall",
              "HSE: Checks the safety of the workers building it (scaffolding, PPE)",
              "Building Control: Checks the quality/standards of the wall itself (strength, materials)"
            ],
            "expectedAnswer": [
              "The Site Manager coordinates the team to build the wall. The HSE checks that the workers are safe while building it (e.g., using safe scaffolding). Building Control checks the quality of the finished wall to ensure it meets structural regulations."
            ],
            "hint": "Manager = Doer. HSE = Safety Checker. Building Control = Quality Checker."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "Who is the main person responsible for daily operations and coordinating trades on a site?",
            "expectedAnswer": [
              "Site Manager",
              "Site Supervisor",
              "Project Manager"
            ],
            "hint": "The head of the site management team.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What do we call the formal rules passed by government that must be followed by law?",
            "expectedAnswer": [
              "Legislation",
              "Acts of Parliament",
              "Statutes",
              "Regulations"
            ],
            "hint": "The highest level of rules, above guidance notes.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What is the best way to keep a permanent record of a site meeting?",
            "expectedAnswer": [
              "Minutes",
              "Meeting minutes",
              "Written report"
            ],
            "hint": "A written document summarizing what was said and agreed.",
            "answerType": "short-text"
          }
        ],
        "notes": "Review of previous concepts (Site Management & Communication)."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC3"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification and primary functions of external site inspectors (HSE, Building Control) and site visitors.",
      "outOfScope": "Internal site management structures (AC1/AC2), specific technical inspection procedures, or legal enforcement protocols.",
      "rationale": "Focuses on the learner's situational awareness and understanding of external authority roles (AC3)."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus exclusively on the roles and remits of the inspectors listed in the must-have topics."
    },
    "misconceptions": [
      {
        "misconception": "Any person from a government office is an inspector who can stop work.",
        "correction": "Only those with a specific legal Remit and warrant have the power to issue formal notices or stop activities.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "The HSE checks if the building will stand up for 50 years.",
        "correction": "Building Control checks structural longevity and standards; the HSE checks that the builders don't get hurt while building it.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "All inspectors can fine you for not wearing a hard hat.",
        "correction": "Only the HSE or site management typically enforce PPE; a water inspector's authority is limited to water system Compliance.",
        "relatedAC": "AC3"
      }
    ]
  }
}