{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn about Site Visitors and Inspectors in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify the key roles and responsibilities of common site visitors",
    "Describe the specific purpose of different regulatory inspectors on a construction site",
    "Distinguish between the remits of HSE, Building Control, and utility-specific inspectors"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the key roles and responsibilities of common site visitors",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the specific purpose of different regulatory inspectors on a construction site",
            "bloomLevel": "understand"
          },
          {
            "text": "Distinguish between the remits of HSE, Building Control, and utility-specific inspectors",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Inspector",
            "definition": "A professional with legal authority from a government body to enter a site and verify that work complies with specific laws. (Anchor: Like a health inspector in a restaurant)."
          },
          {
            "term": "Remit",
            "definition": "The specific limit of authority assigned to an inspector. It defines exactly what they can check and what they cannot. (Anchor: Like a job description)."
          },
          {
            "term": "Building Control",
            "definition": "The body that checks if the finished building meets national regulations (e.g., fire safety, structure). They check the 'product'. (Anchor: Local Council Inspector)."
          },
          {
            "term": "Health and Safety Executive (HSE)",
            "definition": "The national regulator that checks if the work is being done safely. They check the 'people' and 'process'. (Anchor: Workplace Safety Police)."
          },
          {
            "term": "Compliance",
            "definition": "The act of following all rules, laws, and standards exactly. (Anchor: Following the rulebook)."
          },
          {
            "term": "Site Induction",
            "definition": "A mandatory briefing given to every visitor on arrival to explain specific local hazards. (Anchor: Safety briefing)."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Roles of Site Visitors",
        "content": "### In this lesson\nYou will learn to identify site visitors who are not part of the daily workforce. This ensures that everyone on site is safe and legal.\n\n*   Identify administrative requirements for visitors.\n*   Understand roles of clients, designers, and delivery drivers.\n*   Recognize why site safety briefings (inductions) are mandatory.\n\n**What this is**\nSite visitors are people who do not work on the site permanently but have a reason to be there. This includes **Clients** (who pay for the work), **Architects/Designers** (who plan the work), and **Delivery Drivers** (who bring materials). Unlike the regular team, these people do not know where the holes in the floor are or where the cranes are moving. Therefore, a **Site Induction** is a mandatory safety talk given to *every* visitor immediately upon arrival. This ensures **Compliance** with safety laws.\n\n**Why it matters**\nIf a visitor walks into a danger zone without knowing the rules, they can get hurt or cause an accident. Even a VIP like the project owner must follow these rules. Managing them correctly protects the company from legal trouble and keeps the visitor safe.\n\n**Key facts / rules**\n*   **Sign-in/Sign-out:** All visitors must sign a logbook so the site manager has an accurate list (roll-call) in case of a fire.\n*   **Site Induction:** Must happen *before* the visitor enters any work zone. It teaches them about local hazards.\n*   **Escorts:** Visitors usually need a site representative to walk with them.\n*   **Deliveries:** Drivers are visitors. If they leave their cab, they need an induction.\n\n**Scale and Intensity (Micro-Scenario)**\nThe rules for visitors scale with the size of the job:\n*   **Small Domestic Job:** A homeowner visiting their kitchen renovation might just need a verbal warning: \"Watch out for the loose cables in the hallway.\"\n*   **Large Commercial Site:** A client visiting a skyscraper build requires a formal 20-minute video induction, full PPE (helmet, boots, vest), and a security pass.\n*   *Why the difference?* Large sites have complex, hidden dangers (like high voltage or overhead loads) that a visitor cannot see immediately, whereas small sites have obvious hazards.\n\n**Common mistakes**\n*   *Mistake:* Thinking a \"highly qualified\" visitor (like an engineer) doesn't need an induction.\n*   *Correction:* Qualifications prove they know the trade, but an induction teaches them the *specific* hazards of *this* building (e.g., \"The lift shaft on Floor 3 is open\").\n\n**Key Points**\n*   **Site Induction** = Mandatory first step for all visitors.\n*   **Sign-in Log** = Essential for fire safety (roll-call).\n*   **Delivery Drivers** = Count as visitors if they enter the site boundary."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Roles of Site Visitors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "What administrative action must a visitor take upon arrival to ensure they are counted in a fire roll-call?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Sign in and sign out",
              "Signing in",
              "Sign the visitor log"
            ],
            "hint": "Think about the logbook at the site entrance."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "What is the name of the mandatory briefing that teaches visitors about the specific hazards of that location?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Induction",
              "Induction",
              "Site safety induction"
            ],
            "hint": "This is the safety talk given before they are allowed to walk around."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Why does a highly qualified architect still need a site induction?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "To learn unique site hazards",
              "They don't know the specific site risks",
              "Hazards are specific to the location"
            ],
            "hint": "They know how to design buildings, but do they know where the open holes are on *this* specific site?"
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Using the 'Scale' concept (Domestic vs. Commercial), explain why visitor requirements differ between a small house repair and a large construction site.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Small sites have obvious hazards; large sites have complex/hidden hazards",
              "Large sites require formal processes (passes, videos) due to higher risk intensity",
              "Both require safety communication, but the method changes (verbal vs. formal)"
            ],
            "expectedAnswer": [
              "Visitor requirements differ because the complexity of hazards changes. On a small domestic site, hazards are usually obvious, so a verbal warning is enough. On a large commercial site, hazards like cranes or high voltage are complex and hidden, requiring a formal induction and stricter controls to ensure safety.",
              "The scale of the site determines the intensity of the induction. A large site has more people and more dangerous machinery, so the rules must be stricter (like formal passes and videos) compared to a small home repair where a simple conversation might suffice."
            ],
            "hint": "Think about how much more dangerous and confusing a big construction site is compared to a small room."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Specialist Regulatory Inspectors",
        "content": "### In this lesson\nYou will learn the difference between inspectors who check the **people** (HSE) and inspectors who check the **building** (Building Control).\n\n**What this is**\nA **Statutory Inspector** is a government official with the legal power (Right of Entry) to come onto a site and check that laws are being followed. However, they don't all check the same thing. They each have a **Remit** (a specific scope of power).\n\n**The Two Main Types:**\n1.  **HSE (Health and Safety Executive):**\n    *   **Focus:** The **People** and the **Process**. are workers safe? Are they wearing helmets? Is the scaffolding stable?\n    *   **Power:** Can stop work immediately if they see danger.\n    *   *Analogy:* The \"Traffic Police\" checking if you are driving safely.\n\n2.  **Building Control:**\n    *   **Focus:** The **Product** (The Building). Is the wall strong enough? Is the insulation thick enough? Does it meet fire regulations?\n    *   **Power:** Can refuse to sign off the building, meaning it cannot be sold or used.\n    *   *Analogy:* The \"MOT Tester\" checking if the car is built to legal standards.\n\n**Other Inspectors:**\n*   **Utility Inspectors (Water/Power):** Check that new pipes or cables connect safely to the public network. Their **Remit** is limited to just their pipes/cables.\n\n**When to choose it**\n*   If a worker falls off a ladder -> **HSE** investigates.\n*   If the foundations are too shallow -> **Building Control** investigates.\n\n**Micro-Scenario: The Remit Check**\nImagine an electrical inspector arrives. They can check your wiring. However, they *cannot* tell you to rebuild a brick wall. That is outside their **Remit**. Similarly, a Building Control officer cannot fine you for not wearing gloves; that is the HSE's job (though they might mention it!).\n\n**Key Points**\n*   **Statutory Inspectors** have legal entry rights.\n*   **HSE** = Safety of People (Process).\n*   **Building Control** = Quality/Safety of Building (Product).\n*   **Remit** = The specific area an inspector is allowed to judge."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Specialist Regulatory Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which regulatory body checks that the finished building meets national structural and fire laws?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Building Control",
              "Building control officer"
            ],
            "hint": "They check the 'product' (the building itself)."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which national regulator focuses on the safety of the workers and the work process?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Health and Safety Executive",
              "HSE",
              "The HSE"
            ],
            "hint": "They act like the 'police' for workplace safety."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "What term describes the specific legal limit of what an inspector is allowed to check?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Remit",
              "The remit",
              "Their remit"
            ],
            "hint": "It starts with 'R' and means their scope of authority."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Explain the difference between HSE and Building Control using the 'People vs. Product' analogy.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE protects the people/workers during the job",
              "Building Control checks the product/building after (or during) the job",
              "One focuses on safe working methods, the other on legal building standards"
            ],
            "expectedAnswer": [
              "The HSE focuses on the 'People' and the process, ensuring workers are safe while doing the job (e.g., using scaffolding correctly). Building Control focuses on the 'Product', ensuring the final building is safe to inhabit and meets laws (e.g., fire exits are wide enough).",
              "HSE protects the workforce from accidents during construction. Building Control ensures the building structure itself is legal and safe for the public."
            ],
            "hint": "One cares about *how* you build (safety), the other cares about *what* you built (structure)."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "Why must a VIP visitor (like the project owner) still complete a site induction?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Site-specific hazards",
              "They don't know the local risks",
              "To ensure compliance",
              "Safety laws apply to everyone"
            ],
            "hint": "Rank does not protect you from falling down a hole you didn't know was there."
          },
          {
            "id": "210-1B-P2",
            "questionText": "You have finished a wall. Which inspector comes to check that the insulation meets energy saving laws?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Building Control",
              "Building control officer"
            ],
            "hint": "This is about the quality/legality of the finished 'product'."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A site log shows: 8 staff, 2 architects, 1 client, and 4 delivery drivers. How many people are classified as 'visitors'?",
            "answerType": "numeric",
            "expectedAnswer": [
              "7"
            ],
            "hint": "Staff are not visitors. Everyone else (Architects + Client + Drivers) is a visitor."
          },
          {
            "id": "210-1B-P4",
            "questionText": "An electrical inspector wants to check the plumbing. You politely tell them they cannot. What concept explains why they cannot check the plumbing?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Remit",
              "Outside their remit",
              "Scope of authority"
            ],
            "hint": "The legal limit of their power."
          },
          {
            "id": "210-1B-P5",
            "questionText": "A delivery van arrives with 1 driver and 2 assistants. They all get out to unload. How many people must sign the visitor log?",
            "answerType": "numeric",
            "expectedAnswer": [
              "3"
            ],
            "hint": "Every single person entering the site boundary must be accounted for."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "A Statutory Inspector arrives to check a serious accident. (1) Which body are they likely from? (2) Do they need to sign in? (3) Why must they still follow site safety rules despite having legal power?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Body: HSE (Health and Safety Executive)",
              "Sign-in: Yes, for fire roll-call/accountability",
              "Safety: Legal power does not make them immune to hazards; duty of care applies"
            ],
            "expectedAnswer": [
              "They are from the HSE. Yes, they must still sign in for the fire roll-call. Even though they have legal power, they must follow safety rules because the site hazards (like open holes) can still hurt them, and the site manager has a duty of care to protect everyone.",
              "1. HSE. 2. Yes, they must sign in. 3. They must follow rules to ensure their own safety and the safety of others, as legal authority does not protect against physical accidents."
            ],
            "hint": "Think about 'People Safety' (HSE) and why a fire alarm doesn't care if you are an inspector."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Compare the roles of a Client Visitor, a Building Control Officer, and an HSE Inspector. Who is there to observe progress, who checks the finished product, and who checks the safety of the work process?",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Client: Observes progress / interest in the result",
              "Building Control: Checks the finished product (compliance with building regs)",
              "HSE: Checks the safety of the work process (people)"
            ],
            "expectedAnswer": [
              "The Client Visitor is there to observe progress and check if the project is on schedule. The Building Control Officer checks the finished product to ensure it meets building regulations. The HSE Inspector checks the safety of the work process to ensure workers are protected.",
              "Client = Progress/Observation. Building Control = Product/Regulations. HSE = People/Safety."
            ],
            "hint": "Match these three to: 'Progress', 'Product', and 'People'."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "Which role is responsible for the daily supervision of the site team?",
            "expectedAnswer": [
              "Site Manager",
              "The site manager"
            ],
            "hint": "They are the boss of the site operations.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What do we call the laws that construction sites must strictly follow?",
            "expectedAnswer": [
              "Legislation",
              "Statutory regulations",
              "Regulations"
            ],
            "hint": "Rules set by the government.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What is the general term for exchanging information (e.g., talking, email, radio) on site?",
            "expectedAnswer": [
              "Communication",
              "Communication methods"
            ],
            "hint": "The process of sharing information.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check regarding Unit 210 LO1 AC1/AC2"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC3"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification of site visitor roles and the specific purpose of various regulatory inspectors (AC3).",
      "outOfScope": "Detailed technical inspection procedures, specific building regulations clauses.",
      "rationale": "The lesson focuses on identifying who visitors are and their authority (remit), not the technical details of what they inspect."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on role identification and authority remit only."
    },
    "misconceptions": [
      {
        "misconception": "Visitors with high professional status can bypass the safety briefing.",
        "correction": "Every person, regardless of rank, must receive a Site Induction to ensure they understand site-specific hazards.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "Building Control inspectors are responsible for checking the quality of the paint and finishes.",
        "correction": "Their Remit is limited to ensuring work meets legal building regulations, such as fire safety and structural stability.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "All inspectors have the same authority.",
        "correction": "Each inspector has a specific Remit; for example, a water inspector cannot issue a notice regarding electrical wiring.",
        "relatedAC": "AC3"
      }
    ]
  }
}