{
  "id": "210-1B",
  "title": "210.1B — Site Visitors and Inspectors",
  "description": "Learn about Site Visitors and Inspectors in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Site Visitors and Inspectors",
  "learningOutcomes": [
    "Identify common types of site visitors and their primary reasons for being on-site",
    "Describe the specific roles and responsibilities of different regulatory inspectors",
    "Distinguish between the remits of health and safety inspectors versus utility-specific inspectors"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify common types of site visitors and their primary reasons for being on-site",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the specific roles and responsibilities of different regulatory inspectors",
            "bloomLevel": "understand"
          },
          {
            "text": "Distinguish between the remits of health and safety inspectors versus utility-specific inspectors",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Inspector",
            "definition": "An official with legal power to enter a site to enforce regulations, unlike a general visitor who needs permission.",
            "anchor": "Example: An HSE inspector showing a warrant card to enter a locked plant room without an appointment."
          },
          {
            "term": "Remit",
            "definition": "The specific legal boundary of an inspector's authority, defining exactly what they can and cannot enforce.",
            "anchor": "Example: A water inspector can check the main stopcock but cannot fine an electrician for not wearing a hard hat."
          },
          {
            "term": "Building Control Officer",
            "definition": "A regulator who ensures the permanent structure and systems meet national building regulations (e.g., fire safety, structural load).",
            "anchor": "Example: An officer measuring the depth of thermal insulation to ensure it meets Part L requirements."
          },
          {
            "term": "Health and Safety Executive (HSE) Inspector",
            "definition": "A statutory officer who enforces laws regarding the safety and welfare of the workforce during construction.",
            "anchor": "Example: An inspector issuing a Prohibition Notice because a trench lacks proper shoring support."
          },
          {
            "term": "Utility Inspector",
            "definition": "A specialist who verifies that a specific service connection (gas, water, electric) is safe before connecting it to the public network.",
            "anchor": "Example: An electrical engineer sealing the main intake fuse after verifying the meter tails are correct."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Roles of Site Visitors",
        "content": "### In this lesson\nYou will learn to identify the people entering a site and why they are there. This distinction is critical because some visitors (like clients) need permission to enter, while others (like statutory inspectors) have a legal right to enter.\n\n*   General Visitors vs. Statutory Inspectors.\n*   Logistics and Management roles.\n*   Legal Rights of Entry.\n\n**What this is**\nA **Site Visitor** is anyone not part of the permanent installation workforce. They fall into two main categories:\n1.  **General Visitors**: People who are invited or have business on-site (e.g., clients, architects, delivery drivers). They must have permission to enter.\n2.  **Statutory Inspectors**: Officials with legal authority (e.g., HSE, Building Control). They have a 'Right of Entry' and can access the site to enforce laws, often without an appointment.\n\n**Why it matters**\nSite security depends on knowing who has the right to be there. You can stop a delivery driver if they don't have the right paperwork, but you cannot legally stop an HSE inspector who shows their warrant card. Misidentifying an inspector can lead to legal penalties.\n\n**Key facts / rules**\n*   **Clients**: Visit to check progress against the contract (e.g., \"Is the lighting installed on schedule?\").\n*   **Architects/Designers**: Visit to verify technical compliance (e.g., \"Are the cable trays routed as per the drawing?\").\n*   **Logistics/Delivery**: Visit briefly to drop off materials (e.g., delivering a pallet of distribution boards).\n*   **Statutory Inspectors**: Visit to enforce the law. They do **not** need an invitation.\n\n**When to choose it**\nUse this distinction when someone arrives at the site gate. \n*   If a van arrives with **switchgear components**, they are a logistics visitor—direct them to the loading bay.\n*   If a person arrives with a **warrant card** to check trench safety, they are a statutory inspector—grant access immediately and notify management.\n\n**Common mistakes**\nLearners often think all inspectors are the same. A **Client Inspector** (checking quality) has no legal power to fine you, whereas a **Statutory Inspector** (enforcing law) does.\n\nMisconceptions (targeted):\n*   Misconception: All visitors have the right to walk anywhere on a site independently. | Correction: Most visitors must be escorted. Only Statutory Inspectors have broad rights to access hazardous areas for investigation. | AC: AC3\n*   Misconception: Delivery drivers are part of the workforce. | Correction: They are visitors because they do not perform installation work. | AC: AC3\n\n**Key Points**\n*   General visitors (clients, delivery) need permission.\n*   Statutory inspectors (HSE, Building Control) have legal power.\n*   Always verify the identity of anyone entering the site."
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Roles of Site Visitors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "What is the primary reason a client visits a technical site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "monitor progress against a contract",
              "check progress",
              "monitor timeline",
              "verify completion"
            ],
            "hint": "They are paying for the work and want to see if it is on schedule."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "For what purpose do delivery personnel briefly enter a site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "provide materials or equipment",
              "deliver materials",
              "drop off goods",
              "logistics"
            ],
            "hint": "They bring items like cable drums or switchgear but do not install them."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "What specific right does a Statutory Inspector have regarding site entry that a general visitor does not?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "enter at any reasonable time",
              "legal right to enter",
              "enter without appointment",
              "statutory right of entry"
            ],
            "hint": "They do not need to ask for permission if they are enforcing the law."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Compare a delivery driver delivering a transformer and an HSE inspector checking the crane used to lift it. How do their rights to enter the site differ?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Delivery driver is a general visitor requiring permission/invitation.",
              "HSE inspector is a statutory official with legal right of entry.",
              "Driver can be turned away; Inspector cannot be legally refused reasonable entry."
            ],
            "expectedAnswer": [
              "The delivery driver is a general visitor who needs permission to enter; they can be turned away if the site is not ready. The HSE inspector is a statutory official who has a legal right to enter to check safety; they cannot be refused entry without legal consequences."
            ],
            "hint": "One is there for a commercial transaction, the other is there to enforce the law."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Specialist Regulatory Inspectors",
        "content": "### In this lesson\nYou will learn to distinguish between the three main types of regulatory inspectors: Building Control, HSE, and Utility Inspectors. Each has a different **Remit** (scope of power).\n\n*   Building Control vs. HSE vs. Utility.\n*   Understanding 'Remit'.\n*   Who checks the structure vs. who checks the worker.\n\n**What this is**\nInspectors are not all the same. Their **Remit** defines what they are allowed to inspect and enforce.\n\n1.  **Building Control Officer**: Cares about the **Building**. They check if the permanent installation meets regulations (e.g., \"Is this fire stopping thick enough?\" or \"Does this beam support the load?\").\n2.  **HSE Inspector**: Cares about the **People/Workforce**. They check if the work is being done safely (e.g., \"Are those workers wearing hard hats?\" or \"Is that scaffolding safe?\").\n3.  **Utility Inspector**: Cares about the **Network**. They check specific connections before they go live (e.g., \"Is the main earthing conductor sized correctly before we connect the meter?\").\n\n**Why it matters**\nIf you call the wrong inspector, you waste time. If you have a dangerous trench, you report it to the HSE, not Building Control. If you need your electricity meter connected, you need a Utility Inspector, not the HSE.\n\n**Key facts / rules**\n*   **Building Control**: Checks compliance with Building Regulations (Part P, Part L, etc.). Focus: The finished product.\n*   **HSE**: Checks compliance with Health & Safety at Work Act. Focus: The working process.\n*   **Utility**: Checks compliance with network standards (ESQCR, Water Regs). Focus: The connection point.\n\n**When to choose it**\nImagine a scenario: An electrician is installing a fuse board while standing on a wobbly chair.\n*   **Building Control** looks at the fuse board: \"Is it installed at the correct height? Yes. Pass.\"\n*   **HSE** looks at the wobbly chair: \"Is the worker safe? No. Fail.\"\n\n**Common mistakes**\nConfusing Building Control with HSE. Remember: Building Control checks the *thing* you built; HSE checks *how* you are building it.\n\nMisconceptions (targeted):\n*   Misconception: A Utility Inspector can shut down a site for general safety violations. | Correction: Their remit is limited to their specific service (e.g., the gas pipe). They cannot fine you for a messy site unless it affects their pipe. | AC: AC3\n*   Misconception: Building Control checks if the finish looks nice. | Correction: They check for technical compliance (safety, efficiency), not aesthetics. | AC: AC3\n\n**Key Points**\n*   **Remit** = The limit of authority.\n*   HSE = Safety of people.\n*   Building Control = Compliance of structure.\n*   Utility = Integrity of network connection."
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Specialist Regulatory Inspectors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "What is the main responsibility of a Building Control Officer?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "comply with national building standards",
              "ensure building standards compliance",
              "verify building regulations",
              "check structural compliance"
            ],
            "hint": "They focus on the permanent structure and whether it meets legislation like Part P or Part B."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "What is the primary function of an HSE Inspector when visiting a site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "enforce health and safety compliance",
              "investigate safety of workers",
              "enforce welfare legislation",
              "workforce safety"
            ],
            "hint": "They are concerned with the welfare of the people working, not the building itself."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "What defines the limit of a Utility Inspector's authority on a site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "compliance of their specific service",
              "specific service remit",
              "technical compliance of service",
              "network connection standards"
            ],
            "hint": "Their power stops at the boundary of their specific network (e.g., water or gas)."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "An electrician is installing a new distribution board. The board is technically perfect, but the electrician is not wearing safety boots. Which inspector would have an issue with this, and which would not? Explain why based on 'remit'.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "HSE inspector would have an issue because their remit is worker safety (PPE).",
              "Building Control would not have an issue because their remit is the technical standard of the installation.",
              "The remit distinguishes between the process (safety) and the product (compliance)."
            ],
            "expectedAnswer": [
              "The HSE inspector would have an issue because their remit covers worker safety and PPE. The Building Control Officer would not have an issue because their remit covers the technical compliance of the installation itself, which is perfect in this scenario."
            ],
            "hint": "One checks the worker's safety, the other checks the installation's quality."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A site log shows three people arrived today: a driver delivering cable tray, an architect checking the lighting layout, and an HSE officer investigating a fall. How many of these individuals are classified as Statutory Inspectors?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "Only the individual with legal authority to enforce legislation (HSE) counts. The others are general visitors."
          },
          {
            "id": "210-1B-P2",
            "questionText": "What must be true about an individual's role for them to be classified as a 'visitor' rather than a member of the workforce?",
            "answerType": "short-text",
            "expectedAnswer": [
              "not permanent staff",
              "not part of workforce",
              "non-permanent staff",
              "not part of the core team"
            ],
            "hint": "Think about whether they are employed to do the daily installation work or just visiting."
          },
          {
            "id": "210-1B-P3",
            "questionText": "A Water Board inspector notices a trip hazard in the electrical switchroom. Why can they not issue a fine for this specific hazard?",
            "answerType": "short-text",
            "expectedAnswer": [
              "outside their remit",
              "beyond their remit",
              "not their remit",
              "outside their authority"
            ],
            "hint": "Their legal power is limited to the water network, not general site safety."
          },
          {
            "id": "210-1B-P4",
            "questionText": "A specialist arrives to test the seal on a new gas main before it is connected to the street supply. Which specific type of inspector is this?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Utility Inspector",
              "Utility",
              "Gas Inspector"
            ],
            "hint": "They are verifying a specific service connection to a public network."
          },
          {
            "id": "210-1B-P5",
            "questionText": "A project manager needs to sign off that the fire-rated plasterboard used in a corridor meets Part B regulations. Which official verifies this?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Building Control Officer",
              "Building Control",
              "Building Inspector"
            ],
            "hint": "This official focuses on the building's compliance with national regulations."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain the difference between a 'General Visitor' and a 'Statutory Inspector' in terms of access rights. Why is it important for a site supervisor to understand the specific 'remit' of an inspector like a Utility Engineer vs an HSE Officer? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "General visitors need permission; Statutory inspectors have a legal right of entry.",
              "Remit defines the boundary of authority (e.g., specific service vs general safety).",
              "Understanding remit prevents unauthorized access to unrelated areas and ensures the right person deals with the right issue."
            ],
            "expectedAnswer": [
              "General visitors require permission to enter, whereas Statutory Inspectors have a legal right of entry to enforce laws. It is important to understand the remit because a Utility Engineer only has authority over their specific service (like power or water), while an HSE Officer has authority over general workforce safety. Knowing this ensures the supervisor grants the correct level of access and directs the inspector to the relevant area."
            ],
            "hint": "Think about who needs an invitation and who has a warrant, and what specific part of the site they are allowed to control."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "You are the Site Manager. A Building Control Officer arrives to check the steel framework, and an HSE Inspector arrives to check scaffolding safety. Propose a brief protocol for handling both arrivals to ensure compliance and security.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Verify identities/warrant cards immediately.",
              "Grant access based on legal right (Statutory).",
              "Direct Building Control to the structural area (steelwork).",
              "Direct HSE to the working area (scaffolding).",
              "Ensure both are inducted/escorted as per site safety rules (even if they have right of entry, safety is paramount)."
            ],
            "expectedAnswer": [
              "1. Verify the identity and warrant cards of both inspectors immediately.\n2. Grant access as both are Statutory Inspectors with legal rights of entry.\n3. Direct the Building Control Officer to the structural steelwork area to inspect the permanent works.\n4. Direct the HSE Inspector to the scaffolding area to inspect the safety of the working conditions.\n5. Ensure both are accompanied to ensure site safety protocols are maintained."
            ],
            "hint": "Address verification, access granting, and directing them to their specific areas of interest."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "Which group is responsible for the overall daily supervision and management of a technical site?",
            "expectedAnswer": [
              "site management",
              "site management team",
              "management"
            ],
            "hint": "Think about the team that oversees all roles and operations on site.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What term is used for the formal laws and mandatory rules that a site must follow?",
            "expectedAnswer": [
              "statutory legislation",
              "legislation",
              "statutes"
            ],
            "hint": "This refers to the legal requirements (Acts and Regulations).",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What is the term for the different ways that information and instructions are shared between people on a site?",
            "expectedAnswer": [
              "communication methods",
              "communication",
              "methods of communication"
            ],
            "hint": "This relates to how teams exchange information effectively (e.g., radios, email, verbal).",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check regarding Site Management (AC1/AC2) before continuing with Visitors."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC3"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification and purpose of key site visitors and specific regulatory inspectors (Building Control, HSE, Utility).",
      "outOfScope": "Communication methods with visitors, legal enforcement procedures, or site induction protocols.",
      "rationale": "Focusing on role recognition establishes the necessary context before students learn how to interact with or report to these individuals."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus exclusively on identifying roles and functions of inspectors listed in the must-have topics."
    },
    "misconceptions": [
      {
        "misconception": "All visitors have the right to walk anywhere on a site independently.",
        "correction": "Most visitors must be escorted and are restricted to specific areas for safety reasons.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "A delivery driver is considered part of the site workforce.",
        "correction": "Delivery drivers are classified as visitors because they do not perform technical installation work on the site.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "A Utility Inspector can shut down a site for general safety violations.",
        "correction": "A Utility Inspector’s remit is usually limited to the safety and technical compliance of their specific service (e.g., water or gas).",
        "relatedAC": "AC3"
      }
    ]
  }
}