{
  "id": "210-3B",
  "title": "210.3B — Conflict Resolution and Communication Impact",
  "description": "Learn about Conflict Resolution and Communication Impact in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Conflict Resolution and Communication Impact",
  "learningOutcomes": [
    "Identify the negative effects of poor communication on an organisation's efficiency and reputation",
    "Describe the impact of communication breakdowns between operatives, management, and customers",
    "Select appropriate actions to resolve conflicts between co-workers, supervisors, and customers"
  ],
  "prerequisites": [
    "210-3A"
  ],
  "blocks": [
    {
      "id": "210-3B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the negative effects of poor communication on an organisation's efficiency and reputation",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the impact of communication breakdowns between operatives, management, and customers",
            "bloomLevel": "understand"
          },
          {
            "text": "Select appropriate actions to resolve conflicts between co-workers, supervisors, and customers",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-3B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Stakeholder",
            "definition": "Any individual or group who has an interest in the success of a project, such as the client, the boss, or the installation team."
          },
          {
            "term": "Communication Breakdown",
            "definition": "A failure to pass information clearly or correctly, resulting in errors, delays, or waste."
          },
          {
            "term": "Conflict Resolution",
            "definition": "The professional process of settling a disagreement to find a solution that allows work to proceed."
          },
          {
            "term": "Active Listening",
            "definition": "A technique where you concentrate, understand, respond, and remember what is being said, often by repeating it back to the speaker."
          },
          {
            "term": "Escalation",
            "definition": "The formal procedure of passing a difficult issue up the chain of command to a supervisor or manager."
          }
        ]
      }
    },
    {
      "id": "210-3B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Organizational Impact of Poor Communication",
        "content": "### In this lesson\nWe will look at what happens when communication fails. You will learn how a simple misunderstanding can cost a company money and damage its good name.\n\n*   **Efficiency:** How wasted time and materials hurt the bottom line.\n*   **Reputation:** How bad news travels and loses future customers.\n*   **Ripple Effect:** How a mistake by one person affects the whole team.\n\n**Concept: Communication Breakdown**\nImagine you are playing the \"Telephone Game\" (broken whispers). You whisper a message to the person next to you, and by the time it reaches the end of the line, it is completely different. On a work site, this is called a **Communication Breakdown**. It happens when information is missing, incorrect, or not shared with the right **Stakeholder** (the people who care about the project).\n\n**Concrete Impacts**\nWhen communication breaks down, it leads to two main physical problems:\n1.  **Rework:** Doing a job twice. For example, installing 50 meters of tray only to find out the specification changed and you have to take it down. \n2.  **Operational Lag:** Standing around waiting. For example, a team cannot start wiring because the supervisor hasn't sent the drawings.\n\n**Measuring the Loss (Efficiency)**\nWe measure the damage in **Efficiency**. Efficiency is the ratio of work done to resources used. If you use more hours to do the same job, efficiency drops.\n\n**How to Calculate Efficiency Loss:**\nIf a task takes longer than planned due to an error, we calculate the percentage loss using this logic:\n1.  Find the **Extra Hours** (Actual Time - Planned Time).\n2.  Divide **Extra Hours** by **Planned Time**.\n3.  Multiply by 100 to get the percentage.\n\n*Micro-Scenario:* \nA job is planned for **10 hours**. Due to a vague instruction, it takes **12 hours**.\n*   Extra Hours: 12 - 10 = **2 hours**.\n*   Calculation: 2 ÷ 10 = 0.20.\n*   Result: **20% loss** in efficiency.\n\n**Reputation Damage**\nEfficiency is about money and time (tangible). **Reputation** is about trust (intangible). If a company keeps missing deadlines because of poor communication, customers stop hiring them. It takes years to build a reputation but only one bad project to destroy it.\n\n**Key Points**\n*   **Stakeholders** include everyone: operatives, management, and clients.\n*   **Rework** and **Lag** are the visible signs of communication failure.\n*   **Reputation** damage is hard to fix and leads to lost contracts."
      }
    },
    {
      "id": "210-3B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Impact",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-C1-L1-A",
            "questionText": "What term describes a person or group with a direct interest in the project (e.g., client, manager, operative)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Stakeholder",
              "Stakeholders",
              "A Stakeholder"
            ],
            "hint": "This word starts with 'S' and refers to anyone who holds a stake in the outcome."
          },
          {
            "id": "210-3B-C1-L1-B",
            "questionText": "If a team has to remove and reinstall equipment because they were given the wrong plan, what is this waste of effort called?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Rework",
              "Re-work",
              "Reworking"
            ],
            "hint": "It means doing the work again."
          },
          {
            "id": "210-3B-C1-L1-C",
            "questionText": "Which asset is 'intangible' (cannot be touched) but is destroyed when customers lose trust in a company?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Reputation",
              "Brand",
              "Company reputation",
              "Good name"
            ],
            "hint": "It takes years to build this, but only one bad job to ruin it."
          },
          {
            "id": "210-3B-C1-L2",
            "questionText": "Explain why 'rework' is considered a double loss for an organisation. Use the concepts of 'resources' and 'schedule' in your answer.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Wastes materials (resources) that were used in the first attempt",
              "Wastes labour hours (resources) doing the work twice",
              "Delays the schedule because time is spent fixing errors instead of progressing",
              "Lowers overall efficiency"
            ],
            "expectedAnswer": [
              "Rework is a double loss because you waste the resources (materials and labour) used on the first incorrect attempt, and you also lose time on the schedule doing the job again. This reduces the organisation's efficiency significantly.",
              "It wastes both resources and time. You pay for materials twice and pay labour twice, while the schedule falls behind because no new progress is being made."
            ],
            "hint": "Think about what happens to the materials you installed wrongly and the time you spent doing it."
          }
        ]
      }
    },
    {
      "id": "210-3B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Conflict Resolution Actions",
        "content": "### In this lesson\nConflicts happen. Deadlines get tight and tempers flare. You will learn how to handle these situations professionally so work can continue.\n\n*   **Active Listening:** Making sure you understand before you argue.\n*   **Conflict Resolution:** Finding a 'win-win' or workable solution.\n*   **Escalation:** Knowing when to call for backup.\n\n**Concept: Conflict Resolution**\nThe goal of **Conflict Resolution** is not to \"win\" the argument. The goal is to reach a **Mutually Acceptable Outcome**. This means finding a solution that allows the project to move forward safely and correctly.\n\n**Tool 1: Active Listening**\nMost arguments get worse because people stop listening and start planning their next insult. **Active Listening** breaks this cycle. It involves:\n1.  **Concentrating** on the speaker.\n2.  **Paraphrasing:** Repeating back what they said in your own words. \n    *   *Example:* \"So, you are saying the cable route I chose is blocked by a pipe?\"\n3.  **Verbal/Non-Verbal Cues:** Nodding and saying \"I see\" or \"Go on\".\n\n**Tool 2: Escalation**\nSometimes you cannot resolve a conflict yourself. Maybe the customer is asking for something illegal, or a co-worker refuses to follow safety rules. In these cases, you use **Escalation**.\n\nThink of **Escalation** like a **pressure relief valve** on a boiler. If the pressure gets too high, the valve opens to release it safely. Similarly, if a conflict gets too heated or complex, you follow the formal procedure to pass it up to a manager. This prevents an explosion (a fight or a lawsuit).\n\n**Micro-Scenario: Saving Time**\n*   **Scenario A:** An operative argues with a client for 90 minutes about a bill. Result: 90 minutes wasted, client angry.\n*   **Scenario B:** The operative listens for 5 minutes, realizes they cannot fix the billing issue, and **Escalates** it to the office manager. Result: Only 5 minutes used. **85 minutes saved** for productive work.\n\n**Key Rules**\n*   **De-escalate first:** Use active listening to lower the temperature.\n*   **Don't take it personally:** It's about the work, not you.\n*   **Follow procedure:** Escalation is a formal step, not \"telling tales.\""
      }
    },
    {
      "id": "210-3B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Resolution",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-C2-L1-A",
            "questionText": "What is the primary goal of professional conflict resolution?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Mutually acceptable outcome",
              "A mutually acceptable outcome",
              "Allow work to continue",
              "Find a path forward"
            ],
            "hint": "It is not about 'winning'. It is about finding a solution that works for everyone."
          },
          {
            "id": "210-3B-C2-L1-B",
            "questionText": "Which communication technique involves repeating back what someone said to ensure you understood them?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Active listening",
              "Paraphrasing",
              "Active listening technique"
            ],
            "hint": "This technique requires full concentration and feedback."
          },
          {
            "id": "210-3B-C2-L1-C",
            "questionText": "What is the formal process of referring an unresolved issue to a higher authority?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Escalation",
              "Escalating",
              "Escalation procedure"
            ],
            "hint": "Think of the 'pressure relief valve' analogy."
          },
          {
            "id": "210-3B-C2-L2",
            "questionText": "Why is 'Escalation' considered a professional tool rather than a personal failure? Use the concept of 'authority' in your answer.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Some issues are beyond an operative's authority (e.g., contract changes, legal issues)",
              "Escalation follows a set procedure to get the issue to the person with the right authority",
              "It protects the operative and the company from making unauthorized decisions",
              "It prevents arguments by moving the decision-making to the correct level"
            ],
            "expectedAnswer": [
              "Escalation is a professional tool because it recognizes that some problems are outside an operative's authority to solve. By moving the issue to a manager who has the authority, the problem is handled correctly according to company procedure.",
              "It is not a failure; it is a procedure. Operatives have limited authority. When a problem exceeds that authority, escalation ensures it is resolved by someone with the power to make the decision."
            ],
            "hint": "Think about what an operative is allowed to decide versus what a manager is allowed to decide."
          }
        ]
      }
    },
    {
      "id": "210-3B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-3B-P1",
            "questionText": "A project is scheduled to take 40 hours. Due to a communication breakdown, it takes 50 hours. What is the percentage loss in efficiency? (Calculation: [Extra Hours / Planned Hours] x 100)",
            "answerType": "numeric",
            "expectedAnswer": [
              "25",
              "25%",
              "25.0"
            ],
            "hint": "Extra hours = 50 - 40. Divide the extra hours by the original 40."
          },
          {
            "id": "210-3B-P2",
            "questionText": "Why do we aim for a 'mutually acceptable outcome' instead of trying to win an argument?",
            "answerType": "short-text",
            "expectedAnswer": [
              "maintain productivity",
              "allow work to continue",
              "keep the project moving",
              "avoid delays"
            ],
            "hint": "Winning an argument might make you feel good, but what happens to the work if the other person refuses to cooperate?"
          },
          {
            "id": "210-3B-P3",
            "questionText": "You are arguing with a co-worker. You stop, look at them, and ask: 'So you think this method is unsafe?' What technique are you using?",
            "answerType": "short-text",
            "expectedAnswer": [
              "active listening",
              "active-listening",
              "paraphrasing"
            ],
            "hint": "You are actively checking your understanding of their point."
          },
          {
            "id": "210-3B-P4",
            "questionText": "An operative spends 90 minutes arguing with a customer. If they had used escalation after 10 minutes, how many minutes would they have saved?",
            "answerType": "numeric",
            "expectedAnswer": [
              "80"
            ],
            "hint": "Total time spent (90) minus the time spent before escalation (10)."
          },
          {
            "id": "210-3B-P5",
            "questionText": "A company delivers late three times in a row without telling the client. The client cancels the contract and writes a bad review. What specific 'intangible' asset has been damaged?",
            "answerType": "short-text",
            "expectedAnswer": [
              "reputation",
              "company reputation",
              "brand image",
              "good name"
            ],
            "hint": "It is the trust the industry has in the company."
          }
        ]
      }
    },
    {
      "id": "210-3B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-INT-1",
            "questionText": "Explain how a communication breakdown between a supervisor and an operative can lead to 'rework'. In your answer, describe the sequence of events from the instruction to the physical result.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Supervisor provides unclear or incorrect instruction (Breakdown)",
              "Operative performs the task based on this bad information",
              "The error is discovered after the work is done",
              "The work must be dismantled and done again (Rework)",
              "This wastes time and materials"
            ],
            "expectedAnswer": [
              "A breakdown happens if the supervisor gives vague instructions. The operative does the work based on this misunderstanding. When the error is found, the work has to be ripped out and done again, which is rework.",
              "First, the communication fails (e.g., wrong drawing). Second, the operative installs the item incorrectly. Third, the mistake is spotted. Finally, the item must be removed and re-installed, causing rework."
            ],
            "hint": "Trace the path: Bad info -> Wrong Action -> Discovery -> Correction."
          },
          {
            "id": "210-3B-INT-2",
            "questionText": "A customer is shouting about a delay that is not your fault. Describe the professional steps you would take to resolve this, using 'Active Listening' and 'Escalation'. Why is this better than arguing back?",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Step 1: Use Active Listening to understand the customer's frustration and de-escalate",
              "Step 2: Recognize the issue is not your fault or within your control",
              "Step 3: Use Escalation to refer the customer to a manager",
              "Reasoning: Arguing wastes time and damages reputation; this process solves the problem professionally"
            ],
            "expectedAnswer": [
              "First, I would use active listening to let the customer know I understand their frustration. Then, since I cannot fix the delay myself, I would escalate the issue to my manager. This is better than arguing because it calms the situation and gets the problem to someone who can actually solve it, protecting the company's reputation.",
              "I would listen actively to de-escalate the anger. Then I would explain that I need to bring in my supervisor to help them (Escalation). Arguing back would only waste time and might lose the client, whereas this method finds a solution."
            ],
            "hint": "First calm them down (listen), then move them to the right person (escalate)."
          }
        ]
      }
    },
    {
      "id": "210-3B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-3B-SR-1",
            "questionText": "Name one common method of written communication used on a site to record daily progress.",
            "expectedAnswer": [
              "Site diary",
              "Daily log",
              "Timesheet",
              "Job sheet"
            ],
            "hint": "A book or digital log where daily events are noted.",
            "answerType": "short-text"
          },
          {
            "id": "210-3B-SR-2",
            "questionText": "What type of document contains the mandatory safety rules for a specific site?",
            "expectedAnswer": [
              "Risk assessment",
              "Method statement",
              "Safety policy",
              "RAMS"
            ],
            "hint": "It tells you the risks and how to work safely.",
            "answerType": "short-text"
          },
          {
            "id": "210-3B-SR-3",
            "questionText": "If you have a barrier to communication (like loud noise), what is a simple way to overcome it?",
            "expectedAnswer": [
              "Move to a quiet area",
              "Use hand signals",
              "Write it down",
              "Stop the noise"
            ],
            "hint": "Think about how you would talk if you couldn't hear well.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check regarding communication methods (AC1/AC2) covered in previous lessons."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3",
    "AC4"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, SITUATIONAL_RESPONSE",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO3",
      "coveredAC": [
        "AC3",
        "AC4"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification of communication impacts (efficiency/reputation) and selection of corrective actions (active listening/escalation) for workplace conflict.",
      "outOfScope": "Formal legal mediation, disciplinary procedure documentation, and psychological theory of conflict.",
      "rationale": "Level 2 requirements focus on recognizing appropriate workplace behaviors and organizational consequences rather than administrative or legal management."
    },
    "teachingConstraints": {
      "excludeHowTo": false,
      "purposeOnly": false,
      "identificationOnly": true,
      "noCalculations": false,
      "specificScope": "Focus on the relationship dynamics between operatives, customers, and supervisors."
    },
    "misconceptions": [
      {
        "misconception": "Conflict resolution means one person wins the argument.",
        "correction": "The goal of conflict resolution is to reach a mutually acceptable outcome that allows work to continue productively.",
        "relatedAC": "210.LO3.AC3.3"
      },
      {
        "misconception": "Active listening is simply staying quiet while the other person speaks.",
        "correction": "Active listening requires conscious effort to provide feedback (paraphrasing) to ensure total understanding.",
        "relatedAC": "210.LO3.AC3.3"
      },
      {
        "misconception": "Escalation is the same as complaining about a co-worker.",
        "correction": "Escalation is a formal organisational procedure used to refer complex or unresolved issues to a higher level of authority.",
        "relatedAC": "210.LO3.AC3.3"
      }
    ]
  }
}