{
  "id": "210-3B",
  "title": "210.3B — Conflict Resolution and Communication Impact",
  "description": "Learn about Conflict Resolution and Communication Impact in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Conflict Resolution and Communication Impact",
  "learningOutcomes": [
    "Identify common effects of poor communication within a technical work environment",
    "Explain the consequences of communication failure between operatives, management, and customers",
    "Describe the appropriate actions to resolve conflicts between different workplace stakeholders"
  ],
  "prerequisites": [
    "210-3A"
  ],
  "blocks": [
    {
      "id": "210-3B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify common effects of poor communication within a technical work environment",
            "bloomLevel": "remember"
          },
          {
            "text": "Explain the consequences of communication failure between operatives, management, and customers",
            "bloomLevel": "understand"
          },
          {
            "text": "Describe the appropriate actions to resolve conflicts between different workplace stakeholders",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "210-3B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Communication Breakdown",
            "definition": "A failure to exchange information accurately, resulting in operational errors, misunderstandings, or damaged professional relationships."
          },
          {
            "term": "Stakeholder",
            "definition": "Any individual or group affected by a technical project or communication, including customers, management, and fellow operatives."
          },
          {
            "term": "Conflict Resolution",
            "definition": "The formal or informal process of finding a solution to a disagreement between parties to maintain a productive work environment."
          },
          {
            "term": "Active Listening",
            "definition": "A communication technique used to confirm understanding and reduce conflict by focusing entirely on the speaker’s message and providing feedback."
          },
          {
            "term": "Escalation",
            "definition": "The formal process of referring a conflict or technical issue to a higher level of management when it cannot be resolved at the current level."
          },
          {
            "term": "Mediation",
            "definition": "A resolution method where a neutral third party assists those in dispute to reach a mutual agreement, rather than imposing a decision on them."
          }
        ]
      }
    },
    {
      "id": "210-3B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Impacts of Communication Breakdown",
        "content": "### In this lesson\nThis lesson explores how failures in exchanging information impact technical work environments. You will learn to identify the consequences of poor messaging across different levels of an organisation.\n\n*   Identify common effects of poor communication on project outcomes.\n*   Explain the consequences of communication failure between different stakeholders.\n*   Recognise the signs of a breakdown before it leads to operational failure.\n\n**What this is**\nA **Communication Breakdown** occurs when information is not exchanged accurately, leading to errors or misunderstandings. In a technical environment, every **Stakeholder**—from the customer to the site manager—relies on precise data to perform their role safely and effectively. When this flow stops or becomes distorted, it creates a ripple effect throughout the entire organisation.\n\n**Why it matters**\nPoor communication is rarely just about a single missed email; it typically leads to physical rework, financial loss, and safety hazards. For a technical professional, maintaining clear channels ensures that everyone is working from the same set of facts, which protects the reputation of the individual and the company.\n\n**Key facts / rules**\n*   Poor communication between operatives often results in duplicated work or skipped safety checks.\n*   Failures between operatives and management typically lead to missed deadlines and incorrect resource allocation.\n*   Inaccurate communication from a company to a customer often results in a loss of trust and potential legal or financial disputes.\n*   A **Communication Breakdown** can be verbal, written, or even digital (such as using outdated versions of technical drawings).\n*   The severity of a breakdown often increases the longer it remains uncorrected.\n*   Effective communication is a core professional competency, not just a \"soft skill.\"\n\n**How to recognise it**\nTo recognise a **Communication Breakdown**, look for a disconnect between instructions and physical output. For example, if a supervisor requests a specific task and the operative performs a different one, the link has failed. You can also spot it in the atmosphere of a workplace; high levels of frustration or frequent \"I didn't know\" excuses are common indicators. \n\nConsider a relay race: if the first runner reaches the hand-off point but the second runner isn't looking, the baton drops. In the same way, if a technical report is sent but never acknowledged, the information has \"dropped,\" and the next phase of work is at risk. \n\n**Micro-scenario:** Compare two teams: Team A reports a 10% delay immediately, allowing management to reschedule. Team B stays silent about a 10% delay until the deadline passes. Team B has experienced a **Communication Breakdown** that will cause 100% more disruption than Team A’s proactive report.\n\n**Common mistakes**\nLearners often confuse a **Communication Breakdown** with a simple technical error; a technical error is a mistake in the work itself, whereas a **Communication Breakdown** is the failure in the information exchange that allowed that mistake to occur or go unnoticed.\n\nMisconceptions (targeted):\n*   Misconception: Communication only fails when people are arguing. | Correction: Silence or lack of feedback is often the most dangerous form of breakdown. | AC: AC3.3\n*   Misconception: Only the person speaking is responsible for the breakdown. | Correction: Communication is a two-way process; the receiver is equally responsible for confirming they understand. | AC: AC3.3\n\n**Key Points**\n*   Breakdowns lead to rework, safety risks, and wasted materials.\n*   Every **Stakeholder** is affected by poor information flow.\n*   Consequences range from minor delays to total project failure.\n*   Recognising signs early prevents small errors from becoming major conflicts.\n\n**Quick recap**\nPoor communication in a technical setting is more than a misunderstanding; it is a failure of the operational system. By identifying the signs of a **Communication Breakdown** early—such as conflicting instructions or a lack of feedback—operatives and management can prevent the cascading consequences that affect every **Stakeholder** involved in the project.\n\n### Coming Up Next\nWe will examine the specific actions and formal procedures used to resolve these issues when they escalate into workplace conflicts."
      }
    },
    {
      "id": "210-3B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Impacts of Communication Breakdown",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-C1-L1-A",
            "questionText": "What are two common results of poor communication between operatives?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "duplicated work or skipped safety checks",
              "duplicated work",
              "skipped safety checks",
              "work duplication or safety errors"
            ],
            "hint": "Think about what happens to physical tasks and safety protocols when information is missing."
          },
          {
            "id": "210-3B-C1-L1-B",
            "questionText": "What typically occurs when there is a communication failure between operatives and management?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "missed deadlines and incorrect resource allocation",
              "missed deadlines",
              "incorrect resource allocation",
              "scheduling and resource errors"
            ],
            "hint": "Consider the impact on project timing and the use of tools or staff."
          },
          {
            "id": "210-3B-C1-L1-C",
            "questionText": "How is a communication breakdown defined in contrast to a simple technical error?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "failure in the information exchange",
              "information exchange failure",
              "breakdown in information flow",
              "failed exchange of data"
            ],
            "hint": "A technical error is a mistake in the work itself, but a breakdown involves the flow of data."
          },
          {
            "id": "210-3B-C1-L2",
            "questionText": "Using your answers to Q1 (operative work), Q2 (management failures), and Q3 (information exchange), explain how these facts connect. Why must a professional identify the breakdown rather than just fixing the technical error?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Technical errors are often the physical result of a failure in information exchange",
              "Operative and management failures both stem from inaccurate data flow",
              "Fixing only the technical error ignores the root cause of duplicated work or missed deadlines",
              "Identifying the breakdown prevents the ripple effect across different stakeholders"
            ],
            "expectedAnswer": [
              "If you only fix the technical error without addressing the failure in information exchange, the communication breakdown will continue to cause duplicated work and missed deadlines. We must identify the breakdown to stop the ripple effect across the whole organisation.",
              "Technical errors are caused by the breakdown in information exchange between operatives and management. Because this breakdown leads to skipped safety checks and incorrect resource allocation, fixing the root cause is the only way to ensure project success."
            ],
            "hint": "Think about how the 'ripple effect' mentioned in the text links the source of the error to the physical outcome."
          }
        ]
      }
    },
    {
      "id": "210-3B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Conflict Resolution Actions",
        "content": "### In this lesson\nYou will learn the practical steps required to manage and resolve disagreements in the workplace. This involves choosing the right response based on the parties involved.\n\n*   Describe actions to resolve conflicts between customers and operatives.\n*   Identify the process for resolving disputes between co-workers and supervisors.\n*   Understand when to use **Escalation** or **Mediation** to settle a disagreement.\n\n**What this is**\n**Conflict Resolution** is the process of finding a solution to a disagreement to maintain a productive environment. It relies heavily on **Active Listening**, where you focus entirely on the other person's message to ensure you understand their perspective before responding. If a conflict cannot be settled locally, it may require **Escalation** to a higher authority or **Mediation** by a neutral third party.\n\n**Why it matters**\nUnresolved conflict creates a toxic work environment and slows down technical progress. By following a structured resolution process, you ensure that professional relationships remain intact and that the project continues to meet the needs of all **Stakeholders**.\n\n**Key facts / rules**\n*   **Active Listening** involves paraphrasing what the other person said to confirm your understanding.\n*   Conflicts with customers should be handled calmly, focusing on facts and agreed-upon service levels.\n*   Disagreements between co-workers are best resolved through direct, private discussion before involving management.\n*   **Escalation** is a formal procedure used when an issue is beyond an operative's authority or expertise.\n*   **Mediation** aims for a \"win-win\" outcome where both parties agree on the solution.\n*   Maintaining a professional tone is mandatory, regardless of the intensity of the disagreement.\n\n**How to do it**\nWhen a conflict arises, start with **Active Listening**. For example, if a customer is upset about a delay, say: \"I understand you are frustrated because the project is behind schedule; is that correct?\" This validates their concern without necessarily admitting fault. \n\nIf the conflict is between an operative and a supervisor, follow the chain of command. Attempt to resolve it one-on-one first. If no agreement is reached, move to **Escalation** by involving a senior manager. Think of **Conflict Resolution** like a pressure relief valve on a heating system: by addressing the \"pressure\" of the disagreement early through talk, you prevent a \"burst\" or total breakdown of the working relationship. \n\n**Micro-scenario:** An operative and a co-worker disagree on who should clean the site. If they ignore it, the site remains unsafe. If they use **Conflict Resolution** to split the task 50/50, the site becomes safe in 10 minutes. Compare the 10-minute fix to the hours of tension caused by ignoring the issue.\n\n**Common mistakes**\nLearners often confuse **Escalation** with \"tattling\"; **Escalation** is a professional tool for resolving complex issues, whereas \"tattling\" is an informal attempt to get someone in trouble.\n\nMisconceptions (targeted):\n*   Misconception: Resolution means winning the argument. | Correction: Resolution means finding a workable solution that allows the project to continue. | AC: AC3.4\n*   Misconception: You should always involve a manager immediately. | Correction: Most minor conflicts should be addressed directly between the parties involved first. | AC: AC3.4\n\n**Key Points**\n*   Use **Active Listening** as the first step in any resolution.\n*   Follow formal **Escalation** paths when local resolution fails.\n*   **Mediation** provides a neutral ground for difficult disputes.\n*   Professionalism must be maintained with all **Stakeholders**.\n\n**Quick recap**\nResolving conflict effectively requires a combination of empathy and procedure. By using **Active Listening** to understand the problem and applying the correct resolution actions—whether it is a direct talk, **Escalation**, or **Mediation**—you can ensure that workplace disagreements do not compromise technical standards or project timelines.\n\n### Coming Up Next\nIn the next module, we will look at how to document these interactions to ensure a permanent record of the agreed-upon solutions."
      }
    },
    {
      "id": "210-3B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Conflict Resolution Actions",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-C2-L1-A",
            "questionText": "What action does Active Listening require to confirm you understand the other person?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "paraphrasing what the other person said",
              "paraphrasing",
              "repeating back their message",
              "paraphrasing their words"
            ],
            "hint": "This involves summarizing the other person's points in your own words."
          },
          {
            "id": "210-3B-C2-L1-B",
            "questionText": "When is it appropriate to use a formal Escalation procedure?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "issue is beyond authority or expertise",
              "beyond an operative's authority",
              "beyond expertise",
              "outside their authority or knowledge"
            ],
            "hint": "Look for the boundary where an operative no longer has the power or knowledge to solve the problem."
          },
          {
            "id": "210-3B-C2-L1-C",
            "questionText": "What is the primary goal of the Mediation process?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "aims for a win-win outcome",
              "win-win outcome",
              "mutually agreed solution",
              "both parties agree on solution"
            ],
            "hint": "This process focuses on an outcome where both parties are satisfied."
          },
          {
            "id": "210-3B-C2-L2",
            "questionText": "Using your answers to Q1 (Active Listening), Q2 (Escalation), and Q3 (Mediation), explain how these facts connect. How do we know when to move from local discussion to a more formal resolution process?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Active Listening is the first step used to reach a local agreement",
              "If Active Listening fails to produce a win-win outcome, then more formal tools are needed",
              "Escalation is required specifically when the issue moves beyond the individual's authority",
              "Mediation and Escalation are secondary steps taken when direct communication cannot resolve the dispute"
            ],
            "expectedAnswer": [
              "We start with Active Listening to try and reach a win-win outcome through mediation or direct talk. If the issue is beyond our authority or expertise, we must then use the formal escalation procedure to move the conflict to a higher level.",
              "Active listening is the tool used for local resolution, but if a win-win outcome cannot be reached or the problem exceeds our authority, we know it is time to use escalation. These steps ensure that professional relationships are maintained through a structured process."
            ],
            "hint": "Consider the order of events, starting with the simplest communication tool and moving to formal procedures."
          }
        ]
      }
    },
    {
      "id": "210-3B-worked-example",
      "type": "worked-example",
      "order": 6,
      "content": {
        "title": "Worked Example: Identifying and Resolving a Peer-to-Peer Breakdown",
        "given": "An operative is observed using an outdated version of a technical drawing for a task. A co-worker notices the error before any physical work begins.",
        "steps": [
          {
            "stepNumber": 1,
            "description": "Identify context and constraints",
            "formula": null,
            "calculation": null,
            "result": "Digital communication breakdown between co-workers involving outdated technical data."
          },
          {
            "stepNumber": 2,
            "description": "Select appropriate option",
            "formula": null,
            "calculation": null,
            "result": "Initiate a direct, private discussion with the co-worker to correct the information."
          },
          {
            "stepNumber": 3,
            "description": "State purpose or result",
            "formula": null,
            "calculation": null,
            "result": "Prevents physical rework and safety hazards by ensuring both stakeholders work from the same facts."
          },
          {
            "stepNumber": 4,
            "description": "State common wrong choice and why",
            "formula": null,
            "calculation": null,
            "result": "Immediate escalation to management; minor conflicts should be addressed directly between the parties first."
          }
        ],
        "notes": "Always verify the current edition or version of technical drawings before starting work to avoid this specific breakdown."
      }
    },
    {
      "id": "210-3B-guided",
      "type": "guided-practice",
      "order": 7,
      "content": {
        "title": "Guided Practice (We Do)",
        "problem": "A customer is visibly angry because a project has been delayed by two days, and they were not informed by the site team. You need to address the situation professionally.",
        "steps": [
          {
            "stepNumber": 1,
            "prompt": "Identify the context and constraints of this situation.",
            "expectedAnswer": [
              "Communication breakdown between company and customer",
              "Stakeholder conflict"
            ],
            "hint": "Consider who is involved and what failure in information flow has occurred."
          },
          {
            "stepNumber": 2,
            "prompt": "Select the appropriate communication technique to begin the resolution process.",
            "expectedAnswer": [
              "Active Listening",
              "Paraphrasing"
            ],
            "hint": "Look for the technique that involves focusing entirely on the other person's message to confirm understanding."
          },
          {
            "stepNumber": 3,
            "prompt": "State the purpose or intended result of using this technique with the customer.",
            "expectedAnswer": [
              "Validates concerns and maintains trust",
              "Ensures professional reputation"
            ],
            "hint": "Think about how validating a concern affects the professional relationship."
          },
          {
            "stepNumber": 4,
            "prompt": "State a common wrong choice in this scenario and explain why it is incorrect.",
            "expectedAnswer": [
              "Silence or lack of feedback",
              "Ignoring the delay"
            ],
            "hint": "Recall which form of communication breakdown is described as most dangerous in the lesson."
          }
        ]
      }
    },
    {
      "id": "210-3B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-3B-P1",
            "questionText": "In the lesson scenario, Team A reports a delay immediately while Team B stays silent. If Team A's report results in 15 minutes of rescheduling work for management, how many minutes of disruption does Team B cause if their silence results in a 100% increase in disruption?",
            "answerType": "numeric",
            "expectedAnswer": [
              "30"
            ],
            "hint": "Calculate the original 15 minutes plus a 100% increase as described in the text."
          },
          {
            "id": "210-3B-P2",
            "questionText": "Explain why silence or a lack of feedback is often considered a more dangerous sign of a communication breakdown than an active argument.",
            "answerType": "short-text",
            "expectedAnswer": [
              "harder to recognize",
              "difficult to detect",
              "harder to spot",
              "remains uncorrected longer"
            ],
            "hint": "Think about how easy it is to notice when information is not moving compared to when people are vocal."
          },
          {
            "id": "210-3B-P3",
            "questionText": "A logistics coordinator fails to update a driver about a road closure, leading the driver to arrive at the wrong location. Which specific vocabulary term describes this failure to exchange accurate information?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Communication Breakdown",
              "communication breakdown"
            ],
            "hint": "This term refers to the failure of the information flow between stakeholders."
          },
          {
            "id": "210-3B-P4",
            "questionText": "Two workers disagree on a cleanup task. By using conflict resolution to split the work 50/50, they finish in 10 minutes. If they had failed to communicate and only one person ended up doing the work alone at the same speed, how many total minutes would the task have taken?",
            "answerType": "numeric",
            "expectedAnswer": [
              "20"
            ],
            "hint": "If two people working together take 10 minutes, calculate the time required for a single person to do all the work."
          },
          {
            "id": "210-3B-P5",
            "questionText": "According to the formal procedure for resolving disputes, what action should be taken if a direct, private discussion between co-workers fails to settle a conflict?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Escalation",
              "escalate",
              "formal escalation"
            ],
            "hint": "This involves moving the issue to a higher level of authority or management."
          }
        ]
      }
    },
    {
      "id": "210-3B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-3B-INT-1",
            "questionText": "Explain the relationship between the specific effects of a communication breakdown and the selection of a conflict resolution action. In your answer, include: (1) one common effect of poor communication on technical outcomes, (2) one specific resolution action such as escalation or mediation, and (3) the connection between the failure and the chosen response. Why must the resolution action be directly informed by the nature of the communication failure?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies a specific impact of communication breakdown on technical tasks (e.g., rework or delays).",
              "Identifies a relevant conflict resolution action appropriate for the context.",
              "Explains how the chosen action effectively addresses the specific failure identified.",
              "Provides reasoning for why matching the action to the failure prevents further operational risk.",
              "Demonstrates understanding of how stakeholder roles influence the choice of resolution."
            ],
            "expectedAnswer": [
              "A communication breakdown often leads to project delays, which requires a resolution action like escalation to management if deadlines are at risk. This relationship holds because management has the authority to reallocate resources to fix the delay, whereas peer mediation might not solve the resource issue. We know this is true because the resolution must address the root cause—the delay—to restore operational efficiency.",
              "Poor communication can cause safety errors between operatives, requiring immediate mediation to clarify technical procedures. The resolution must be informed by the failure because if the conflict is based on a technical misunderstanding, mediation allows for the correction of information. Choosing an incorrect action, like ignoring the issue, would allow the technical risk to persist and potentially lead to injury."
            ],
            "hint": "Think about how the severity of a project delay might require a different response than a personal disagreement between two co-workers."
          },
          {
            "id": "210-3B-INT-2",
            "questionText": "Synthesise the process of managing a communication breakdown to ensure project success across an organisation. In your answer, include: (1) the potential impacts on technical project outcomes, (2) the consequences for different stakeholders including management and customers, (3) the specific actions used to resolve resulting conflicts, and (4) how identifying early signs of breakdown prevents total operational failure. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Links communication failure to negative technical project outcomes like increased costs or failure to meet specifications.",
              "Explains the consequences for operatives (frustration/danger) and management (loss of oversight).",
              "Explains the consequences for customers (loss of trust/contractual penalties).",
              "Evaluates the use of escalation for high-risk or contractual disputes.",
              "Evaluates the use of mediation for internal stakeholder disagreements.",
              "Identifies early warning signs of communication breakdown such as missed updates or conflicting instructions.",
              "Describes how timely intervention maintains operational continuity and prevents total failure.",
              "Synthesises the relationship between stakeholder communication and overall technical delivery."
            ],
            "expectedAnswer": [
              "Communication breakdowns lead to technical errors and project delays, resulting in lost revenue for management and dissatisfaction for customers. By identifying early signs like conflicting instructions, operatives can use mediation to resolve peer disputes or escalation to involve management before operational failure occurs. This integrated approach ensures that conflict resolution actions directly mitigate the specific risks posed to project outcomes.",
              "• Poor communication results in technical rework and missed deadlines, which damages customer trust and increases management pressure on operatives.\n• Recognising signs like missed reporting allows for proactive mediation or escalation to settle disagreements before they halt production.\n• Implementing the correct resolution action ensures that all stakeholders are aligned, preventing the total operational failure that follows unaddressed communication breakdowns."
            ],
            "hint": "Consider the full journey from the first sign of a misunderstanding to the final impact on the customer and how specific actions stop that progression."
          }
        ]
      }
    },
    {
      "id": "210-3B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-3B-SR-1",
            "questionText": "What is the collective term for the different ways, such as verbal or written, that information is shared between people in a workplace?",
            "expectedAnswer": [
              "communication methods",
              "communication method",
              "communication"
            ],
            "hint": "Think about how you send or receive information on a job site.",
            "answerType": "short-text"
          },
          {
            "id": "210-3B-SR-2",
            "questionText": "Name one type of external person who may visit a work site to check on standards, progress, or safety.",
            "expectedAnswer": [
              "inspectors",
              "site visitors",
              "visitors",
              "customers"
            ],
            "hint": "Consider the different stakeholders who might monitor a technical environment.",
            "answerType": "short-text"
          },
          {
            "id": "210-3B-SR-3",
            "questionText": "What is the term for the formal written instructions and rules that a company uses to guide the behavior and actions of its staff?",
            "expectedAnswer": [
              "company policies",
              "workplace documentation",
              "policies",
              "procedures"
            ],
            "hint": "These documents ensure everyone follows the same standards and legislation.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Conflict Resolution and Communication Impact"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC3",
    "AC4"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PROCEDURE",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO3",
      "coveredAC": [
        "AC3",
        "AC4"
      ],
      "outOfScopeAC": [
        "AC1",
        "AC2",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "The identification of communication impacts and the procedural actions required to resolve interpersonal conflicts in a professional setting.",
      "outOfScope": "Legal employment dispute frameworks, disciplinary procedures, or technical reporting documentation.",
      "rationale": "Focuses on the immediate interpersonal and organisational dynamics of communication rather than formal HR or legal processes."
    },
    "teachingConstraints": {
      "excludeHowTo": false,
      "purposeOnly": false,
      "identificationOnly": false,
      "noCalculations": true,
      "specificScope": "Focus specifically on the impact on relationships and the immediate actions to mitigate conflict."
    },
    "misconceptions": [
      {
        "misconception": "Communication only fails when people are arguing.",
        "correction": "Silence or lack of feedback is often the most dangerous form of breakdown.",
        "relatedAC": "AC3.3"
      },
      {
        "misconception": "Resolution means winning the argument.",
        "correction": "Resolution means finding a workable solution that allows the project to continue.",
        "relatedAC": "AC3.4"
      },
      {
        "misconception": "Only the person speaking is responsible for the breakdown.",
        "correction": "Communication is a two-way process; the receiver is equally responsible for confirming they understand.",
        "relatedAC": "AC3.3"
      }
    ]
  }
}