{
  "id": "210-1B",
  "title": "210.1B — Construction Team Roles and Visitors",
  "description": "Learn about the key roles within a construction team, including site management, reporting lines, and the specific responsibilities of site visitors.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Construction team members and roles",
  "learningOutcomes": [
    "Identify key roles of the site management team including Site Managers and Contract Managers",
    "Identify key roles of individuals reporting to site management such as Supervisors and Quantity Surveyors",
    "Identify key roles of site visitors including Regulatory Inspectors and Client Representatives"
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify key roles of the site management team including Site Managers and Contract Managers",
            "bloomLevel": "remember"
          },
          {
            "text": "Identify key roles of individuals reporting to site management such as Supervisors and Quantity Surveyors",
            "bloomLevel": "understand"
          },
          {
            "text": "Identify key roles of site visitors including Regulatory Inspectors and Client Representatives",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Site Manager",
            "definition": "The person based on-site every day responsible for safety, logistics, and managing the workforce. Think of them as the 'Captain of the Ship' for that specific location."
          },
          {
            "term": "Contracts Manager",
            "definition": "A senior manager who oversees multiple projects and handles client contracts and budgets. Think of them as the 'Fleet Admiral' visiting ships occasionally."
          },
          {
            "term": "Clerk of Works",
            "definition": "An inspector employed by the client to ensure work quality matches the drawings. They are the 'Customer's Examiner' checking you got what you paid for."
          },
          {
            "term": "Quantity Surveyor (QS)",
            "definition": "The professional responsible for estimating costs, contracts, and payments. They are the 'Project Accountant' ensuring the money balances."
          },
          {
            "term": "Supervisor",
            "definition": "A team leader responsible for a specific trade or group (gang) of workers. They are the 'Sergeant' directing immediate tasks on the ground."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Site Management Team",
        "content": "### In this lesson\nWe will define the specific roles that run a construction project. You will learn to distinguish between the person running the site daily and the managers overseeing the business side.\n\n*   Identify the **Site Manager's** daily responsibilities.\n*   Understand the strategic role of the **Contracts Manager**.\n*   Recognize the financial role of the **Quantity Surveyor**.\n\n**What this is**\nThe site management team ensures the project is built safely, on time, and within budget. \n\n*   The **Site Manager** is the day-to-day boss. They are permanently based on site (e.g., in the site office) and control who enters, safety inductions, and work schedules.\n*   The **Contracts Manager** is above the Site Manager. They usually look after 3–4 different sites at once, dealing with the client and high-level budgets.\n*   The **Quantity Surveyor (QS)** manages the money. They measure completed work to calculate payments.\n\n**Why it matters**\nKnowing who is in charge prevents confusion. If you have a safety issue right now, you go to the Site Manager. If there is a dispute about payment terms in the contract, that is for the Contracts Manager or QS. Confusing these roles can lead to delays or unresolved safety hazards.\n\n**Key facts / rules**\n*   **Site Manager**: On-site daily. Responsible for Health & Safety (H&S) and logistics.\n*   **Contracts Manager**: Off-site mostly. Responsible for client relations and multiple project budgets.\n*   **Quantity Surveyor**: Responsible for costs, bills, and material quantities.\n\n**How to recognise it**\nImagine a project with a £5 million budget and 40 workers.\n*   The person unlocking the gate at 07:00 and conducting the morning safety briefing for the 40 workers is the **Site Manager**.\n*   The person arriving at 10:00 in a suit to discuss the monthly profit report and then leaving to visit another site is the **Contracts Manager**.\n*   The person measuring the length of installed pipework to approve an invoice is the **Quantity Surveyor**.\n\n**Common mistakes**\nLearners often confuse the **Site Manager** with the **Project Manager** or **Contracts Manager**. \n*   *Rule of thumb:* If they are there all day wearing full PPE and managing the daily chaos, it's the **Site Manager**. If they visit weekly to talk about money and timelines, it's the **Contracts Manager**.\n\nMisconceptions (targeted):\n*   Misconception: The Site Manager handles the payroll and client contracts. | Correction: The Site Manager handles operations; the Contracts Manager or QS handles the financial contracts. | AC: 210.LO1.AC1.1"
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Management Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "Which role is primarily based on-site every day and is responsible for daily safety and logistics?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Manager",
              "The Site Manager",
              "Site Agent"
            ],
            "hint": "Think of the person who unlocks the gates and runs the morning briefing."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Which manager typically oversees multiple projects at once and handles client contracts?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Contracts Manager",
              "Contract Manager",
              "The Contracts Manager"
            ],
            "hint": "This person visits the site occasionally and deals with the business side."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Which professional is responsible for estimating costs and measuring work for payment?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS",
              "The Quantity Surveyor"
            ],
            "hint": "Think of the 'Project Accountant' who deals with money and bills."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Explain the operational difference between a Site Manager and a Contracts Manager. Why is it necessary to have both roles on a large project?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Site Manager focuses on daily operations, safety, and workforce control on one specific site.",
              "Contracts Manager focuses on strategic, financial, and client aspects across multiple sites.",
              "Both are needed because one person cannot manage minute-by-minute site safety while also negotiating high-level contracts and budgets."
            ],
            "expectedAnswer": [
              "The Site Manager is based on-site to handle daily operations and safety, while the Contracts Manager oversees the financial and strategic aspects of multiple projects. We need both because the Site Manager ensures the work gets done safely today, while the Contracts Manager ensures the project remains profitable and meets the client's long-term needs.",
              "A Site Manager controls the daily workforce and hazards at one location, whereas a Contracts Manager handles the budget and client relationship for several sites. Separating these roles allows one to focus on immediate safety and quality, while the other focuses on the business and financial success of the company."
            ],
            "hint": "Consider the timeframe (daily vs. monthly) and location (on-site vs. multi-site) of their work."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Reporting Lines and Site Visitors",
        "content": "### In this lesson\nWe will look at the people who report to the management team and the external visitors who check the work. You will learn the difference between internal staff and external regulators.\n\n*   Identify the role of **Supervisors**.\n*   Distinguish between **Clerk of Works**, **Building Control**, and **HSE Inspectors**.\n\n**What this is**\nNot everyone on site is a manager. \n*   **Supervisors** (or Foremen) report to the Site Manager. They lead specific trade gangs (e.g., the electrical supervisor leads the electricians).\n*   **Site Visitors** come from outside. They can be statutory (legal) or non-statutory.\n    *   **HSE Inspector**: Government official enforcing safety law. Can stop work immediately.\n    *   **Building Control Officer (BCO)**: Local authority official ensuring the building meets regulations (e.g., fire exits, insulation).\n    *   **Clerk of Works**: Employed by the *Client* to check quality (e.g., \"Is the paint the right finish?\").\n\n**Why it matters**\nKnowing who reports to whom ensures clear communication. If you are an operative, you report to your Supervisor, who reports to the Site Manager. Knowing your visitors is also critical: an HSE Inspector has legal power to prosecute, whereas a Clerk of Works focuses on quality control for the client.\n\n**Key facts / rules**\n*   **Supervisor**: leads a team, reports to Site Manager.\n*   **HSE Inspector**: Enforces Health & Safety at Work Act. **Statutory** (Legal).\n*   **Building Control**: Enforces Building Regulations. **Statutory** (Legal).\n*   **Clerk of Works**: Inspects quality for the client. **Non-Statutory** (Contractual).\n\n**How to recognise it**\n*   **Scenario 1:** A person wearing a high-vis vest marked \"Electrical Foreman\" is instructing 3 electricians on where to pull cables. This is a **Supervisor**.\n*   **Scenario 2:** A visitor arrives and demands to see the accident log book and risk assessments. They are likely an **HSE Inspector**.\n*   **Scenario 3:** A visitor measures the depth of the foundations to ensure they match the approved plans. They are likely a **Building Control Officer**.\n\n**Common mistakes**\nConfusing **Building Control** with **Clerk of Works**. \n*   **Building Control** cares about *Regulations* (Is it legal?).\n*   **Clerk of Works** cares about *Quality* (Is it what the client bought?).\n\nMisconceptions (targeted):\n*   Misconception: A Clerk of Works can arrest you for safety violations. | Correction: No, only HSE Inspectors have government enforcement powers; Clerk of Works reports quality issues to the client. | AC: 210.LO1.AC1.3"
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Reporting and Visitors",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Who does an operative or tradesperson typically report to directly on a daily basis?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Supervisor",
              "Their Supervisor",
              "Foreman",
              "Ganger"
            ],
            "hint": "This is the team leader responsible for a specific trade group."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Which visitor is a government official with the legal power to stop work if safety laws are broken?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "HSE Inspector",
              "Health and Safety Executive Inspector",
              "HSE"
            ],
            "hint": "They enforce the Health & Safety at Work Act."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "Which visitor represents the Local Authority and checks that the physical structure meets building codes?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Building Control Officer",
              "Building Control",
              "BCO"
            ],
            "hint": "They ensure compliance with Building Regulations (e.g., foundations, insulation)."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Distinguish between the roles of a Clerk of Works and a Building Control Officer. Who do they represent and what is their primary focus?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Clerk of Works represents the Client; focuses on quality and workmanship.",
              "Building Control Officer represents the Local Authority; focuses on legal compliance with regulations.",
              "One checks you got what you paid for (Quality), the other checks it is legal (Safety/Regs)."
            ],
            "expectedAnswer": [
              "A Clerk of Works is employed by the client to check the quality of work and ensure it matches the contract specifications. A Building Control Officer represents the local authority and checks that the building complies with national building regulations. The main difference is that the Clerk looks for quality for the owner, while Building Control looks for legality for the government.",
              "The Clerk of Works focuses on quality and workmanship on behalf of the client. The Building Control Officer focuses on compliance with the law (Building Regulations) on behalf of the local council. Only the Building Control Officer is enforcing statutory law."
            ],
            "hint": "Think: One works for the person paying the bills (Client), the other works for the Council (Law)."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A visitor arrives on site to check that the brickwork matches the high-quality finish specified by the client. This person is not from the council. What role are they performing?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Clerk of Works",
              "The Clerk of Works"
            ],
            "hint": "Client representative focused on quality."
          },
          {
            "id": "210-1B-P2",
            "questionText": "You are working on site and need to report a minor injury. Who is the first person in your reporting line you should inform?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Supervisor",
              "The Supervisor",
              "Foreman"
            ],
            "hint": "Your immediate team leader."
          },
          {
            "id": "210-1B-P3",
            "questionText": "On a large site with 4 different trade gangs, how many Site Managers are typically responsible for the overall daily safety and logistics of that specific site?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1"
            ],
            "hint": "There is usually one main 'Captain' for the site."
          },
          {
            "id": "210-1B-P4",
            "questionText": "Who is responsible for measuring the amount of material installed to calculate the monthly payment application?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS"
            ],
            "hint": "The financial manager for the project."
          },
          {
            "id": "210-1B-P5",
            "questionText": "An official stops the job because the scaffolding is dangerous and violates the Health & Safety at Work Act. Who is this?",
            "answerType": "short-text",
            "expectedAnswer": [
              "HSE Inspector",
              "Health and Safety Executive"
            ],
            "hint": "Government safety enforcer."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Scenario: A serious accident has occurred on site. Explain the roles of the Supervisor, Site Manager, and HSE Inspector in this situation. Who reports it, who manages the immediate scene, and who investigates for legal compliance?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Supervisor reports the accident immediately to the Site Manager.",
              "Site Manager secures the scene, manages the emergency response, and records the incident.",
              "HSE Inspector investigates the accident to determine if laws were broken and may issue enforcement notices."
            ],
            "expectedAnswer": [
              "In this scenario, the Supervisor's role is to immediately report the accident to the Site Manager and ensure their team is safe. The Site Manager is responsible for securing the scene, managing the emergency response, and ensuring the incident is formally recorded. The HSE Inspector will then investigate the accident to determine if health and safety laws were broken and has the power to prosecute if negligence is found.",
              "The Supervisor alerts the Site Manager. The Site Manager takes control of the site, stops work if necessary, and preserves the scene. The HSE Inspector is the external authority who investigates the cause to check for legal non-compliance and can issue fines or stop notices."
            ],
            "hint": "Trace the flow from the accident happening (Supervisor) to site control (Manager) to legal investigation (HSE)."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Compare the roles of the Contracts Manager and the Site Manager regarding a project running over budget and behind schedule. Who deals with the client's financial penalty clauses, and who deals with reorganizing the daily work to catch up? Why is this division of labor important?",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Contracts Manager handles the client, financial penalties, and contract renegotiation.",
              "Site Manager handles the physical reorganization of work, overtime, and logistics on the ground.",
              "Division is important so the Site Manager can focus on safety/production without being distracted by high-level financial disputes."
            ],
            "expectedAnswer": [
              "The Contracts Manager deals with the client regarding financial penalty clauses and budget overruns, as they handle the business contract. The Site Manager deals with reorganizing the daily work, such as scheduling overtime or re-sequencing trades, to catch up on progress. This division is important because it allows the Site Manager to focus on the immediate safety and logistics of the build, while the Contracts Manager protects the company's commercial interests.",
              "The Contracts Manager handles the money and the client dispute. The Site Manager handles the workers and the schedule on the ground. This separation ensures that financial pressure doesn't compromise daily site safety and supervision."
            ],
            "hint": "One looks at the contract (paperwork/money), the other looks at the site (people/time)."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Lesson Retention Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "Which role is primarily responsible for the daily coordination and safety management of a construction site?",
            "expectedAnswer": [
              "Site Manager",
              "Site Agent"
            ],
            "hint": "The 'Captain' of the site.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "What type of visitor is an HSE Inspector: Statutory or Non-Statutory?",
            "expectedAnswer": [
              "Statutory"
            ],
            "hint": "Do they have legal powers? Yes.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "Who does the Supervisor typically report to?",
            "expectedAnswer": [
              "Site Manager",
              "The Site Manager"
            ],
            "hint": "The person in charge of the site office.",
            "answerType": "short-text"
          }
        ],
        "notes": "Review of Construction Team Roles to ensure retention before next topic."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2",
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1",
        "AC2",
        "AC3"
      ],
      "outOfScopeAC": [
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification of site management roles, reporting lines, and visitor types.",
      "outOfScope": "Detailed contract law, specific clauses of the Health & Safety at Work Act, or payroll procedures.",
      "rationale": "Level 2 learners need to understand the chain of command and visitor authority for effective communication."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on roles and responsibilities"
    },
    "misconceptions": [
      {
        "misconception": "The Site Manager handles the payroll and client contracts.",
        "correction": "The Site Manager handles operations; the Contracts Manager or QS handles the financial contracts.",
        "relatedAC": "AC1"
      },
      {
        "misconception": "A Clerk of Works can arrest you for safety violations.",
        "correction": "No, only HSE Inspectors have government enforcement powers; Clerk of Works reports quality issues to the client.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "Building Control and Clerk of Works are the same.",
        "correction": "Building Control checks for Legal Compliance (Regs); Clerk of Works checks for Quality (Client satisfaction).",
        "relatedAC": "AC3"
      }
    ]
  }
}