{
  "id": "210-1B",
  "title": "210.1B — Site Management and Reporting Roles",
  "description": "Learn about the key roles in a construction site management team and the individuals who report to them.",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Construction team members and roles",
  "learningOutcomes": [
    "Identify key roles of the site management team including Contracts Manager, Project Manager, and Site Manager.",
    "Identify key roles of individuals reporting to site management such as Quantity Surveyors and Buyers.",
    "Differentiate between strategic management roles and operational supervisory roles."
  ],
  "prerequisites": [
    "210-1A"
  ],
  "blocks": [
    {
      "id": "210-1B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify key roles of the site management team including Contracts Manager, Project Manager, and Site Manager.",
            "bloomLevel": "remember"
          },
          {
            "text": "Identify key roles of individuals reporting to site management such as Quantity Surveyors and Buyers.",
            "bloomLevel": "remember"
          },
          {
            "text": "Differentiate between strategic management roles and operational supervisory roles.",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "210-1B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Contracts Manager",
            "definition": "A senior manager responsible for overseeing multiple projects and ensuring client contracts are fulfilled, typically based in the head office."
          },
          {
            "term": "Project Manager (PM)",
            "definition": "The person responsible for the overall success of a specific project, managing the budget, schedule, and client communication."
          },
          {
            "term": "Site Manager",
            "definition": "The person responsible for the day-to-day operations on site, including logistics, health and safety, and opening/closing the site."
          },
          {
            "term": "Quantity Surveyor (QS)",
            "definition": "A financial professional who manages project costs, contracts, and payments to ensure the project stays within budget."
          },
          {
            "term": "Site Supervisor",
            "definition": "A role that directly oversees the work of operatives and tradespeople to ensure quality and progress on a daily basis."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "The Site Management Team (AC1)",
        "content": "### In this lesson\nYou will learn the hierarchy of a construction site, from the managers who plan the work to the supervisors who make sure it gets done. \n\n*   Understand the difference between a **Contracts Manager** and a **Project Manager**.\n*   Identify the responsibilities of a **Site Manager** versus a **Supervisor**.\n*   Recognize the chain of command used to solve problems on site.\n\n**What this is**\nConstruction sites run on a strict hierarchy, similar to a ship or a sports team. \n\n1.  **Contracts Manager**: The 'Admiral'. They oversee **multiple** projects at once (often 3-5) and handle the main contract with the client. They are usually based in the head office but visit sites regularly.\n2.  **Project Manager (PM)**: The 'Captain'. They lead **one** specific large project. Their focus is strategic: the budget, the master schedule, and major client meetings.\n3.  **Site Manager**: The 'First Mate'. They run the ship day-to-day. They are on site all the time, managing logistics, site safety, deliveries, and ensuring the PM's plan is followed.\n4.  **Supervisor / Foreman**: The 'Bosun'. They directly supervise the crew. They check the quality of work, give daily instructions to tradespeople, and ensure workers are wearing PPE.\n\n**Why it matters**\nKnowing who does what ensures you report issues to the right person. If you need a day off, you ask your **Supervisor**. If there is a major design flaw costing thousands of pounds, the **Project Manager** needs to know. If the entire project is delayed by a month, the **Contracts Manager** handles the legal implications with the client.\n\n**Key facts / rules**\n*   **Contracts Managers** look after the company's business interests across several sites.\n*   **Project Managers** own the budget and schedule for one site.\n*   **Site Managers** own the daily logistics and safety for one site.\n*   **Supervisors** own the quality and productivity of the workforce.\n*   **Rule of thumb**: A Supervisor typically looks after a team of **10 to 15** operatives.\n\n**Micro-scenario**\nA storm blows down the site fencing on a Tuesday night. \n*   The **Site Manager** arrives first to organize a repair crew and secure the site (Operational).\n*   The **Project Manager** adjusts the schedule because deliveries can't enter (Strategic).\n*   If the storm damage triggers an insurance claim, the **Contracts Manager** might step in (Commercial).\n\n**Common mistakes**\nLearners often confuse the **Project Manager** with the **Site Manager**. Remember: The PM worries about the *money and time* (Strategic), while the Site Manager worries about the *men and materials* (Operational).\n\nMisconceptions (targeted):\n* Misconception: The Site Manager and Project Manager are the same role. | Correction: The PM manages the project's budget and schedule; the Site Manager manages the daily physical site operations. | AC: AC1\n* Misconception: You should always go straight to the Project Manager with a problem. | Correction: You should follow the chain of command; usually, you report to your Supervisor first. | AC: AC1"
      }
    },
    {
      "id": "210-1B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Site Management",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C1-L1-A",
            "questionText": "Which management role is responsible for overseeing multiple projects at the same time?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Contracts Manager",
              "Contract Manager"
            ],
            "hint": "This person is usually based in the head office and handles the legal contracts with clients."
          },
          {
            "id": "210-1B-C1-L1-B",
            "questionText": "Who is responsible for the day-to-day operations, logistics, and safety on a specific site?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Manager",
              "Site Agent"
            ],
            "hint": "This person ensures the site opens on time and deliveries are managed safely."
          },
          {
            "id": "210-1B-C1-L1-C",
            "questionText": "Which role involves directly supervising the quality of work produced by tradespeople?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Supervisor",
              "Foreman",
              "Site Supervisor"
            ],
            "hint": "This person gives daily instructions to the workers."
          },
          {
            "id": "210-1B-C1-L2",
            "questionText": "Using your answers to Q1 (Multi-project), Q2 (Daily Ops), and Q3 (Direct Supervision), explain the 'Chain of Command' for a carpenter who needs to report a delay. Who do they tell first, and who would eventually handle it if it impacts the project completion date?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The carpenter should first report to their direct Supervisor.",
              "The Supervisor informs the Site Manager if it affects daily workflow.",
              "The Site Manager informs the Project Manager if it impacts the overall schedule or budget.",
              "The chain of command filters information so senior managers deal with strategic issues while supervisors deal with task issues."
            ],
            "expectedAnswer": [
              "The carpenter should first tell their Supervisor, who is responsible for their direct work. If the delay is serious, the Supervisor tells the Site Manager. If the delay threatens the final completion date, the Site Manager informs the Project Manager, who manages the overall schedule.",
              "The carpenter reports to the Supervisor first. The issue travels up the chain to the Site Manager for logistics, and finally to the Project Manager if it affects the project deadline."
            ],
            "hint": "Think about solving the problem at the lowest possible level before escalating it."
          }
        ]
      }
    },
    {
      "id": "210-1B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Roles Reporting to Site Management (AC2)",
        "content": "### In this lesson\nYou will learn about the specialized roles that support the management team. These individuals do not usually supervise construction workers directly but provide essential services like finance, purchasing, and administration.\n\n*   Describe the role of a **Quantity Surveyor (QS)**.\n*   Understand the function of a **Buyer**.\n*   Identify the responsibilities of a **Site Administrator**.\n\n**What this is**\nWhile the Site Manager runs the physical site, they need a team to handle the money, materials, and paperwork.\n\n1.  **Quantity Surveyor (QS)**: The 'Accountant'. They calculate the cost of materials and labor. They track changes (variations) to the design and ensure subcontractors get paid for the work they have done.\n2.  **Buyer**: The 'Shopper'. They negotiate with suppliers to buy materials (bricks, cables, steel) at the best price and ensure they arrive on time. They work closely with the Site Manager to know *what* is needed and *when*.\n3.  **Site Administrator**: The 'Organizer'. They handle the paperwork, such as filing timesheets, recording site inductions, and managing incoming mail. They ensure the site office runs smoothly.\n4.  **Health & Safety Officer**: The 'Advisor'. Unlike an external HSE inspector, this is an internal employee who advises the Site Manager on safety laws, helps write risk assessments, and conducts internal safety audits.\n\n**Why it matters**\nConstruction is expensive and dangerous. Without a **QS**, the project would run out of money. Without a **Buyer**, there would be no materials to build with. Without an **Administrator**, important legal records would be lost. \n\n**Key facts / rules**\n*   The **QS** focuses on **value** and **contracts**.\n*   The **Buyer** focuses on **supply chain** and **delivery dates**.\n*   The **Administrator** focuses on **records** and **office management**.\n*   These roles report to the Project Manager or Site Manager but do not typically give orders to tradespeople.\n\n**Micro-scenario**\nThe project needs 500 meters of heavy-duty cable.\n1.  The **Site Manager** confirms the specification.\n2.  The **Buyer** finds a supplier and places the order.\n3.  The **Quantity Surveyor** records the cost against the budget.\n4.  When it arrives, the **Administrator** files the delivery note.\n\n**Common mistakes**\nLearners often confuse the **Quantity Surveyor** with the **Buyer**. Remember: The Buyer *orders* the goods; the QS *counts the cost* and manages the budget.\n\nMisconceptions (targeted):\n* Misconception: The Quantity Surveyor checks the quality of the installation. | Correction: The QS checks the *cost* and *quantity* of work for payment; the Supervisor checks the *quality*. | AC: AC2\n* Misconception: The Buyer decides what materials to use. | Correction: The specification determines the materials; the Buyer just locates and purchases them. | AC: AC2"
      }
    },
    {
      "id": "210-1B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Reporting Roles",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-C2-L1-A",
            "questionText": "Which role is primarily responsible for managing project costs, valuations, and subcontractor payments?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS",
              "The Quantity Surveyor"
            ],
            "hint": "This person acts like the accountant for the project."
          },
          {
            "id": "210-1B-C2-L1-B",
            "questionText": "Who is responsible for negotiating with suppliers and ordering materials like bricks and cables?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Buyer",
              "The Buyer",
              "Materials Buyer"
            ],
            "hint": "This person ensures the physical materials arrive on site when needed."
          },
          {
            "id": "210-1B-C2-L1-C",
            "questionText": "Which support role handles site paperwork, timesheets, and induction records?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Site Administrator",
              "Administrator",
              "Site Clerk",
              "Admin"
            ],
            "hint": "This person keeps the site office organized."
          },
          {
            "id": "210-1B-C2-L2",
            "questionText": "Using your answers to Q1 (Cost), Q2 (Ordering), and Q3 (Records), explain how these three roles support the Site Manager when a new load of materials arrives.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The Buyer ensures the materials were ordered and arrive on schedule.",
              "The Site Administrator files the delivery notes and updates records.",
              "The Quantity Surveyor records the cost to ensure it matches the budget.",
              "The Site Manager relies on them to handle the logistics/finance so they can focus on installation."
            ],
            "expectedAnswer": [
              "The Buyer ensures the correct materials arrive on time. The Site Administrator files the delivery paperwork for the Site Manager. The Quantity Surveyor records the cost of the delivery to keep the budget updated.",
              "The Site Manager doesn't have to do everything: the Buyer handles the supply, the Admin handles the filing, and the QS handles the payment, allowing the Manager to focus on the work."
            ],
            "hint": "Think about the journey of a brick: someone bought it, someone filed the receipt, and someone counted the cost."
          }
        ]
      }
    },
    {
      "id": "210-1B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-1B-P1",
            "questionText": "A large site has 45 operatives working on it. Based on the rule of thumb provided in the lesson (1 Supervisor per 15 operatives), what is the minimum number of Supervisors recommended for this workforce?",
            "answerType": "numeric",
            "expectedAnswer": [
              "3"
            ],
            "hint": "Divide the total number of operatives by the maximum number of operatives one supervisor typically manages (15)."
          },
          {
            "id": "210-1B-P2",
            "questionText": "A Contracts Manager is overseeing the maximum number of projects mentioned in the lesson examples (5). If each project has exactly one Project Manager, how many Project Managers report to this Contracts Manager?",
            "answerType": "numeric",
            "expectedAnswer": [
              "5"
            ],
            "hint": "Refer to the micro-scenario in the first explanation about the Contracts Manager's workload."
          },
          {
            "id": "210-1B-P3",
            "questionText": "You are a Site Manager. You notice a delivery of copper pipe has arrived, but it looks like less than what was ordered. Who should you contact first to check the original order quantity?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Buyer",
              "The Buyer"
            ],
            "hint": "This person is responsible for placing orders with suppliers."
          },
          {
            "id": "210-1B-P4",
            "questionText": "Who is the most senior person permanently based on a single large construction site?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Project Manager",
              "PM"
            ],
            "hint": "The Contracts Manager visits, but this person is the 'Captain' of the specific project."
          },
          {
            "id": "210-1B-P5",
            "questionText": "If a subcontractor claims they have not been paid for last month's work, which role in the site team investigates this financial issue?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Quantity Surveyor",
              "QS"
            ],
            "hint": "This role deals with valuations, contracts, and payments."
          }
        ]
      }
    },
    {
      "id": "210-1B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-1B-INT-1",
            "questionText": "Explain the difference between the roles of the Project Manager and the Site Manager. In your answer, include: (1) the primary focus of each role (strategic vs operational), (2) their typical location/presence, and (3) an example of a decision each might make. Why is it important not to confuse these two roles? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Project Manager focuses on strategy, budget, and schedule (The Captain).",
              "Site Manager focuses on daily logistics, safety, and execution (The First Mate).",
              "PM is often office-based or hybrid; Site Manager is always on site.",
              "Example: PM decides the completion date; Site Manager decides where to stack bricks.",
              "Confusing them leads to reporting operational issues to the wrong person."
            ],
            "expectedAnswer": [
              "The Project Manager focuses on the strategic aspects like budget and overall schedule, while the Site Manager handles daily operational tasks such as logistics and safety. For example, a PM might negotiate the final deadline with the client, whereas a Site Manager would organize the daily work rota for the tradespeople. It is important to distinguish them so that day-to-day problems are solved quickly on site without distracting the PM from the bigger commercial picture.",
              "A Project Manager is responsible for the 'big picture' of time and money, often splitting time between site and office, while the Site Manager is permanently on site running daily operations. A PM decides 'what' gets built and 'when', while the Site Manager decides 'how' the site functions safely each day. Confusing them can cause delays, as operational issues should be resolved by the Site Manager first."
            ],
            "hint": "Think of the Project Manager as the one looking at the calendar and bank account, and the Site Manager as the one looking at the workers and trucks."
          },
          {
            "id": "210-1B-INT-2",
            "questionText": "Synthesize how the support roles (QS, Buyer, Admin) enable the management team to function effectively. In your answer, include: (1) one specific task for each of the three support roles, (2) how each task removes a burden from the Site Manager, and (3) the risk to the project if these roles were missing. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "QS handles finances/payments, freeing the Manager from accounting.",
              "Buyer handles material sourcing, freeing the Manager from shopping.",
              "Admin handles paperwork, freeing the Manager from filing.",
              "Without them, the Site Manager would be overwhelmed and site safety/progress would suffer.",
              "Risk: Budget overspend, material shortages, lost legal records."
            ],
            "expectedAnswer": [
              "The Quantity Surveyor manages costs and payments, the Buyer sources materials, and the Administrator handles records like timesheets. These roles allow the Site Manager to focus purely on construction progress and safety rather than finance or procurement. If these roles were missing, the Site Manager would be overwhelmed with paperwork, leading to material shortages, budget overruns, and potential safety lapses. Answer in 3-4 sentences OR concise bullet points.",
              "• The QS handles valuations, preventing the Manager from needing to do complex accounting.\n• The Buyer negotiates material delivery, ensuring the Manager has tools to work with.\n• The Administrator organizes files, keeping the site legally compliant with records.\n• Without this support, the project risks financial failure and logistical chaos. Answer in 3-4 sentences OR concise bullet points."
            ],
            "hint": "Imagine if the Site Manager had to do the accounting, the shopping, and the filing while also supervising the building work."
          }
        ]
      }
    },
    {
      "id": "210-1B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-1B-SR-1",
            "questionText": "What is the general term for the line of authority that moves from the top manager down to the newest worker?",
            "expectedAnswer": [
              "Chain of command",
              "Hierarchy",
              "Line of command"
            ],
            "hint": "It ensures everyone knows who they report to.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-2",
            "questionText": "In a formal email, who is the 'recipient'?",
            "expectedAnswer": [
              "The person receiving it",
              "The receiver",
              "Person getting the email"
            ],
            "hint": "Think back to communication methods: sender vs recipient.",
            "answerType": "short-text"
          },
          {
            "id": "210-1B-SR-3",
            "questionText": "What type of information includes technical drawings and specifications?",
            "expectedAnswer": [
              "Technical information",
              "Design information",
              "Project specifications"
            ],
            "hint": "This is distinct from general administrative information.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check regarding communication structures before learning specific roles."
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2"
  ],
  "metadata": {
    "created": "2026-02-16",
    "updated": "2026-02-16",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, DIFFERENTIATION",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO1",
      "coveredAC": [
        "AC1",
        "AC2"
      ],
      "outOfScopeAC": [
        "AC3",
        "AC4"
      ]
    },
    "scope": {
      "inScope": "Roles and responsibilities of the internal site management team (Contracts Manager, PM, Site Manager, Supervisor) and reporting roles (QS, Buyer, Admin).",
      "outOfScope": "External visitors, statutory inspectors (AC3), and specific trade skills.",
      "rationale": "Learners must understand the internal hierarchy and reporting lines before studying external regulatory interactions."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": false,
      "specificScope": "Key management and support roles only."
    },
    "misconceptions": [
      {
        "misconception": "The Site Manager and Project Manager are the same role.",
        "correction": "The PM manages the project's budget and schedule; the Site Manager manages the daily physical site operations.",
        "relatedAC": "AC1"
      },
      {
        "misconception": "The Quantity Surveyor checks the quality of the installation.",
        "correction": "The QS checks the cost and quantity of work for payment; the Supervisor checks the quality.",
        "relatedAC": "AC2"
      },
      {
        "misconception": "You should always go straight to the Project Manager with a problem.",
        "correction": "You should follow the chain of command; usually, you report to your Supervisor first.",
        "relatedAC": "AC1"
      }
    ]
  }
}