{
  "id": "210-2A",
  "title": "210.2A — Legislation, Guidance and Customer Information",
  "description": "Learn about Statutory Legislation, Guidance Notes, and Customer Documentation in Communication 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 210",
  "topic": "Legislation and Workplace Documentation",
  "learningOutcomes": [
    "Identify the primary types of statutory legislation and regulations applicable to the workplace environment.",
    "Distinguish between mandatory statutory requirements, guidance notes, and British Standards.",
    "Explain the purpose of customer information (quotations, estimates, invoices) and manufacturer guidance."
  ],
  "prerequisites": [
    "210-1B"
  ],
  "blocks": [
    {
      "id": "210-2A-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify the primary types of statutory legislation and regulations applicable to the workplace environment.",
            "bloomLevel": "remember"
          },
          {
            "text": "Distinguish between mandatory statutory requirements, guidance notes, and British Standards.",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain the purpose of customer information (quotations, estimates, invoices) and manufacturer guidance.",
            "bloomLevel": "understand"
          }
        ]
      }
    },
    {
      "id": "210-2A-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Statutory Legislation",
            "definition": "Formal laws passed by Parliament that are legally binding (e.g., Health and Safety at Work Act). Like the 'Highway Code' rules you must follow."
          },
          {
            "term": "Regulations",
            "definition": "Specific compulsory rules derived from an Act that detail exactly what must be done (e.g., Electricity at Work Regulations)."
          },
          {
            "term": "Guidance Notes",
            "definition": "Practical books (e.g., IET Guidance Notes) that explain how to apply British Standards technically. They are not law but define best practice."
          },
          {
            "term": "Quotation",
            "definition": "A formal document offering to do work for a fixed price. Once accepted, this price cannot be changed without a new agreement."
          },
          {
            "term": "Estimate",
            "definition": "An approximate calculation of cost used when the exact extent of work is unknown. The final price may change."
          },
          {
            "term": "Approved Code of Practice (ACOP)",
            "definition": "A document with special legal status; following it proves you have complied with the law. Ignoring it puts the burden of proof on you."
          }
        ]
      }
    },
    {
      "id": "210-2A-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Hierarchy of Information",
        "description": "Visual representation of the hierarchy from Law to Customer Info",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "statutory-law",
          "regulations",
          "british-standards-guidance",
          "manufacturer-instructions",
          "customer-documents"
        ],
        "placeholderText": "A pyramid diagram. Top (Red): 'Statutory Law & Regulations' (Mandatory). Middle (Amber): 'British Standards & Guidance Notes' (Best Practice). Bottom (Green): 'Manufacturer Instructions' (Product Specific) and 'Customer Documents' (Commercial). Arrows show that lower levels help achieve the safety required by the top levels."
      }
    },
    {
      "id": "210-2A-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Statutory Legislation and Regulations",
        "content": "### In this lesson\nEvery job in the building services industry is governed by rules. Some are absolute laws you must follow, while others are technical guides. In this section, we focus on the **mandatory** laws.\n\n**What this is**\n**Statutory Legislation** (Acts of Parliament) acts as the supreme law of the land. \n*   **Analogy:** Think of Statutory Legislation like the **Highway Code**. It contains the rules of the road (like \"Stop at a red light\") that everyone *must* obey. If you break them, you face fines or prison.\n\nBeneath the Acts are **Regulations**. These are specific detailed rules created under an Act.\n*   **Analogy:** If the Act says \"Drive Safely,\" the Regulations say \"Do not exceed 30mph in this zone.\" They give the specific details you need to comply with the Act.\n\n**Why it matters**\nCompliance is not optional. The **Health and Safety at Work Act (HSWA)** is the primary Act protecting us. The **Electricity at Work Regulations (EAWR)** are the specific rules for electricians. Breaking these is a criminal offense.\n\n**Key facts**\n*   **Statutory = Mandatory.** You have no choice.\n*   **Act of Parliament:** The broad legal framework (e.g., HSWA).\n*   **Regulation:** The specific 'must-do' rules (e.g., EAWR, PPE Regulations).\n*   **Scope:** These laws cover safety, data protection (GDPR), and equality.\n\n**When to choose it**\nYou consult Statutory documents when you need to know the **legal minimum**. If you are unsure if you *must* wear a hard hat, you look at the PPE Regulations. \n\n**Common mistakes**\n*   *Mistake:* Thinking laws don't apply to small jobs.\n*   *Correction:* Statutory law applies to *every* workplace, from a massive construction site to a private home repair.\n\n**Quick recap**\nStatutory Legislation and Regulations are the \"Must-Do\" rules. They are the law. Like the Highway Code, you cannot choose to ignore them."
      }
    },
    {
      "id": "210-2A-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Statutory Legislation",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-2A-C1-L1-A",
            "questionText": "What type of document is legally binding and mandatory, similar to the rules of the Highway Code?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Statutory Legislation",
              "Statutory law",
              "Act of Parliament",
              "Legislation"
            ],
            "hint": "This is the highest level of authority passed by Parliament."
          },
          {
            "id": "210-2A-C1-L1-B",
            "questionText": "Which documents provide the specific, detailed 'must-do' rules derived from an Act?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Regulations",
              "Statutory regulations"
            ],
            "hint": "Examples include the Electricity at Work Regulations."
          },
          {
            "id": "210-2A-C1-L1-C",
            "questionText": "Is compliance with Statutory Legislation optional or mandatory?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Mandatory",
              "Compulsory",
              "Not optional"
            ],
            "hint": "Do you have a choice in following the law?"
          },
          {
            "id": "210-2A-C1-L2",
            "questionText": "Explain the relationship between an Act of Parliament (like HSWA) and Regulations (like EAWR). Use the 'Highway Code' analogy or a similar comparison to explain why both must be followed.",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Acts provide the broad legal framework (like 'Drive Safely').",
              "Regulations provide the specific rules (like 'Speed Limit 30mph').",
              "Both are statutory and mandatory.",
              "Failure to follow either results in legal penalties."
            ],
            "expectedAnswer": [
              "The Act provides the broad legal goal (like the rule to drive safely), while Regulations provide the specific details (like the speed limit). Both are statutory, meaning they are mandatory laws. You must follow the Regulations to ensure you are complying with the Act.",
              "An Act of Parliament sets the general requirements for safety, and Regulations give the specific instructions on how to meet them. Just like you must follow both the general rules of the road and specific road signs, you must follow both Acts and Regulations to avoid breaking the law."
            ],
            "hint": "Think about the difference between a general goal (Safety) and a specific rule (Wear gloves)."
          }
        ]
      }
    },
    {
      "id": "210-2A-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Guidance, Standards, and Customer Information",
        "content": "### In this lesson\nNow we look at the documents that tell us *how* to do the work and *how* to communicate with customers. These are not 'laws' themselves, but they are essential for business and safety.\n\n**1. Non-Statutory Guidance & Standards**\nThese documents define \"good workmanship.\" They are not automatically law, but they are the industry standard.\n*   **British Standards (BS):** Technical specifications (e.g., BS 7671). They set the quality benchmark.\n*   **Guidance Notes:** Books (like IET Guidance Notes) that explain *how* to apply the British Standards in practice. They are like a \"textbook\" for the rules.\n*   **Approved Code of Practice (ACOP):** Has special legal status. If you follow an ACOP, you are safe. If you ignore it, you must prove your method was equally safe.\n\n**2. Manufacturer’s Instructions**\nThese are specific to one product (e.g., a boiler manual). They contain the exact installation steps. \n*   *Rule:* Always follow these to keep the **warranty** valid.\n\n**3. Customer Information (Commercial)**\nYou deal with customers using specific documents:\n*   **Quotation:** A **fixed price** offer. If you quote £500, you charge £500, even if the job takes longer. It is binding once accepted.\n*   **Estimate:** An **educated guess**. Used when you can't see all the work (e.g., inside a wall). The price might change.\n*   **Invoice:** The bill sent *after* the work is done to request payment.\n*   **Job Sheet:** A record of time and materials used, often signed by the customer to confirm the work was done.\n\n**Comparison: Quotation vs Estimate**\nImagine ordering food. A **Quotation** is like a menu price—it won't change. An **Estimate** is like a \"market price\" for fresh fish—it depends on the weight and availability on the day.\n\n**Key Points**\n*   **Guidance Notes** explain standards.\n*   **Quotations** are fixed; **Estimates** are guesses.\n*   **Invoices** are for payment.\n*   **Manufacturer Instructions** preserve warranties."
      }
    },
    {
      "id": "210-2A-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Guidance and Commercial Docs",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "210-2A-C2-L1-A",
            "questionText": "Which documents, such as those from the IET, explain 'how' to apply British Standards in a practical way?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Guidance Notes",
              "IET Guidance Notes",
              "Guidance documents"
            ],
            "hint": "These are like textbooks for the standards."
          },
          {
            "id": "210-2A-C2-L1-B",
            "questionText": "Which customer document represents a FIXED price offer that cannot be changed once accepted?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Quotation",
              "Quote",
              "Fixed price quotation"
            ],
            "hint": "Think of a menu price vs. a market price guess."
          },
          {
            "id": "210-2A-C2-L1-C",
            "questionText": "Which document must be followed to ensure a product's warranty remains valid?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Manufacturer’s Instructions",
              "Manufacturer instructions",
              "Manufacturer manual"
            ],
            "hint": "Provided by the company that made the equipment."
          },
          {
            "id": "210-2A-C2-L2",
            "questionText": "Explain the difference between a Quotation and an Estimate. Why is it important to choose the right one when dealing with a customer?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Quotation is a fixed price; Estimate is an approximate guess.",
              "Quotations are binding once accepted.",
              "Estimates can change if the work is more complex than expected.",
              "Choosing the wrong one can lead to payment disputes or losing money."
            ],
            "expectedAnswer": [
              "A Quotation is a fixed price offer that cannot be changed once accepted, whereas an Estimate is an educated guess that can change if the work turns out to be more than expected. It is important to choose the right one so the customer knows if the price is final or likely to vary, avoiding disputes later.",
              "You use a Quotation when the job is clear and risks are low, offering a fixed cost. You use an Estimate when the work is uncertain (like unknown wiring faults). Confusing them can make you liable for extra costs (if you gave a quote) or upset a customer (if an estimate rises too much)."
            ],
            "hint": "Focus on whether the price is 'fixed' or 'approximate'."
          }
        ]
      }
    },
    {
      "id": "210-2A-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "210-2A-P1",
            "questionText": "According to the lesson, how many main areas of information (e.g., installation, use, maintenance) are typically covered in Manufacturer’s Instructions?",
            "answerType": "numeric",
            "expectedAnswer": [
              "3"
            ],
            "hint": "Installation, Service/Maintenance, and User Instructions."
          },
          {
            "id": "210-2A-P2",
            "questionText": "Explain the legal significance of an Approved Code of Practice (ACOP) compared to standard guidance.",
            "answerType": "short-text",
            "expectedAnswer": [
              "It proves compliance",
              "Special legal status",
              "Burden of proof",
              "Demonstrates compliance"
            ],
            "hint": "If you follow it, you are considered to have met the law."
          },
          {
            "id": "210-2A-P3",
            "questionText": "If a requirement is 'Statutory', what choice does an employer have regarding compliance?",
            "answerType": "short-text",
            "expectedAnswer": [
              "No choice",
              "None",
              "Mandatory",
              "It is compulsory"
            ],
            "hint": "Think about the Highway Code rules—are they optional?"
          },
          {
            "id": "210-2A-P4",
            "questionText": "A technician needs to request payment from a client for a completed boiler service. Which document should they issue?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Invoice",
              "Tax invoice",
              "The invoice"
            ],
            "hint": "This is the bill sent after the work is done."
          },
          {
            "id": "210-2A-P5",
            "questionText": "Which document is an 'educated guess' at a price, used when the full extent of the work is not yet known?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Estimate",
              "An estimate"
            ],
            "hint": "It is not a fixed quotation."
          }
        ]
      }
    },
    {
      "id": "210-2A-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "210-2A-INT-1",
            "questionText": "Explain the relationship between Statutory Regulations and Guidance Notes. Why might a technician use Guidance Notes (like IET notes) even though they are not law? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Regulations are the mandatory law (what you must do).",
              "Guidance Notes explain the technical details (how to do it).",
              "Technicians use Guidance Notes to ensure they meet the standards required by the Regulations in a practical way."
            ],
            "expectedAnswer": [
              "Statutory Regulations set the mandatory legal requirements that must be met, while Guidance Notes provide the practical, technical explanation of how to meet those requirements. A technician uses Guidance Notes because they offer clear, illustrated examples and best practices that ensure the work complies with the complex legal wording of the Regulations.",
              "While Regulations are the law, they often don't tell you exactly which tool or method to use. Guidance Notes fill this gap by providing the 'how-to' instructions. Following them is the best way to ensure you are technically compliant with the mandatory laws."
            ],
            "hint": "Law tells you 'what' to achieve; Guidance tells you 'how' to achieve it."
          },
          {
            "id": "210-2A-INT-2",
            "questionText": "Scenario: You are quoting for a rewire. You are unsure of the wall condition. (1) Should you issue a Quotation or an Estimate? (2) Once the job is done, what document requests payment? (3) Which document records the hours worked? Answer in bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Issue an Estimate because the work scope is uncertain.",
              "Issue an Invoice to request payment.",
              "Use a Job Sheet (or Time Sheet) to record hours."
            ],
            "expectedAnswer": [
              "1. Issue an Estimate, because the wall condition is unknown so the price might change.",
              "2. Issue an Invoice to request payment after completion.",
              "3. A Job Sheet (or timesheet) records the hours worked."
            ],
            "hint": "Think about uncertainty (Estimate vs Quote) and the document flow (Job Sheet -> Invoice)."
          }
        ]
      }
    },
    {
      "id": "210-2A-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "210-2A-SR-1",
            "questionText": "What term describes the collection of written or digital records (like manuals and invoices) used in a professional setting?",
            "expectedAnswer": [
              "Documentation",
              "Workplace documentation",
              "Documents"
            ],
            "hint": "General term for paper/digital records.",
            "answerType": "short-text"
          },
          {
            "id": "210-2A-SR-2",
            "questionText": "Who provides the specific technical instructions for installing a piece of equipment to keep the warranty valid?",
            "expectedAnswer": [
              "Manufacturer",
              "The manufacturer"
            ],
            "hint": "The company that made the product.",
            "answerType": "short-text"
          },
          {
            "id": "210-2A-SR-3",
            "questionText": "What type of document is a 'Quotation'?",
            "expectedAnswer": [
              "Customer information",
              "Commercial document",
              "Financial document",
              "Fixed price offer"
            ],
            "hint": "It is a document given to a client offering a fixed price.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Legislation and Workplace Documentation"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2",
    "AC3"
  ],
  "metadata": {
    "created": "2026-02-17",
    "updated": "2026-02-17",
    "version": "1.1",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, PURPOSE_ONLY",
    "syllabusAnchors": {
      "unit": "210",
      "learningOutcome": "LO2",
      "coveredAC": [
        "AC1",
        "AC2",
        "AC3"
      ],
      "outOfScopeAC": [
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Identification and purpose of statutory legislation, guidance notes, British Standards, and customer information (quotes, estimates, invoices).",
      "outOfScope": "The procedural application of legislation or the practical completion of workplace documentation.",
      "rationale": "Establishing a conceptual understanding of the legal, technical, and commercial hierarchy is a prerequisite for practical tasks."
    },
    "teachingConstraints": {
      "excludeHowTo": true,
      "purposeOnly": true,
      "identificationOnly": true,
      "noCalculations": true,
      "specificScope": "Focus on identifying types and purposes of documentation, including customer-facing docs."
    },
    "misconceptions": [
      {
        "misconception": "Statutory legislation is only a suggestion for small businesses.",
        "correction": "Statutory law is legally binding and mandatory for all individuals and organizations regardless of size.",
        "relatedAC": "AC1"
      },
      {
        "misconception": "An estimate is a fixed price that cannot change.",
        "correction": "An estimate is an educated guess; a quotation is a fixed price.",
        "relatedAC": "AC3"
      },
      {
        "misconception": "British Standards are exactly the same as laws.",
        "correction": "British Standards are non-statutory guidance unless they are specifically written into a piece of legislation.",
        "relatedAC": "AC2"
      }
    ]
  }
}