{
  "id": "203-2B",
  "title": "203.2B — Symbols and Scaling in Drawings",
  "description": "Learn about Symbols and Scaling in Drawings in Installation 2365 Level 2",
  "layout": "linear-flow",
  "unit": "Unit 203",
  "topic": "Symbols and Scaling in Drawings",
  "learningOutcomes": [
    "Identify standard graphical symbols used in technical documentation",
    "Describe the purpose of scale ratios in technical drawings",
    "Calculate actual physical dimensions from scaled drawing measurements"
  ],
  "prerequisites": [
    "203-2A"
  ],
  "blocks": [
    {
      "id": "203-2B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Identify standard graphical symbols used in technical documentation",
            "bloomLevel": "remember"
          },
          {
            "text": "Describe the purpose of scale ratios in technical drawings",
            "bloomLevel": "understand"
          },
          {
            "text": "Calculate actual physical dimensions from scaled drawing measurements",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "203-2B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Graphical Symbol",
            "definition": "A standardized visual representation used to identify a specific component or feature within a drawing, not a realistic illustration of its physical appearance."
          },
          {
            "term": "Legend",
            "definition": "A reference list that defines the specific meaning of symbols and abbreviations used in a drawing, different from a title block because it focuses on technical interpretation rather than project metadata."
          },
          {
            "term": "Scale Ratio",
            "definition": "The fixed mathematical relationship between a measurement on a drawing and the actual physical dimension of the object, different from a dimension because it represents a proportion rather than a fixed length."
          },
          {
            "term": "Dimension",
            "definition": "A specific measurement on a drawing representing the actual size or position of a feature in real-world units, not the physical length of the line as measured on the paper."
          },
          {
            "term": "Scaling Factor",
            "definition": "The numerical multiplier used to convert a measured drawing distance into its true physical size, which is determined by the specific scale ratio applied to the document."
          }
        ]
      }
    },
    {
      "id": "203-2B-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "Symbols and Scaling in Drawings Diagram",
        "description": "Visual representation of Symbols and Scaling in Drawings",
        "videoUrl": "",
        "diagramType": "concept",
        "elementIds": [
          "graphical-symbol",
          "legend-block",
          "dimension-line",
          "scale-ratio-indicator"
        ],
        "placeholderText": "The diagram should show a portion of a technical floor plan. On the left, a 'graphical-symbol' (like a circle with a cross) is placed within a room. A 'dimension-line' with arrows at both ends and a numerical value (e.g., 2500mm) indicates the width of the room. On the right side, a 'legend-block' shows the same symbol with a text description next to it. At the bottom of the drawing, a 'scale-ratio-indicator' clearly displays 'Scale 1:50'."
      }
    },
    {
      "id": "203-2B-explain-1",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Technical Symbols",
        "content": "### In this lesson\nYou will learn how to identify and interpret the visual shorthand used in technical documentation to represent physical components. This knowledge allows you to read complex plans accurately across different technical fields. \n\n*   Recognising the role of a **Graphical Symbol** in documentation.\n*   Using a **Legend** to verify component identities.\n*   Distinguishing between realistic illustrations and technical symbols.\n\n**What this is**\nIn technical documentation, a **Graphical Symbol** is a standardized visual representation used to identify a specific component or feature within a drawing. It is important to note that this is not a realistic illustration of the object's physical appearance. Instead, it is a simplified shape or icon that communicates function or type. To ensure these symbols are understood by everyone reading the document, they are typically listed in a **Legend**. This is a reference list that defines the specific meaning of symbols and abbreviations used in a drawing. It is different from a title block because it focuses on technical interpretation rather than project metadata like the date or author.\n\n**Why it matters**\nTechnical drawings must remain clear even when they contain hundreds of individual parts. If every component were drawn as a detailed, realistic picture, the drawing would become cluttered and impossible to read. By using standard symbols, designers can convey complex information in a small space. This standardisation ensures that a technician in one city can perfectly understand a drawing produced by an engineer in another, reducing the risk of installation errors or safety hazards. Without a consistent **Legend**, the meaning of these symbols could be misinterpreted, leading to costly mistakes.\n\n**Key facts / rules**\n*   Symbols represent the function or category of a component, not its physical size.\n*   Standardisation allows for cross-industry communication between different technical roles.\n*   A **Legend** must be consulted to confirm the specific version of a symbol being used.\n*   Symbols are typically simplified into geometric shapes like circles, squares, or triangles.\n*   Orientation of a symbol can sometimes change its meaning depending on the specific standard applied.\n*   Always verify the current edition or version of the symbol standards used in your specific field.\n\n**How to recognise it**\nTo recognise symbols effectively, you must look for recurring geometric patterns rather than photographic detail. For example, a small circle might represent a connection point in one context or a light source in another. You should first locate the **Legend** on the drawing sheet—often found in the corner or on a separate cover page—and match the shapes on the plan to the definitions provided. If you see two different symbols that look similar, such as a solid circle versus a hollow circle, the **Legend** will clarify if they represent different grades or types of the same component.\n\nConcrete Anchor: Think of the icons on a smartphone or a digital map. A small picture of a fork and knife doesn't look like a specific building, but you instantly recognise it represents a restaurant. Similarly, a **Graphical Symbol** is a functional shortcut for a real-world object.\n\n**Common mistakes**\nLearners often confuse a **Graphical Symbol** with a realistic illustration; a **Graphical Symbol** is a simplified functional icon, whereas a realistic illustration attempts to show exactly what the object looks like. Another common error is ignoring the **Legend** and assuming a symbol means the same thing across all types of drawings. \n\nMisconceptions (targeted):\n*   Misconception: Symbols are drawn to the same scale as the physical component. | Correction: Symbols are usually a fixed size for clarity and do not represent the physical dimensions of the part. | AC: 203.LO2.AC2.3\n*   Misconception: A symbol's meaning is universal and never changes. | Correction: While many are standard, you must always check the **Legend** as symbols can vary between different standards or projects. | AC: 203.LO2.AC2.3\n\n**Key Points**\n*   A **Graphical Symbol** is a functional icon, not a picture.\n*   The **Legend** is the primary tool for decoding drawing symbols.\n*   Standardisation prevents confusion and improves safety.\n*   Always check the specific drawing's reference list before starting work.\n\n**Quick recap**\nTechnical drawings use a **Graphical Symbol** to represent parts clearly without cluttering the page with realistic detail. These symbols are defined in a **Legend**, which acts as a dictionary for the drawing. By matching symbols to the definitions in the legend, you can accurately identify every component required for a task.\n\n### Coming Up Next\nNow that you can identify what the components are, we will look at how to determine their actual size and position using scales and dimensions."
      }
    },
    {
      "id": "203-2B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Technical Symbols",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-2B-C1-L1-A",
            "questionText": "What is the difference between a graphical symbol and a realistic illustration in technical documentation?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "symbol is functional illustration is realistic",
              "symbols are simplified icons",
              "illustration shows physical appearance",
              "symbols show function not appearance"
            ],
            "hint": "Think about whether the drawing looks like a photo or a simplified icon."
          },
          {
            "id": "203-2B-C1-L1-B",
            "questionText": "What reference list is used to define the specific meaning of symbols and abbreviations in a drawing?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Legend",
              "the legend",
              "a legend"
            ],
            "hint": "This list acts like a dictionary for the symbols used on the plan."
          },
          {
            "id": "203-2B-C1-L1-C",
            "questionText": "What do symbols represent instead of the physical size of a component?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "function or category",
              "component function",
              "category of component",
              "function and type"
            ],
            "hint": "Symbols communicate what a part does rather than how big it is."
          },
          {
            "id": "203-2B-C1-L2",
            "questionText": "Using your answers to Q1 (symbol vs illustration), Q2 (the legend), and Q3 (function vs size), explain how these connect to ensure a technician identifies components correctly. Why must a technician consult the legend even if they recognize a symbol's general shape?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Symbols are simplified functional icons rather than realistic pictures",
              "The legend provides the specific definition for these functional icons",
              "Because symbols do not show physical size, the legend is required to confirm the exact type or category",
              "Technicians must use the legend because a single shape can represent different components in different standards"
            ],
            "expectedAnswer": [
              "Graphical symbols are functional icons rather than realistic pictures, meaning they do not show the physical size of a part. Because of this simplification, a technician must use the legend to verify the specific category or meaning of the shape to avoid misinterpretation.",
              "Since symbols represent a category or function instead of a realistic appearance, the legend is the only way to confirm what the simplified shape actually represents. We know this is necessary because symbols are not drawn to scale and their meanings can vary between projects."
            ],
            "hint": "Consider how the lack of realistic detail and physical scale makes a reference list necessary for identification."
          }
        ]
      }
    },
    {
      "id": "203-2B-explain-2",
      "type": "explanation",
      "order": 5,
      "content": {
        "title": "Scaling and Dimensioning",
        "content": "### In this lesson\nYou will learn how to translate the small measurements found on a paper or digital drawing into the actual sizes required for physical installation. This involves understanding the relationship between drawing units and real-world units.\n\n*   Defining the purpose of a **Scale Ratio**.\n*   Distinguishing between a **Dimension** and a measured line.\n*   Using a **Scaling Factor** to calculate physical sizes.\n\n**What this is**\nTechnical drawings are rarely the same size as the objects they represent. To fit a large system onto a piece of paper, we use a **Scale Ratio**, which is the fixed mathematical relationship between a measurement on a drawing and the actual physical dimension of the object. This is different from a **Dimension**, which is a specific measurement written on a drawing representing the actual size or position of a feature in real-world units, regardless of how long the line appears on the paper. To convert a physical measurement taken from the drawing sheet into a real-world value, we apply a **Scaling Factor**, which is the numerical multiplier derived from the ratio.\n\n**Why it matters**\nAccuracy is critical in technical work. If a technician miscalculates the size of a component or its distance from a wall, the entire installation might fail to fit or may violate safety clearances. Understanding how to use a **Scale Ratio** allows you to plan materials and space before any physical work begins. It ensures that every part of a project, from the smallest bracket to the largest enclosure, is accounted for in its true size, even when viewed on a small screen or printed sheet.\n\n**Key facts / rules**\n*   A **Scale Ratio** is usually expressed as 1:X (e.g., 1:50 or 1:100).\n*   The first number (1) typically represents the measurement on the drawing.\n*   The second number (X) represents the actual size in the real world.\n*   A **Dimension** written on the drawing always takes priority over a measurement taken with a ruler.\n*   The **Scaling Factor** is the number you multiply by to find the real-world size.\n*   Always verify the scale in the title block, as different parts of a drawing may use different scales.\n\n**How to calculate it**\nTo find the actual physical size of an object, you first identify the **Scale Ratio** (for example, 1:20). This tells you that the real object is 20 times larger than the drawing. The **Scaling Factor** in this case is 20. You then measure the distance on the drawing using a ruler. Finally, multiply your measurement by the scaling factor. If the drawing measurement is 50mm and the ratio is 1:20, the calculation is 50mm x 20 = 1000mm (or 1 metre). \n\nConcrete Anchor: Imagine a toy car. If the toy is marked as 1:24 scale, it means the real car is exactly 24 times larger than the toy. If you measured the toy's wheel as 1cm, the real car's wheel would be 24cm.\n\nMicro-scenario: If a drawing has a **Scale Ratio** of 1:100 and you measure a wall length as 40mm on the paper, the actual physical length is 4000mm (4 metres). If you were comparing this to a 1:50 drawing where the same wall measures 80mm, both represent the same 4-metre physical **Dimension**.\n\n**Common mistakes**\nLearners often confuse a **Dimension** with the physical length of the line as measured on the paper; a **Dimension** is the real-world value written on the drawing, whereas the paper measurement is only a representation. Another mistake is using the wrong **Scaling Factor** by dividing instead of multiplying, or vice versa, when moving between the drawing and the real world.\n\nMisconceptions (targeted):\n*   Misconception: You can determine the size of any object just by measuring the paper with a ruler. | Correction: You must use the **Scale Ratio** to convert that measurement, or rely on the written **Dimension** which is more accurate. | AC: 203.LO2.AC2.4\n*   Misconception: A 1:100 scale drawing is larger than a 1:50 scale drawing. | Correction: A 1:100 scale means the object is shrunk 100 times, making the drawing smaller than a 1:50 version. | AC: 203.LO2.AC2.4\n\n**Key Points**\n*   The **Scale Ratio** keeps the drawing proportional to the real world.\n*   Written **Dimension** values are the most reliable source of size information.\n*   The **Scaling Factor** is the multiplier used for conversion.\n*   Always check the drawing title block to confirm the scale before calculating.\n\n**Quick recap**\nScaling allows large objects to be represented accurately on small sheets. By using the **Scale Ratio**, you can find the **Scaling Factor** needed to turn a drawing measurement into a real-world **Dimension**. This mathematical relationship ensures that everything built from the drawing will fit perfectly in the physical environment.\n\n### Coming Up Next\nIn the next lesson, we will apply these identification and calculation skills to read full layout drawings and identify specific installation requirements."
      }
    },
    {
      "id": "203-2B-check-2",
      "type": "practice",
      "order": 5.5,
      "content": {
        "title": "Check Your Understanding: Scaling and Dimensioning",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "203-2B-C2-L1-A",
            "questionText": "What source of size information always takes priority over a measurement taken with a ruler?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Dimension written on the drawing",
              "written dimension",
              "the dimension",
              "written dimensions"
            ],
            "hint": "Look for the specific numerical values printed directly on the plan."
          },
          {
            "id": "203-2B-C2-L1-B",
            "questionText": "What term describes the fixed mathematical relationship between a drawing measurement and the actual physical dimension?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Scale Ratio",
              "the scale ratio",
              "a scale ratio"
            ],
            "hint": "This is usually expressed as two numbers separated by a colon, such as 1:50."
          },
          {
            "id": "203-2B-C2-L1-C",
            "questionText": "What is the numerical multiplier used to calculate the real-world size from a drawing measurement?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": [
              "Scaling Factor",
              "the scaling factor",
              "a scaling factor"
            ],
            "hint": "This number is derived from the ratio and is used in multiplication."
          },
          {
            "id": "203-2B-C2-L2",
            "questionText": "Using your answers to Q1 (written dimensions), Q2 (scale ratio), and Q3 (scaling factor), explain how these concepts work together to determine an object's actual size. How do we know which value to use if a ruler measurement contradicts a written dimension?",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "The scale ratio defines the scaling factor used to convert ruler measurements",
              "The scaling factor is the multiplier applied to paper measurements to find the real-world size",
              "Written dimensions are the most reliable source and override any calculated measurements",
              "We know to prioritize written dimensions because ruler measurements are only representations and can be less accurate"
            ],
            "expectedAnswer": [
              "The scale ratio provides the scaling factor, which is the multiplier used to turn a measurement into a real-world size. However, if a written dimension is present, it must be used instead because written values always take priority over manual ruler measurements for accuracy.",
              "To find a size, you multiply a measurement by the scaling factor derived from the scale ratio. We know that the written dimension is the most valid value to use because it is the primary source of truth on a drawing, even if a calculation using a ruler suggests a different size."
            ],
            "hint": "Explain how the ratio and factor are used for calculation, and identify which piece of information is the 'master' value."
          }
        ]
      }
    },
    {
      "id": "203-2B-worked-example",
      "type": "worked-example",
      "order": 6,
      "content": {
        "title": "Worked Example: Identifying Components and Calculating Dimensions",
        "given": "A technical drawing displays a triangle symbol. The Legend identifies the triangle as a 'Support Pillar'. The title block lists a Scale Ratio of 1:50. A measurement taken on the drawing for the pillar width is 10mm.",
        "steps": [
          {
            "stepNumber": 1,
            "description": "Identify context/constraints: Locate the triangle symbol on the plan and the 1:50 Scale Ratio in the title block.",
            "formula": null,
            "calculation": null,
            "result": "Triangle symbol, 1:50 Scale Ratio"
          },
          {
            "stepNumber": 2,
            "description": "Select appropriate option: Match the triangle symbol to the 'Support Pillar' entry in the Legend and identify the Scaling Factor as 50.",
            "formula": null,
            "calculation": null,
            "result": "Support Pillar, Scaling Factor 50"
          },
          {
            "stepNumber": 3,
            "description": "State purpose/result: Determine the real-world Dimension by multiplying the drawing measurement by the Scaling Factor (10mm x 50).",
            "formula": null,
            "calculation": null,
            "result": "500mm"
          },
          {
            "stepNumber": 4,
            "description": "State common wrong choice and why: Confusing the symbol with a realistic illustration, which incorrectly assumes the icon represents the physical appearance of the pillar.",
            "formula": null,
            "calculation": null,
            "result": "Realistic illustration error"
          }
        ],
        "notes": "Always verify the current edition or version of the symbol standards used in your specific field. Ensure the Scale Ratio applies to the specific section of the drawing being measured."
      }
    },
    {
      "id": "203-2B-guided",
      "type": "guided-practice",
      "order": 7,
      "content": {
        "title": "Guided Practice (We Do)",
        "problem": "A technician is reviewing a plan with a circular symbol. The Legend defines the circle as an 'Access Point'. The title block confirms a Scale Ratio of 1:100. A measurement of 5mm is taken from the drawing.",
        "steps": [
          {
            "stepNumber": 1,
            "prompt": "Identify the Scale Ratio provided in the title block for this drawing.",
            "expectedAnswer": [
              "1:100",
              "1 to 100"
            ],
            "hint": "Check the title block for the mathematical relationship between the drawing and the real world."
          },
          {
            "stepNumber": 2,
            "prompt": "Identify the name of the component represented by the circular symbol according to the Legend.",
            "expectedAnswer": [
              "Access Point",
              "Access Point symbol"
            ],
            "hint": "Look at the reference list that defines the shorthand icons used in the drawing."
          },
          {
            "stepNumber": 3,
            "prompt": "Calculate the real-world dimension (in mm) for a 5mm drawing measurement using the 100x scaling factor.",
            "expectedAnswer": [
              "500"
            ],
            "hint": "Multiply the drawing measurement by the second number in the scale ratio."
          },
          {
            "stepNumber": 4,
            "prompt": "What is the common error of treating a functional shorthand icon as if it were a detailed picture of the object?",
            "expectedAnswer": [
              "Realistic illustration",
              "Realistic picture"
            ],
            "hint": "Think of the term for a drawing that shows exactly what an object looks like instead of just its function."
          }
        ]
      }
    },
    {
      "id": "203-2B-practice",
      "type": "practice",
      "order": 8,
      "content": {
        "title": "Your Turn (You Do)",
        "questions": [
          {
            "id": "203-2B-P1",
            "questionText": "Why is a graphical symbol used on a complex technical plan instead of a realistic illustration of the component?",
            "answerType": "short-text",
            "expectedAnswer": [
              "avoid clutter",
              "prevent clutter",
              "maintain clarity",
              "standardisation"
            ],
            "hint": "Think about how a drawing would look if every part was a detailed picture."
          },
          {
            "id": "203-2B-P2",
            "questionText": "A drawing has a Scale Ratio of 1:25. If a technician measures a distance of 40mm on the paper with a ruler, what is the actual physical distance in the real world?",
            "answerType": "numeric",
            "expectedAnswer": [
              "1000"
            ],
            "hint": "Multiply the drawing measurement by the scaling factor (25). Provide the answer in mm."
          },
          {
            "id": "203-2B-P3",
            "questionText": "A physical component is 1500mm long. If it is drawn at a Scale Ratio of 1:50, how many millimeters long will the line be on the drawing sheet?",
            "answerType": "numeric",
            "expectedAnswer": [
              "30"
            ],
            "hint": "Divide the real-world dimension by the scaling factor (50). Provide the answer in mm."
          },
          {
            "id": "203-2B-P4",
            "questionText": "On a layout of a city's utility network, a small solid square is used to represent a connection hub. What is the technical term for this specific visual shorthand?",
            "answerType": "short-text",
            "expectedAnswer": [
              "graphical symbol",
              "symbol",
              "technical symbol"
            ],
            "hint": "This is a standardized icon used to represent a functional part."
          },
          {
            "id": "203-2B-P5",
            "questionText": "What must be true if a technician finds that a physical measurement taken from a drawing using a ruler contradicts the written Dimension value provided on the same drawing?",
            "answerType": "short-text",
            "expectedAnswer": [
              "dimension takes priority",
              "written dimension takes priority",
              "the dimension is correct"
            ],
            "hint": "Recall which piece of information is considered the most reliable source for sizing."
          }
        ]
      }
    },
    {
      "id": "203-2B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "sequential": true,
        "questions": [
          {
            "id": "203-2B-INT-1",
            "questionText": "Explain the relationship between identifying graphical symbols and applying scale ratios when interpreting a technical drawing for a physical installation. In your answer, include: (1) the role of the legend in symbol identification, (2) the function of the scale ratio in determining size, and (3) how these two elements together ensure the correct component is installed in the correct space. Why must both be verified before starting work? (2-3 sentences)",
            "answerType": "long-text",
            "cognitiveLevel": "connection",
            "keyPoints": [
              "Identifies that the legend provides the definition for graphical symbols to prevent misidentification of components.",
              "Explains that the scale ratio provides the mathematical relationship between the drawing and the real-world object.",
              "Connects symbol identification to component type and scale ratios to component footprint/placement.",
              "Argues that knowing 'what' a component is (symbol) is insufficient without knowing 'how large' it is (scale) for installation accuracy.",
              "Concludes that both are necessary to prevent installation errors or spatial conflicts."
            ],
            "expectedAnswer": [
              "The legend allows a technician to identify exactly what component a graphical symbol represents, while the scale ratio allows them to calculate the actual physical space that component will occupy. Both must be verified because identifying the correct part is useless if the calculated dimensions do not fit the available installation area, and vice versa. This relationship ensures that the right equipment is placed with the correct clearances.",
              "Technicians use the legend to confirm symbol meanings and the scale ratio to translate drawing measurements into physical dimensions. This relationship holds because technical documentation requires both qualitative identification and quantitative measurement to be actionable. If only the symbol is known, the size is a guess; if only the scale is known, the component type remains ambiguous."
            ],
            "hint": "Think about what information is missing if you only have the name of a component but not its size, or its size but not its name."
          },
          {
            "id": "203-2B-INT-2",
            "questionText": "Describe the complete workflow required to determine the actual size and type of a component from a technical drawing. In your answer, include: (1) the use of graphical symbols, (2) the verification process using a legend, (3) the application of scale ratios to measured lines, and (4) how these factors integrate to produce accurate physical dimensions. Answer in 3-4 sentences OR concise bullet points.",
            "answerType": "long-text",
            "cognitiveLevel": "synthesis",
            "keyPoints": [
              "Initial identification of the component through its unique graphical symbol.",
              "Verification of the symbol's specific meaning using the drawing's legend.",
              "Measurement of the symbol or associated dimension lines using a standard unit.",
              "Selection of the correct scale ratio provided in the documentation.",
              "Application of a scaling factor to the measured drawing units.",
              "Calculation of the final physical dimension for installation.",
              "Integration of the component type and size to ensure specification compliance.",
              "Maintenance of technical precision by distinguishing between a drawn line and a real-world dimension."
            ],
            "expectedAnswer": [
              "First, identify the component by matching its graphical symbol to the definition found in the drawing's legend. Next, measure the required dimensions on the drawing and apply the specified scale ratio to calculate the actual physical size. By combining the verified component type with these calculated measurements, you ensure the physical installation matches the technical design. This workflow integrates symbol recognition with mathematical scaling to achieve high precision.",
              "• Use the legend to confirm the identity of the graphical symbols found on the drawing.\n• Measure the drawing units and multiply them by the scaling factor derived from the scale ratio.\n• Integrate the identified component type with the calculated physical dimensions to determine installation requirements.\n• Verify that the final physical dimensions are used for procurement and placement rather than the raw drawing measurements."
            ],
            "hint": "Follow the path from seeing a shape on the paper to knowing exactly what to buy and how much space to clear for it."
          }
        ]
      }
    },
    {
      "id": "203-2B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Foundation Check",
        "questions": [
          {
            "id": "203-2B-SR-1",
            "questionText": "What is the general name for visual documents used to communicate design and construction details?",
            "expectedAnswer": [
              "technical drawings",
              "drawings",
              "technical drawing"
            ],
            "hint": "Refer to the previous lesson on drawing types.",
            "answerType": "short-text"
          },
          {
            "id": "203-2B-SR-2",
            "questionText": "What term describes a regulation that is legally mandatory to follow?",
            "expectedAnswer": [
              "statutory",
              "statutory regulation",
              "statutory regulations"
            ],
            "hint": "Think about the types of regulations covered in Lesson 1.",
            "answerType": "short-text"
          },
          {
            "id": "203-2B-SR-3",
            "questionText": "What is the collective term for the manuals, data sheets, and drawings used to provide project details?",
            "expectedAnswer": [
              "technical information",
              "technical documentation",
              "documentation"
            ],
            "hint": "Look at the title of the previous lesson on information types.",
            "answerType": "short-text"
          }
        ],
        "notes": "Foundation check before starting Symbols and Scaling in Drawings"
      }
    }
  ],
  "targetAssessmentCriteria": [
    "AC1",
    "AC2"
  ],
  "metadata": {
    "created": "2026-02-19",
    "updated": "2026-02-19",
    "version": "1.0",
    "author": "C&G 2365 Learning Team",
    "taskMode": "IDENTIFICATION, CALCULATION",
    "syllabusAnchors": {
      "unit": "203",
      "learningOutcome": "LO2",
      "coveredAC": [
        "AC1",
        "AC2"
      ],
      "outOfScopeAC": [
        "AC3",
        "AC4",
        "AC5"
      ]
    },
    "scope": {
      "inScope": "Interpretation of technical symbols and the mathematical conversion of scale ratios to actual dimensions.",
      "outOfScope": "The manual production of technical drawings or the use of computer-aided design (CAD) software.",
      "rationale": "The lesson focuses on the extraction and interpretation of data from existing documentation rather than the creation of new drawings."
    },
    "teachingConstraints": {
      "excludeHowTo": false,
      "purposeOnly": false,
      "identificationOnly": false,
      "noCalculations": false,
      "specificScope": "Focus on interpreting documentation and applying scale ratios."
    },
    "misconceptions": [
      {
        "misconception": "Symbols are drawn to the same scale as the physical component.",
        "correction": "Symbols are usually a fixed size for clarity and do not represent the physical dimensions of the part.",
        "relatedAC": "AC2.3"
      },
      {
        "misconception": "A symbol's meaning is universal and never changes.",
        "correction": "While many are standard, you must always check the Legend as symbols can vary between different standards or projects.",
        "relatedAC": "AC2.3"
      },
      {
        "misconception": "You can determine the size of any object just by measuring the paper with a ruler.",
        "correction": "You must use the Scale Ratio to convert that measurement, or rely on the written Dimension which is more accurate.",
        "relatedAC": "AC2.4"
      }
    ]
  }
}