{
  "id": "204-12B",
  "title": "204.12B — Inspection Decisions and Recording: Pass, Suspicious, Stop-and-Fix",
  "description": "Learn how to categorize dead-inspection findings, decide when to halt work for safety/validity, and record defects clearly on a training rig (inspection only — no meter tests).",
  "layout": "split-vis",
  "unit": "Unit 204",
  "topic": "Electrical Installations Technology",
  "learningOutcomes": [
    "Define the three inspection outcome categories: Pass, Suspicious, and Stop-and-fix",
    "Describe clear criteria for immediate work stoppage during a dead inspection (training-rig context)",
    "Record inspection findings accurately including category, location, defect, and required action",
    "Explain how common visual/mechanical defects can lead to unreliable or misleading test results later"
  ],
  "prerequisites": [
    "204-11A",
    "204-11B",
    "204-11C",
    "204-12A"
  ],
  "blocks": [
    {
      "id": "204-12B-outcomes",
      "type": "outcomes",
      "order": 1,
      "content": {
        "outcomes": [
          {
            "text": "Categorize inspection findings as Pass, Suspicious, or Stop-and-fix using clear criteria",
            "bloomLevel": "understand"
          },
          {
            "text": "Explain why safety-critical visual defects (e.g., exposed copper, damaged insulation, missing/unterminated CPC) require stopping before meter work",
            "bloomLevel": "understand"
          },
          {
            "text": "Record a defect professionally using category + location + defect + required action",
            "bloomLevel": "apply"
          }
        ]
      }
    },
    {
      "id": "204-12B-vocab",
      "type": "vocab",
      "order": 2,
      "content": {
        "terms": [
          {
            "term": "Stop-and-Fix",
            "definition": "A safety or validity-critical defect. Do not proceed to meter work until corrected (e.g., exposed copper, damaged insulation with visible conductor, missing/unterminated CPC, loose termination likely to fail, incorrect accessory creating unsafe condition)."
          },
          {
            "term": "Suspicious",
            "definition": "A non-immediate hazard but a quality/validity concern that should be corrected or re-checked before meter work because it can mislead results (e.g., missing sleeving/ID, minor strain on terminations, unclear marking, slight discoloration that needs checking)."
          },
          {
            "term": "Pass",
            "definition": "No visible/mechanical issues found. CPC is present/terminated/identified, terminations are secure with no exposed copper, accessories are correct, and the circuit is ready for meter work."
          },
          {
            "term": "Exposed Copper",
            "definition": "A condition where conductor copper is visible outside a terminal or where damaged insulation leaves copper accessible. Treat as Stop-and-fix."
          },
          {
            "term": "Termination",
            "definition": "The physical connection of a conductor into a terminal/accessory. Quality depends on correct terminal, correct clamping on copper (not insulation), correct conductor seating, and secure tightness."
          }
        ]
      }
    },
    {
      "id": "204-12B-diagram",
      "type": "diagram",
      "order": 3,
      "content": {
        "title": "The Inspection Decision Matrix",
        "description": "A simple workflow for processing findings in a consistent inspection order on a training rig.",
        "videoUrl": "",
        "diagramType": "other",
        "elementIds": [
          "supply_point",
          "switch_points",
          "light_points",
          "terminations"
        ],
        "placeholderText": "Flow: Start at Supply -> Switch point(s) -> Load point(s) -> Re-check terminations/cable condition. At each point: classify as Pass / Suspicious / Stop-and-fix, then record: Category + Location + Defect + Action."
      }
    },
    {
      "id": "204-12B-explain-decisions",
      "type": "explanation",
      "order": 4,
      "content": {
        "title": "Categorizing Your Findings",
        "content": "During a dead inspection, you are not just looking — you are making decisions that affect (1) safety and (2) whether later meter results can be trusted. Every observation should be classified as one of three outcomes:\n\n1) **Pass** (green): The installation looks physically sound and correctly identified. CPC is present and terminated, terminations are tight, no exposed copper, insulation is intact, and accessories/terminals are correct.\n\n2) **Suspicious** (yellow): Not an immediate danger, but a reliability/quality issue that can mislead testing. Examples: missing sleeving/ID where a core role could be misread, unclear marking, mild discoloration that needs checking, minor strain on terminations. Correct or re-check before meter work.\n\n3) **Stop-and-fix** (red): Do not proceed to meter work until corrected. Examples: exposed copper, damaged insulation with copper visible, missing or unterminated CPC at any point, loose termination likely to slip/overheat, incorrect accessory/terminal use that creates an unsafe condition.\n\n**Inspection order (repeatable routine):** Start at the supply point/terminals, move through switch point(s), then the load point(s) (lamp/socket), and finish with a re-check of cable condition and terminations.\n\n**Recording findings (must be specific):** Avoid vague notes. Use this structure:\n- **Category:** Pass / Suspicious / Stop-and-fix\n- **Location:** point + accessory + terminal (e.g., \"Switch 1, L1\" or \"Ceiling point, CPC terminal\")\n- **Defect:** what exactly is wrong\n- **Action required/taken:** what must be done before proceeding\n\n**Link to later test problems (concept only):** Loose/poor terminations often produce unstable or high continuity readings. Missing identification can lead you to test the wrong points and misinterpret results."
      }
    },
    {
      "id": "204-12B-check-1",
      "type": "practice",
      "order": 4.5,
      "content": {
        "title": "Check Your Understanding: Inspection Logic",
        "mode": "conceptual",
        "sequential": true,
        "questions": [
          {
            "id": "204-12B-C1-L1-A",
            "questionText": "Which category is used for a defect that poses an immediate safety or validity risk (meaning you must not proceed to meter work)?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Stop-and-Fix",
            "hint": "It means you stop and correct the issue before continuing."
          },
          {
            "id": "204-12B-C1-L1-B",
            "questionText": "Where should a standard inspection sequence usually begin?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Supply point",
            "hint": "Start where the circuit originates on the rig."
          },
          {
            "id": "204-12B-C1-L1-C",
            "questionText": "If a CPC is missing or not terminated at a point in the circuit, what is the required decision?",
            "answerType": "short-text",
            "cognitiveLevel": "recall",
            "expectedAnswer": "Stop-and-Fix",
            "hint": "Protective continuity must be maintained through the circuit."
          },
          {
            "id": "204-12B-C1-L2",
            "questionText": "How does identifying a loose termination during inspection help you during the later testing phase?",
            "answerType": "short-text",
            "cognitiveLevel": "connection",
            "expectedAnswer": "It prevents unreliable or unstable readings and reduces overheating risk",
            "hint": "Loose contact can change resistance and create heat."
          }
        ]
      }
    },
    {
      "id": "204-12B-worked-example",
      "type": "worked-example",
      "order": 5,
      "content": {
        "title": "Worked Example: Recording a Defect",
        "given": "You are inspecting a training rig. At the intermediate switch, you notice the line conductor has 5mm of copper visible outside the terminal.",
        "steps": [
          {
            "stepNumber": 1,
            "description": "Classify the finding.",
            "formula": null,
            "calculation": null,
            "result": "Stop-and-Fix (exposed copper)"
          },
          {
            "stepNumber": 2,
            "description": "Identify the specific location.",
            "formula": null,
            "calculation": null,
            "result": "Intermediate switch, L1 terminal"
          },
          {
            "stepNumber": 3,
            "description": "Record the finding professionally (category + location + defect + action).",
            "formula": null,
            "calculation": null,
            "result": "Category: Stop-and-fix. Location: Intermediate switch, L1. Defect: Copper visible outside terminal. Action: Re-terminate conductor so no exposed copper remains."
          }
        ],
        "notes": "Fix Stop-and-fix issues before any meter work."
      }
    },
    {
      "id": "204-12B-practice",
      "type": "practice",
      "order": 7,
      "content": {
        "title": "Inspection Scenarios",
        "questions": [
          {
            "id": "204-12B-P1",
            "questionText": "You find a CPC conductor terminated in the earth terminal but with no green/yellow sleeving/ID at the termination. What category best fits this finding on a training rig?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Suspicious"
            ],
            "hint": "The earth path may still exist, but identification is not acceptable for reliable work."
          },
          {
            "id": "204-12B-P2",
            "questionText": "While checking a socket, the insulation on the Neutral is nicked and the copper core is visible. What is your decision?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Stop-and-Fix",
              "Stop and fix"
            ],
            "hint": "Visible copper due to insulation damage is a stop issue."
          },
          {
            "id": "204-12B-P3",
            "questionText": "What four details make an inspection record professional and actionable?",
            "answerType": "short-text",
            "expectedAnswer": [
              "Category, Location, Defect, Action",
              "Category / Location / Defect / Action"
            ],
            "hint": "It’s not just what/where — include the decision category too."
          }
        ]
      }
    },
    {
      "id": "204-12B-integrative",
      "type": "practice",
      "order": 9.5,
      "content": {
        "title": "Putting It All Together",
        "mode": "integrative",
        "questions": [
          {
            "id": "204-12B-INT-1",
            "questionText": "During an inspection of a lighting circuit, you find (1) the CPC loose/unterminated at the supply and (2) exposed copper at the switch. Describe your immediate actions, the categories for these findings, and give an example of how each would be recorded.",
            "answerType": "short-text",
            "cognitiveLevel": "synthesis",
            "expectedAnswer": "Stop work. Both are Stop-and-fix. Record each as: Category + location + defect + action. Example: 'Stop-and-fix — Supply point, CPC terminal: CPC loose/unterminated. Action: Terminate CPC securely and confirm identification.' 'Stop-and-fix — Switch, L1: copper visible outside terminal. Action: Re-terminate so no exposed copper remains.'",
            "hint": "Use the record template and treat both as stop issues before meter work."
          }
        ]
      }
    },
    {
      "id": "204-12B-spaced-review",
      "type": "spaced-review",
      "order": 10,
      "content": {
        "title": "Spaced Review",
        "questions": [
          "What colour sleeving/ID is used for a CPC at terminations?",
          "Name one visual check performed on a cable's outer sheath during inspection.",
          "What is the main purpose of a dead inspection before using meters?",
          "True or False: A loose connection can cause localized heating and fire risk."
        ],
        "notes": "Reinforcing inspection-first decisions and recording habits for rig-safe work."
      }
    }
  ],
  "metadata": {
    "created": "2026-01-28",
    "updated": "2026-01-28",
    "version": "1.1",
    "author": "C&G 2365 Learning Team"
  },
  "diagnostic": {
    "enabled": true,
    "questionCount": 10,
    "passThreshold": 0.8,
    "sourceType": "cumulative",
    "allowSkip": true
  }
}
